{
	"extraction_metadata": {
		"article_title": "Give Away Your Digital Services: Leveraging Big Data to Capture Value",
		"extraction_date": "2025-10-07"
	},
	"extracted_data": [
		{
			"question_id": "1",
			"question_text": "What is the name and definition of the software business model presented in the article?",
			"response_found": true,
			"extracted_value": "Free-to-consumers business model based on big data and two-sided markets. Definition: A business model where companies offer digital services for free to consumers while capturing value from user-generated data through three strategies: enhanced advertising (using data to target ads), e-ethnography (using data to improve internal products/services), and data trading (selling user data to third parties).",
			"synonyms_found": [
				"free-to-consumers business model",
				"free services",
				"freeconomics",
				"two-sided market",
				"nontransaction two-sided market"
			],
			"source_citation": "Page 2: 'New models that capture the value embedded in the data generated by digital services may make it viable for companies to offer those services for free' | Page 2: 'companies relying on a free-to-consumers business model' | Page 5: 'Our analysis suggested three possible strategies for leveraging big data, which we've called enhanced advertising, e-ethnography, and data trading' | Page 2: 'Through a case study analysis, we show how leveraging a two-sided structure can enable companies to capture value from user-sourced data, enabling a sustainable free-to-consumers business model'",
			"confidence_level": "high"
		},
		{
			"question_id": "2",
			"question_text": "What synonyms or alternative terms are used in the article to refer to this software business model?",
			"response_found": true,
			"extracted_value": [
				"Free-to-consumers business model",
				"Free services",
				"Freeconomics",
				"Two-sided market",
				"Nontransaction two-sided market",
				"Advertising-based model"
			],
			"synonyms_found": [
				"Free-to-consumers business model",
				"Free services",
				"Freeconomics",
				"Two-sided market",
				"Nontransaction two-sided market",
				"Advertising-based model"
			],
			"source_citation": "Page 2: 'The term \"freeconomics\" was invented' | Page 2: 'free-to-consumers business model' | Page 2: 'free services' | Page 2: 'The advertising-based model is a specific type of two-sided market approach' | Page 3: 'nontransaction two-sided markets'",
			"confidence_level": "high"
		},
		{
			"question_id": "3",
			"question_text": "What is the main vertical segment or industry where the software business model presented in the article is applied?",
			"response_found": true,
			"extracted_value": "Health and Fitness Apps / Mobile Applications",
			"synonyms_found": [
				"health and fitness apps",
				"mobile app",
				"app industry"
			],
			"source_citation": "Page 5: 'We focused our research on a category of apps that collects a wide range of data, from user-entered information to data gathered from sensors, providing a stream of genuine, real-time, variegated, and valuable data—health and fitness apps. This category of apps had an estimated market value of $4 billion in 2014, a number expected to increase to $26 billion by 2017' | Page 5: 'The app industry represents an intriguing empirical setting to explore the emergence of big data business models in nontransactional two-sided markets'",
			"confidence_level": "high"
		},
		{
			"question_id": "4",
			"question_text": "What is the target customer type of the software business model presented in the article?",
			"response_found": true,
			"extracted_value": "B2C (individual consumers/users)",
			"synonyms_found": ["consumers", "users", "customers"],
			"source_citation": "Page 2: 'free-to-consumers business model' | Page 2: 'Consumers are getting used to receiving free services in many different fields' | Page 2: 'users are more than eyeballs to be targeted with advertising; they become data providers'",
			"confidence_level": "high"
		},
		{
			"question_id": "5",
			"question_text": "What is the typical size of offering companies that adopt this software business model as described in the article?",
			"response_found": true,
			"extracted_value": "Mix of company sizes: digital giants (Facebook, Google), large established corporations (Nike, Adidas, Under Armour, Fitbit), and smaller companies/startups (FitnessKeeper, Noom, Strava, Runtastic)",
			"synonyms_found": [],
			"source_citation": "Page 2: 'Facebook, for instance, had more than 1.7 billion monthly active users in September 2016... Google and all its services' | Page 2: 'These companies leverage an old business model... are still one of the most popular value-capture mechanisms... the digital giants' | Page 7: 'companies like Under Armour, which now owns 3 of the 14 apps in our sample (Endomondo, MyFitnessPal, and MapMyRun)' | Page 8: 'Both of these strategies fit different kinds of companies: e-ethnography is more common in companies that use the app to support a core business, as Nike and Adidas do, while data trading is available to companies that are entirely digital, including startups and smaller companies'",
			"confidence_level": "high"
		},
		{
			"question_id": "6",
			"question_text": "In which geographic region was the software business model presented in the article studied or applied?",
			"response_found": true,
			"extracted_value": "Global (with specific examples from United States and international markets)",
			"synonyms_found": [],
			"source_citation": "Page 7: 'Strava, which offers a mobile ride-tracking app for bicyclists, has sold data to the Oregon Department of Transportation (DOT)' | Page 7: 'Strava has engaged in similar partnerships with departments of transportation in London, England; Glasgow, Scotland; Orlando, Florida; and other cities' | Page 2: 'Facebook, for instance, had more than 1.7 billion monthly active users... Google' (global services) | Page 5: 'We used Appcrawlr, a mobile app search engine, to identify free health and fitness apps offered through Google Play' (global app store)",
			"confidence_level": "medium"
		},
		{
			"question_id": "7",
			"question_text": "What specific customer segment is most detailed in the article regarding the software business model?",
			"response_found": true,
			"extracted_value": "Health and fitness enthusiasts using smartphone apps (runners, cyclists, people tracking workouts and nutrition)",
			"synonyms_found": [],
			"source_citation": "Page 6-7: 'Nike Running customers to understand how people use its core product—shoes. App users provide a huge amount of information about their workout habits that allows the company to profile its customers and understand critical attributes. For instance, the company knows that men in their late thirties run an average of 37.8 km/week, with an average single run distance of 6.2 km at an average pace of 6:56 per mile' | Page 7: 'Strava, which offers a mobile ride-tracking app for bicyclists' | Page 5: 'health and fitness apps'",
			"confidence_level": "high"
		},
		{
			"question_id": "8",
			"question_text": "What is the type of product or service offered by the software business model presented in the article?",
			"response_found": true,
			"extracted_value": ["Application", "Data"],
			"synonyms_found": [],
			"source_citation": "Page 5: 'health and fitness apps... mobile apps' | Page 2: 'digital services' | Page 2: 'companies are gathering a huge amount of data from consumers, especially through mobile apps' | Page 4: 'Data may represent another complementary market'",
			"confidence_level": "high"
		},
		{
			"question_id": "9",
			"question_text": "How is the software delivered or deployed in the business model presented in the article?",
			"response_found": true,
			"extracted_value": ["Mobile (smartphone applications)"],
			"synonyms_found": [],
			"source_citation": "Page 5: 'We focused our research on a category of apps that collects a wide range of data, from user-entered information to data gathered from sensors... health and fitness apps' | Page 5: 'identify free health and fitness apps offered through Google Play' | Page 8: 'smartphones, with their embedded sensors and wide range of apps'",
			"confidence_level": "high"
		},
		{
			"question_id": "10",
			"question_text": "What is the intellectual property regime adopted by the software business model presented in the article?",
			"response_found": false,
			"extracted_value": "not reported",
			"synonyms_found": [],
			"source_citation": "information not found in text",
			"confidence_level": "high"
		},
		{
			"question_id": "11",
			"question_text": "Are there specific restrictions or compatibilities of licensing mentioned in the article about the software business model?",
			"response_found": false,
			"extracted_value": "not reported",
			"synonyms_found": [],
			"source_citation": "information not found in text",
			"confidence_level": "high"
		},
		{
			"question_id": "12",
			"question_text": "What are the revenue sources of the software business model presented in the article?",
			"response_found": true,
			"extracted_value": [
				"Advertising (traditional and enhanced)",
				"Subscription (premium offerings)",
				"Usage/consumption (in-app sales)",
				"Transaction (data trading/selling user data to third parties)"
			],
			"synonyms_found": [],
			"source_citation": "Page 2: 'Historically, advertising—a typical two-sided market mechanism—is the primary method that companies relying on a free-to-consumers business model have used to appropriate value' | Page 5: 'Only four (28.6 percent) of the case apps use advertising to generate revenue in the traditional way (that is, through banners). Even these typically rely on some revenue from users, in the form of premium offerings, in-app sales, or cross-selling of physical products' | Page 7: 'Finally, companies can generate revenue from user data in a much more direct way—by selling user data to a third party' | Page 7: 'for a fee of $20,000 per year, the department can see where bikers speed up or slow down'",
			"confidence_level": "high"
		},
		{
			"question_id": "13",
			"question_text": "What is the base unit for pricing of the software business model presented in the article?",
			"response_found": true,
			"extracted_value": "Others (free to users; pricing for data access is subscription-based for third parties, or per-feature for premium users)",
			"synonyms_found": [],
			"source_citation": "Page 7: 'for a fee of $20,000 per year, the department can see where bikers speed up or slow down' (annual subscription for data) | Page 5: 'premium offerings, in-app sales' | Page 2: 'customers have come to expect digital services to be free'",
			"confidence_level": "medium"
		},
		{
			"question_id": "14",
			"question_text": "What is the price presentation structure of the software business model described in the article?",
			"response_found": true,
			"extracted_value": [
				"Freemium",
				"In-app purchase",
				"Annual contract (for data buyers)"
			],
			"synonyms_found": [],
			"source_citation": "Page 3: 'New models have been proposed to escape this digital service free equation, such as freemium models, which mix free basic services with paid premium ones' | Page 3: 'in-app purchase models, which give the basic app away but offer users opportunities to enrich their experience with it through paid add-ons' | Page 5: 'premium offerings, in-app sales' shown in Table 1 | Page 7: 'for a fee of $20,000 per year' for data access",
			"confidence_level": "high"
		},
		{
			"question_id": "15",
			"question_text": "What currency and billing periodicity are used in the software business model as described in the article?",
			"response_found": true,
			"extracted_value": "USD, annual (for data trading example with Strava: $20,000 per year)",
			"synonyms_found": [],
			"source_citation": "Page 7: 'for a fee of $20,000 per year, the department can see where bikers speed up or slow down'",
			"confidence_level": "medium"
		},
		{
			"question_id": "16",
			"question_text": "What is the role of the offering company in the ecosystem of the software business model presented in the article?",
			"response_found": true,
			"extracted_value": "Two-sided platform",
			"synonyms_found": ["intermediary", "platform"],
			"source_citation": "Page 2: 'Through a case study analysis, we show how leveraging a two-sided structure can enable companies to capture value from user-sourced data' | Page 3: 'Digital services providers, like many other companies, operate in two-sided markets—markets in which interaction between two (or more) groups is governed by network externalities' | Page 3: 'two-sided markets are \"markets in which one or several platforms enable interactions between end-users, and try to get the two (or multiple) sides 'on board' by appropriately charging each side\"' | Page 3: 'An intermediary who can internalize the externalities, harvesting value by mediating the interaction'",
			"confidence_level": "high"
		},
		{
			"question_id": "17",
			"question_text": "What type of network effect is present in the software business model presented in the article?",
			"response_found": true,
			"extracted_value": "Cross-sided (indirect network externalities: more users generate more data which increases value for advertisers/data buyers on the other side)",
			"synonyms_found": [
				"indirect network externalities",
				"network externalities"
			],
			"source_citation": "Page 3: 'markets in which interaction between two (or more) groups is governed by network externalities that affect the value of the goods or services offered. Those externalities can be either direct (an increase in the number of users generates an increase in the value of the goods or services) or indirect (an increase in the number of users generates an increase in the value of complementary goods)' | Page 3: 'Indirect network externalities associated with those groups' | Page 7: 'the company leverages indirect network externalities, but in this case, the other side of the interaction is not with external parties, such as advertisers, but within the company itself'",
			"confidence_level": "high"
		},
		{
			"question_id": "18",
			"question_text": "What are the customer acquisition channels of the software business model presented in the article?",
			"response_found": true,
			"extracted_value": [
				"Marketplaces (app stores like Google Play and Apple App Store)",
				"Product-led Growth (free apps driving adoption)"
			],
			"synonyms_found": [],
			"source_citation": "Page 5: 'We used Appcrawlr, a mobile app search engine, to identify free health and fitness apps offered through Google Play' | Page 5: 'all of the top-ranked apps in the search were offered on both the Apple App Store and Google Play' | Page 2: 'customers have come to expect digital services to be free—even those they might pay for in the physical world' (suggesting free offerings drive adoption)",
			"confidence_level": "medium"
		},
		{
			"question_id": "19",
			"question_text": "Does the software business model presented in the article use cloud marketplaces or platforms?",
			"response_found": true,
			"extracted_value": "Yes - Google Play (Android), Apple App Store (iOS)",
			"synonyms_found": [],
			"source_citation": "Page 5: 'We used Appcrawlr, a mobile app search engine, to identify free health and fitness apps offered through Google Play' | Page 5: 'all of the top-ranked apps in the search were offered on both the Apple App Store and Google Play'",
			"confidence_level": "high"
		},
		{
			"question_id": "20",
			"question_text": "Which Business Model Canvas elements are detailed in the article about the software business model?",
			"response_found": true,
			"extracted_value": [
				"Value Proposition: Free digital services to consumers, data-driven insights and targeted advertising to businesses, anonymized aggregated data for research/civic purposes",
				"Customer Segment: Two sides - (1) Individual consumers/app users and (2) Advertisers/data buyers/third parties",
				"Revenue Streams: Advertising (traditional and enhanced), premium offerings, in-app sales, data trading/selling to third parties",
				"Key Resources: Big data (volume, velocity, variety, value, veracity), user-generated data streams, embedded smartphone sensors, analytics capabilities",
				"Key Activities: Data collection from sensors and user input, data aggregation and anonymization, data analysis, targeted advertising delivery, data trading",
				"Key Partnerships: App store platforms (Google Play, Apple App Store), advertisers, data buyers (e.g., departments of transportation), sensor/device manufacturers",
				"Cost Structure: Platform development and maintenance, data management infrastructure, analytics tools"
			],
			"synonyms_found": [],
			"source_citation": "Page 2: 'companies to offer those services for free' and 'users become data providers' | Page 3: 'two-sided markets... two or more distinct groups of clients' | Page 5: 'premium offerings, in-app sales' and 'advertising to generate revenue' | Page 4: 'Big data is data characterized by five features, the \"five Vs\"—volume, velocity, and variety... as well as value and veracity' | Page 5: 'apps that collects a wide range of data, from user-entered information to data gathered from sensors' | Page 7: 'selling user data to a third party' | Page 8: 'data would be shared only in anonymized and aggregated forms'",
			"confidence_level": "high"
		},
		{
			"question_id": "21",
			"question_text": "Which actors participate in the ecosystem of the software business model presented in the article and how do they interact?",
			"response_found": true,
			"extracted_value": [
				"App Providers/Platform Companies (e.g., Nike, Adidas, Under Armour, Fitbit, Strava) | Intermediaries offering free apps | Collect data from users, provide services to users, sell data/insights to third parties | Manage relationships with all sides",
				"Consumers/Users | Data providers and service recipients | Use free apps, generate data through sensors and input | Receive free services in exchange for data",
				"Advertisers | Revenue source (traditional side) | Pay for access to users and targeted advertising | Reach consumers through platform",
				"Data Buyers/Third Parties (e.g., Oregon DOT, London DOT) | Revenue source (new side) | Purchase anonymized aggregated data | Use data for research, planning, insights",
				"App Store Platforms (Google Play, Apple App Store) | Distribution channels | Host and distribute apps | Connect app providers with consumers",
				"Physical Product Manufacturers (Nike, Adidas, Fitbit) | Core business owners | Use app data to improve physical products | Leverage e-ethnography insights",
				"Sensor/Device Manufacturers | Technology enablers | Provide embedded sensors in smartphones | Enable data collection capabilities"
			],
			"synonyms_found": [],
			"source_citation": "Page 3: 'two-sided markets... intermediary platform... two or more distinct groups of clients' | Page 2: 'users are more than eyeballs to be targeted with advertising; they become data providers, and companies may capture value by using that data to customize advertising messages, leverage e-ethnography to improve their own core offer, serve as fodder for research, or create knowledge for third parties' | Page 7: 'Strava, which offers a mobile ride-tracking app for bicyclists, has sold data to the Oregon Department of Transportation (DOT)' | Page 6-7: 'Nike uses its Nike Running customers to understand how people use its core product—shoes' | Page 5: 'apps offered through Google Play... Apple App Store'",
			"confidence_level": "high"
		},
		{
			"question_id": "22",
			"question_text": "What motivations lead to the adoption of the software business model presented in the article?",
			"response_found": true,
			"extracted_value": [
				"Consumer expectation of free digital services",
				"Declining costs of computing power, storage, and bandwidth (Moore's law)",
				"Need for sustainable revenue models beyond traditional advertising",
				"Opportunity to capture value from user-generated big data",
				"Ability to build deeper customer relationships through continuous engagement",
				"Access to valuable insights about customer behavior and product usage",
				"New revenue streams from data trading",
				"Competitive pressure (free navigation apps shut out paid GPS apps)",
				"Large potential market (2.16 billion smartphone users by 2016)"
			],
			"synonyms_found": [],
			"source_citation": "Page 2: 'Consumers are getting used to receiving free services in many different fields, and the popularity of the mobile app industry is feeding this phenomenon' | Page 2: 'As Moore's law (Moore 1965) reduces the cost of processing power, storage, bandwidth, and the other technologies that have enabled the digital revolution, computing power, and the services supported by it, is rapidly becoming \"too cheap to meter\"' | Page 2: 'the question of whether there is a sustainable way to offer digital services for free, besides advertising, remains important' | Page 2: 'One potential answer to this question lies in the considerable quantities of data that customers generate in using digital services' | Page 6-7: 'The relationships we have [with the customer]... are so much more impactful when someone comes back to the brand two or three times a week to sync a run' | Page 3: 'TomTom and Garmin, both manufacturers of popular GPS units, attempted to sell navigation apps for smartphones—and were shut out of the market by free navigation services like Google Maps and Waze' | Page 5: 'By the end of 2016, 2.16 billion people will have smartphones'",
			"confidence_level": "high"
		},
		{
			"question_id": "23",
			"question_text": "What factors contribute to the success of the software business model as described in the article?",
			"response_found": true,
			"extracted_value": [
				"Large user base → More data generated → Higher value for data buyers and advertisers",
				"Free services → Attracts millions of users → Creates valuable target audience",
				"Embedded smartphone sensors → Rich real-time data collection → High-quality big data",
				"Multiple revenue streams (ads + premium + data) → Sustainable business model → Financial viability",
				"Anonymized aggregated data → Addresses privacy concerns → User trust and compliance",
				"Integration with physical products → Deep product insights → Enhanced core business value",
				"Continuous user engagement → Ongoing data streams → Better customer understanding",
				"Strategic acquisitions (Under Armour buying 3 apps) → Larger databases → Enhanced data value"
			],
			"synonyms_found": [],
			"source_citation": "Page 2: 'Facebook, for instance, had more than 1.7 billion monthly active users in September 2016, none of whom paid anything to enjoy its services. Facebook makes money by allowing businesses access to users' newsfeeds' | Page 4: 'free (or almost free) services draw large numbers of consumers, who then become targets for the advertisers that pay for access to those consumers' | Page 5: 'apps that collects a wide range of data, from user-entered information to data gathered from sensors, providing a stream of genuine, real-time, variegated, and valuable data' | Page 5: 'Even these typically rely on some revenue from users, in the form of premium offerings, in-app sales, or cross-selling of physical products' | Page 8: 'data would be shared only in anonymized and aggregated forms' | Page 7: 'companies like Under Armour, which now owns 3 of the 14 apps in our sample (Endomondo, MyFitnessPal, and MapMyRun) and seems to be building a suite of services for athletes'",
			"confidence_level": "high"
		},
		{
			"question_id": "24",
			"question_text": "What prerequisites or conditions are necessary for the software business model as described in the article?",
			"response_found": true,
			"extracted_value": [
				"Smartphone penetration with embedded sensors → Enables data collection capabilities",
				"Big data management tools and analytics → Required to process and extract value from data streams",
				"Two-sided market structure → Necessary for intermediary value capture",
				"Large user base (threshold: 5+ million downloads in study) → Required for big data effects",
				"Privacy policies allowing data collection and use → Legal framework for data utilization",
				"Ubiquitous connectivity → Enables real-time data collection and aggregation",
				"User willingness to share data → Fundamental for data generation",
				"Complementary market on other side → Either advertisers or data buyers to monetize"
			],
			"synonyms_found": [],
			"source_citation": "Page 5: 'By the end of 2016, 2.16 billion people will have smartphones' | Page 4: 'The emerging model, typified by Twitter's Firehose data product, relies on the emergence of big data and tools for managing it' | Page 3: 'made possible by the existence of... Two or more distinct groups of clients, Indirect network externalities associated with those groups, and An intermediary who can internalize the externalities' | Page 5: 'We then eliminated duplicate results and those apps with fewer than 5 million downloads from Google Play at the time of the initial search, since big data effects would likely be negligible under that threshold' | Page 5: 'the privacy policies were analyzed to understand how companies might employ user-sourced data' | Page 8: 'smartphones, with their embedded sensors and wide range of apps, can gather a huge volume and variety of data with incredible speed, and the ubiquitous connectivity they provide allows for that data to be collected and aggregated in real time'",
			"confidence_level": "high"
		},
		{
			"question_id": "25",
			"question_text": "What restrictions or incompatibilities are mentioned in the article about the software business model?",
			"response_found": true,
			"extracted_value": [
				"Privacy concerns and regulations → Must anonymize and aggregate data → Limits direct individual-level data trading",
				"User expectations for transparency → Must communicate data usage clearly → Constrains data collection practices",
				"Privacy policy requirements → Must disclose data uses → Legal and trust constraints",
				"Traditional markup pricing incompatible → Cannot sustain subsidized side with standard pricing → Requires alternative revenue model",
				"User sensitivity to paid services → Expectation of free digital services → Difficult to charge users directly",
				"Need for large user base → Below 5 million users, big data effects negligible → Barriers for small players",
				"Data management complexity → Must combine multiple data sources and build analytics models → Organizational transformation required"
			],
			"synonyms_found": [],
			"source_citation": "Page 4: 'big data presents privacy concerns that companies must address transparently, in their communications with users and in their management of data streams' | Page 8: 'All of the privacy policies we analyzed addressed these concerns by specifying that data would be shared only in anonymized and aggregated forms. However, data privacy remains a hot topic among app users; transparency in managing data and user expectations for privacy is a key factor in building strong relationships with users' | Page 3: 'Consider, once again, newspapers: the final user is subsidized, paying less than the cost of producing the paper, by the advertisers on the other side of the model. A traditional markup pricing formula would never sustain a structure like this' | Page 3: 'customers have come to expect digital services to be free—even those they might pay for in the physical world' | Page 5: 'We then eliminated... those apps with fewer than 5 million downloads from Google Play at the time of the initial search, since big data effects would likely be negligible under that threshold' | Page 4: 'big data can also represent a major management issue, as companies must understand how to identify appropriate data streams and combine and manage multiple data sources to build advanced analytics models; they must be prepared to transform the organization'",
			"confidence_level": "high"
		},
		{
			"question_id": "26",
			"question_text": "What challenges are identified in implementing the software business model as presented in the article?",
			"response_found": true,
			"extracted_value": [
				"Gap between big data opportunities and current knowledge of the field",
				"Few business models directly linking big data to value capture",
				"Privacy concerns requiring transparent data management",
				"Need to identify appropriate data streams from multiple sources",
				"Building advanced analytics models",
				"Organizational transformation to integrate big data into processes",
				"User trust and transparency in data usage",
				"Managing user expectations for privacy",
				"Competition from free alternatives shutting out paid models",
				"Sustaining profitability long-term with free services"
			],
			"synonyms_found": [],
			"source_citation": "Page 4: 'However, although it is clear that big data can lead to major developments, there is still a huge gap between the opportunities it presents and the current knowledge of the field. Few business models have been described that directly link big data to value capture' | Page 4: 'Big data can also represent a major management issue, as companies must understand how to identify appropriate data streams and combine and manage multiple data sources to build advanced analytics models; they must be prepared to transform the organization to integrate big data into processes and approaches' | Page 4: 'big data presents privacy concerns that companies must address transparently, in their communications with users and in their management of data streams' | Page 8: 'data privacy remains a hot topic among app users; transparency in managing data and user expectations for privacy is a key factor in building strong relationships with users' | Page 3: 'TomTom and Garmin, both manufacturers of popular GPS units, attempted to sell navigation apps for smartphones—and were shut out of the market by free navigation services' | Page 2: 'new strategies are needed to make free services sustainable and profitable in the long term'",
			"confidence_level": "high"
		},
		{
			"question_id": "27",
			"question_text": "What practices are used to mitigate challenges of the software business model as described in the article?",
			"response_found": true,
			"extracted_value": [
				"Anonymizing and aggregating data → Addresses privacy concerns → Enables ethical data trading while protecting individuals",
				"Transparent privacy policies → Builds user trust → Specifies exactly how data will be used",
				"Multiple revenue streams (ads + premium + data) → Reduces dependency on single source → More sustainable model",
				"Enhanced advertising instead of generic ads → Better user experience → Makes ads feel like answers to user needs",
				"Using data internally first (e-ethnography) → Improves core products → Strengthens primary business before external data sales",
				"Building large user bases before monetizing → Reaches big data threshold → Ensures sufficient data value",
				"Strategic acquisitions to consolidate data → Creates larger databases → Increases data value and freedom to use"
			],
			"synonyms_found": [],
			"source_citation": "Page 8: 'All of the privacy policies we analyzed addressed these concerns by specifying that data would be shared only in anonymized and aggregated forms' | Page 5: 'the privacy policies were analyzed to understand how companies might employ user-sourced data' | Page 5: 'Even these typically rely on some revenue from users, in the form of premium offerings, in-app sales, or cross-selling of physical products' | Page 6: 'Ads that don't feel like ads. Based on the unique goals of your brand, we'll reach the right audience at the right time... highly contextualized advertising messages and links to advertisers that make ads look like the answer to users' needs' | Page 7: 'Nike uses its Nike Running customers to understand how people use its core product—shoes' | Page 7: 'companies like Under Armour, which now owns 3 of the 14 apps in our sample (Endomondo, MyFitnessPal, and MapMyRun) and seems to be building a suite of services for athletes... FitnessKeeper (the provider of RunKeeper), which created the Health Graph to gather data from partners as well. These two examples show how companies are seeking ways to build large databases and maintaining the freedom to use these data to create value'",
			"confidence_level": "high"
		},
		{
			"question_id": "28",
			"question_text": "What metrics and quantitative results are reported in the article about the software business model?",
			"response_found": true,
			"extracted_value": [
				{
					"metric": "Facebook monthly active users",
					"value": "1.7 billion",
					"unit": "users",
					"period": "September 2016",
					"method": "Platform statistics",
					"source": "Statista 2016a"
				},
				{
					"metric": "Smartphone users worldwide",
					"value": "2.16 billion",
					"unit": "people",
					"period": "End of 2016",
					"method": "Market projection",
					"source": "Statista 2016b"
				},
				{
					"metric": "iOS free apps percentage",
					"value": "90%",
					"unit": "percentage",
					"period": "2013",
					"method": "Market analysis",
					"source": "Perez 2013"
				},
				{
					"metric": "Health & fitness app market value",
					"value": "$4 billion",
					"unit": "USD",
					"period": "2014",
					"method": "Market estimation",
					"source": "Boxall 2014"
				},
				{
					"metric": "Health & fitness app projected market",
					"value": "$26 billion",
					"unit": "USD",
					"period": "2017",
					"method": "Market projection",
					"source": "Boxall 2014"
				},
				{
					"metric": "Twitter data revenue percentage",
					"value": "~10%",
					"unit": "percentage of revenues",
					"period": "Q3 2015",
					"method": "Financial reporting",
					"source": "Twitter 2015"
				},
				{
					"metric": "Apps with advertising in sample",
					"value": "4",
					"unit": "apps (28.6%)",
					"period": "Study sample",
					"method": "Case study analysis",
					"source": "Study data"
				},
				{
					"metric": "Apps with premium offerings",
					"value": "10",
					"unit": "apps",
					"period": "Study sample",
					"method": "Case study analysis",
					"source": "Study data"
				},
				{
					"metric": "Apps with in-app sales",
					"value": "2",
					"unit": "apps",
					"period": "Study sample",
					"method": "Case study analysis",
					"source": "Study data"
				},
				{
					"metric": "Apps with cross-selling",
					"value": "2",
					"unit": "apps",
					"period": "Study sample",
					"method": "Case study analysis",
					"source": "Study data"
				},
				{
					"metric": "Study sample size",
					"value": "14",
					"unit": "apps",
					"period": "2016",
					"method": "Case study selection",
					"source": "Study methodology"
				},
				{
					"metric": "Initial search results",
					"value": "149",
					"unit": "mobile apps",
					"period": "January 27, 2016",
					"method": "Appcrawlr search",
					"source": "Study methodology"
				},
				{
					"metric": "Minimum downloads threshold",
					"value": "5 million",
					"unit": "downloads",
					"period": "Study selection criteria",
					"method": "Selection filter",
					"source": "Study methodology"
				},
				{
					"metric": "Apps with enhanced advertising capability",
					"value": "6",
					"unit": "apps",
					"period": "Study sample",
					"method": "Privacy policy analysis",
					"source": "Study data"
				},
				{
					"metric": "Apps with e-ethnography capability",
					"value": "3",
					"unit": "apps (Nike, Adidas, Noom, Sports Tracker)",
					"period": "Study sample",
					"method": "Privacy policy analysis",
					"source": "Study data"
				},
				{
					"metric": "Apps with data trading provisions",
					"value": "10",
					"unit": "apps",
					"period": "Study sample",
					"method": "Privacy policy analysis",
					"source": "Study data"
				},
				{
					"metric": "Strava data selling price",
					"value": "$20,000",
					"unit": "USD per year",
					"period": "Starting September 2013",
					"method": "Contract terms",
					"source": "Davies 2014, Wired"
				},
				{
					"metric": "Under Armour app portfolio",
					"value": "3",
					"unit": "apps (of 14 in sample)",
					"period": "Study period",
					"method": "Market observation",
					"source": "Marr 2016"
				},
				{
					"metric": "Average weekly run distance (men late 30s)",
					"value": "37.8",
					"unit": "km/week",
					"period": "Nike Running data",
					"method": "User data aggregation",
					"source": "Nike app data"
				},
				{
					"metric": "Average single run distance",
					"value": "6.2",
					"unit": "km",
					"period": "Nike Running data",
					"method": "User data aggregation",
					"source": "Nike app data"
				},
				{
					"metric": "Average running pace",
					"value": "6:56",
					"unit": "minutes per mile",
					"period": "Nike Running data",
					"method": "User data aggregation",
					"source": "Nike app data"
				}
			],
			"synonyms_found": [],
			"source_citation": "Page 2: 'Facebook, for instance, had more than 1.7 billion monthly active users in September 2016' | Page 5: 'By the end of 2016, 2.16 billion people will have smartphones' | Page 5: '90 percent of iOS apps are offered for free' | Page 5: 'This category of apps had an estimated market value of $4 billion in 2014, a number expected to increase to $26 billion by 2017' | Page 3: 'The Twitter Political Index... one that accounted for almost 10 percent of revenues in the third quarter of 2015' | Page 5: 'Table 1. Study sample... Total 4 10 2 2' showing revenue types | Page 5: 'a list of 149 mobile apps that met our criteria... the final sample is composed of 14 apps' | Page 7: 'for a fee of $20,000 per year, the department can see where bikers speed up or slow down' | Page 6-7: 'men in their late thirties run an average of 37.8 km/week, with an average single run distance of 6.2 km at an average pace of 6:56 per mile' | Page 6: 'Six companies in the sample have privacy policy provisions that allow them to use data to create enhanced advertising' | Page 7: 'A total of 10 apps have similar provisions, allowing them to sell or exchange the data they gather'",
			"confidence_level": "high"
		},
		{
			"question_id": "29",
			"question_text": "What is the temporal period and maturity of the software business model as presented in the article?",
			"response_found": true,
			"extracted_value": "Observed period: 2009-2017 (Twitter started selling data access in 2009, study conducted in 2016, article published 2017). Maturity status: Growing (evolving from traditional advertising to data-based models, but still gap between opportunities and knowledge, some companies fully exploiting while others exploring)",
			"synonyms_found": [],
			"source_citation": "Page 3: 'For example, in 2009, Twitter started selling expanded access to its database of tweets to third parties' | Page 5: 'an Appcrawlr search conducted on January 27, 2016' | Page 1: 'Published online: 03 Mar 2017' | Page 7: 'Strava may be in the lead with this kind of data use... These examples also demonstrate the ferment around apps' usage of data; while some companies, like Strava, are fully exploiting the potential of their data, others are still exploring the opportunities promised by data' | Page 4: 'although it is clear that big data can lead to major developments, there is still a huge gap between the opportunities it presents and the current knowledge of the field'",
			"confidence_level": "high"
		},
		{
			"question_id": "30",
			"question_text": "What is the type of evidence presented in the article about the software business model?",
			"response_found": true,
			"extracted_value": "Multiple cases (qualitative case study of 14 health and fitness apps using secondary data sources)",
			"synonyms_found": ["case study", "multiple cases"],
			"source_citation": "Page 5: 'Due to the exploratory nature of this research, we adopted a case study approach, relying on secondary sources for data (Yin 1984)' | Page 5: 'We used existing theories to interpret the data gathered and considered multiple cases to highlight different models and increase the validity of our results' | Page 5: 'the final sample is composed of 14 apps' | Page 5: 'We gathered data on our case apps from a variety of sources. Firms' official websites provided institutional product and service descriptions, and Google Play was used to retrieve quantitative information... Articles in industry magazines and other publications were searched... Finally, the privacy policies were analyzed'",
			"confidence_level": "high"
		},
		{
			"question_id": "31",
			"question_text": "Which companies or products are cited as examples of the software business model in the article?",
			"response_found": true,
			"extracted_value": [
				"Facebook → Example of free service with 1.7 billion users, revenue from advertising",
				"Google (Maps, Street View, Translator, Scholar, Waze) → Examples of free services funded by advertising and data",
				"Twitter (Firehose) → Example of data trading, selling tweet database access, ~10% of Q3 2015 revenue",
				"TomTom and Garmin → Counter-examples, failed to sell paid GPS apps due to free competition",
				"Fitbit → Example of cross-selling physical product with companion app",
				"Adidas Train & Run → Case study app using e-ethnography strategy",
				"Calories Counter (Fat Secret) → Case study app",
				"Endomondo (Under Armour) → Case study app with ads and premium offerings",
				"Lose It! (FitNow) → Case study app with premium offerings",
				"MapMyRun (Under Armour) → Case study app with ads and premium",
				"MyFitnessPal (Under Armour) → Case study app with premium offerings",
				"Nike Running (Nike) → Main e-ethnography example, no direct revenue sources, used to understand shoe usage",
				"Noom Cardio Trainer → Case study app using data for weight loss coaching",
				"RunKeeper (FitnessKeeper) → Example of enhanced advertising and Health Graph data platform",
				"Runtastic (Runtastic GMBH) → Example with enhanced advertising provisions",
				"Sports Tracker (Amer Sports) → Case study with e-ethnography capability",
				"Strava → Leading data trading example, selling cycling data to transportation departments for $20k/year",
				"Virtuagym Fitness → Case study app",
				"Under Armour → Example of strategic acquisition (owns 3 apps: Endomondo, MyFitnessPal, MapMyRun)",
				"Oregon Department of Transportation → Data buyer from Strava",
				"London, Glasgow, Orlando DOTs → Data buyers from Strava",
				"John Deere → Example of e-ethnography in manufacturing, added sensors to products",
				"Apple (Health app) → Mentioned platform provider (excluded from study)",
				"Google (My Track) → Mentioned platform provider (excluded from study)"
			],
			"synonyms_found": [],
			"source_citation": "Page 2: 'Facebook, for instance, had more than 1.7 billion monthly active users' | Page 2: 'Google and all its services, from the search engine to Street View, from Translator to Google Scholar' | Page 3: 'Twitter started selling expanded access to its database... accounted for almost 10 percent of revenues in the third quarter of 2015' | Page 3: 'TomTom and Garmin, both manufacturers of popular GPS units, attempted to sell navigation apps for smartphones—and were shut out of the market by free navigation services like Google Maps and Waze' | Page 5: 'Table 1. Study sample' lists all 14 apps | Page 6-7: 'Nike uses its Nike Running customers to understand how people use its core product—shoes' | Page 7: 'Strava, which offers a mobile ride-tracking app for bicyclists, has sold data to the Oregon Department of Transportation (DOT)... for a fee of $20,000 per year' | Page 7: 'Strava has engaged in similar partnerships with departments of transportation in London, England; Glasgow, Scotland; Orlando, Florida' | Page 7: 'companies like Under Armour, which now owns 3 of the 14 apps in our sample (Endomondo, MyFitnessPal, and MapMyRun)' | Page 9: 'John Deere added sensors to its products to support new features'",
			"confidence_level": "high"
		},
		{
			"question_id": "32",
			"question_text": "Are there variations or subtypes of the software business model described in the article?",
			"response_found": true,
			"extracted_value": [
				"Strategy 1: Enhanced Advertising → Uses customer data to target advertising messages contextually, making ads feel like answers to user needs rather than just selling eyeballs. Users still primarily targets for revenue.",
				"Strategy 2: e-Ethnography → Uses user data internally to improve core products/services and understand customer behavior. Data is valuable by-product, not direct revenue source. Users become insight sources. Common in companies with physical products (Nike, Adidas).",
				"Strategy 3: Data Trading → Directly sells anonymized aggregated user data to third parties (e.g., governments, researchers). Data itself is revenue-generating asset. Users are data sources and revenue sources. Available to fully digital companies and startups.",
				"Transaction vs Nontransaction Markets → Transaction markets enable direct transactions between sides (e.g., eBay, Airbnb). Nontransaction markets offer product to one side and sell access to other (e.g., newspapers, Google ads).",
				"Freemium Model → Mix of free basic services with paid premium features.",
				"In-app Purchase Model → Free basic app with paid add-ons to enrich experience.",
				"Cross-selling Model → Free service supporting physical product sales (e.g., Fitbit app with tracker)"
			],
			"synonyms_found": [],
			"source_citation": "Page 5: 'Our analysis suggested three possible strategies for leveraging big data, which we've called enhanced advertising, e-ethnography, and data trading. These strategies may be seen as representing an evolution in the approach to big data' | Page 5-6: 'In enhanced advertising, users are still primarily eyeballs to be sold; the data simply make the advertising more targeted. Users are a target for revenue-generating activity... In the e-ethnography model, user data is still not a direct source of revenue, but it is used to support activities that generate revenues... In data trading, the data becomes a direct source of revenues, and users have moved from being a target of revenue-generating activity to a source of the data that generate revenues' | Page 3: 'In transaction markets, such as credit card payment systems, eBay, and Airbnb, the intermediary platform enables a transaction between the two sides. In nontransaction markets, the intermediary platform offers its core product or service to one group and then sells access to that group to the other side' | Page 3: 'freemium models, which mix free basic services with paid premium ones... in-app purchase models, which give the basic app away but offer users opportunities to enrich their experience with it through paid add-ons... cross-selling models, in which a company offers a free service that supports a physical product'",
			"confidence_level": "high"
		},
		{
			"question_id": "33",
			"question_text": "What future trends or evolutions are mentioned in the article about the software business model?",
			"response_found": true,
			"extracted_value": [
				"Evolution from enhanced advertising to e-ethnography to data trading → Foundation: represents progression in sophistication of data usage and user role transformation",
				"More industries will need these strategies as world becomes digitized → Foundation: spread of Internet of Things and virtualization",
				"Physical products increasingly incorporating sensors and apps → Foundation: trend toward digitalization of manufactured goods",
				"Need for more business models linking big data to value capture → Foundation: current gap between opportunities and knowledge",
				"Growing importance of privacy transparency → Foundation: data privacy remains hot topic, key factor for user relationships",
				"Strategic consolidation through acquisitions → Foundation: Under Armour building suite of services, FitnessKeeper creating Health Graph to gather partner data",
				"More companies will offer free services in exchange for data streams → Foundation: new business models where users access services for free in return for revenue-generating data"
			],
			"synonyms_found": [],
			"source_citation": "Page 5: 'These strategies may be seen as representing an evolution in the approach to big data. Companies may begin by using their data to amplify traditional revenue-generation mechanisms such as advertising, then move on to using data to improve internal processes, and finally exploit the value of data directly by making it available to other players' | Page 9: 'As more of the world becomes digitized, through the spread of the Internet of Things and through virtualization, more industries will need to consider these kinds of strategies to harvest the value in streams of user-generated data' | Page 9: 'As more products incorporate sensors and apps, our work can be applied far beyond the limited context of smartphone apps' | Page 4: 'there is still a huge gap between the opportunities it presents and the current knowledge of the field. Few business models have been described that directly link big data to value capture' | Page 8: 'data privacy remains a hot topic among app users; transparency in managing data and user expectations for privacy is a key factor in building strong relationships with users' | Page 7: 'companies like Under Armour, which now owns 3 of the 14 apps in our sample... and seems to be building a suite of services for athletes... FitnessKeeper... created the Health Graph to gather data from partners as well. These two examples show how companies are seeking ways to build large databases' | Page 9: 'Our research suggests that big data can support new business models in which users access services for free in return for providing a revenue-generating data stream'",
			"confidence_level": "high"
		}
	]
}
