{
	"extraction_metadata": {
		"article_title": "A Pricing Framework for Software-as-a-Service",
		"extraction_date": "2025-10-07",
		"note": "This article presents a three-level pricing framework for SaaS business model with analysis of 353 SaaS vendors"
	},
	"extracted_data": [
		{
			"question_id": "1",
			"question_text": "What is the name and definition of the software business model presented in the article?",
			"response_found": true,
			"extracted_value": "Software-as-a-Service (SaaS): A business model where software is deployed as a hosted service and accessed over the Internet. It involves hosting single-versioned software coupled with supplementary delivery and maintenance services, where clients are charged through recurring subscription fees on a pay-as-you-go basis. SaaS is outsourced software where both technology infrastructure and management (hardware, software and professional services) are contracted out to software vendors and accessed remotely.",
			"synonyms_found": [
				"SaaS",
				"software-as-a-service",
				"software as a service",
				"hosted service",
				"remotely hosted software services",
				"emerging business model"
			],
			"source_citation": "Page 1, Abstract: 'software-as-a-service (SaaS) has proliferated over the past decade and there are signs to suggest that this growth is likely to continue or even accelerate in the near future. By hosting single-versioned software coupled with supplementary delivery and maintenance services, SaaS vendors can effectively differentiate their product offerings from that of traditional on-premise software (TOPS)' | Page 1: 'Software-as-a-Service (SaaS), \"software deployed as a hosted service and accessed over the Internet,\" is an emerging business model that is expected to grow rapidly' | Page 1: 'SaaS differs from traditional off-the-shelf software in three aspects. First, SaaS is outsourced software, meaning that both technology infrastructure and management - hardware, software and professional services - are contracted out to software vendors. Second, SaaS is remotely hosted, meaning that software are deployed as hosted services to be accessed by clients from remote locations' | Page 1: 'While most would assume SaaS licenses to be rather straightforward whereby clients are charged through recurring subscription fees on a pay-as-you-go basis'",
			"confidence_level": "high"
		},
		{
			"question_id": "2",
			"question_text": "What synonyms or alternative terms are used in the article to refer to this software business model?",
			"response_found": true,
			"extracted_value": "Hosted service, remotely hosted software services, software as a service, emerging business model, outsourced software, single-versioned software",
			"synonyms_found": [
				"SaaS",
				"software-as-a-service",
				"software as a service",
				"hosted service",
				"remotely hosted",
				"outsourced software",
				"emerging business model",
				"single-versioned software"
			],
			"source_citation": "Page 1: 'Software-as-a-Service (SaaS), \"software deployed as a hosted service and accessed over the Internet,\" is an emerging business model' | Page 1: 'SaaS is outsourced software' | Page 1: 'SaaS is remotely hosted, meaning that software are deployed as hosted services' | Page 1: 'SaaS is single versioned, meaning that there is only one version of software being accessed by every client at any moment in time'",
			"confidence_level": "high"
		},
		{
			"question_id": "3",
			"question_text": "What is the main vertical segment or industry where the software business model presented in the article is applied?",
			"response_found": true,
			"extracted_value": "Cross-industry SaaS applications including CRM, Collaboration, Project Management, Marketing, Accounting/Financial, Document Management, BPM, Productivity, Content Management, Business Intelligence, and IT/Application Management across multiple industries",
			"synonyms_found": [
				"software market",
				"SaaS market",
				"application types",
				"industry types"
			],
			"source_citation": "Page 3, Table II: 'Application Types (No. of application types: 45) CRM 8.8, Collaboration 8.5, Project Management 6.2, Marketing 5.3, Accounting/Financial 4.9, Document Management 4.9, BPM 4.6, Productivity 3.6, Content Management 3.3, Business Intelligence 2.9, IT/Application Management 2.8, Others 44.2' | Page 3, Table II: 'Industry Types (No. of industry types: 32) Professional Services 9.8, Technology 9.7, Software 9.2, Banking/Financial Services 7.3, Healthcare 5.8, Government 4.8, Entertainment/Media 4.7, Legal 4.5, Manufacturing 4.3, Education 4.0, Non-Profit 3.4, Others 32.5'",
			"confidence_level": "high"
		},
		{
			"question_id": "4",
			"question_text": "What is the target customer type of the software business model presented in the article?",
			"response_found": true,
			"extracted_value": "B2B (mixed: B2B SMB, Mid-market, and Enterprise). Small and medium enterprises have been the most aggressive adopters, and large corporations are equally attracted to acquiring software services on demand.",
			"synonyms_found": [
				"clients",
				"small and medium enterprises",
				"large corporations",
				"SaaS clients",
				"diversified clients"
			],
			"source_citation": "Page 2: 'The second challenge comes from the diversity of SaaS clients, among which small and medium enterprises have been the most aggressive adopters. Likewise, large corporations are equally attracted to the idea of acquiring software services on demand'",
			"confidence_level": "high"
		},
		{
			"question_id": "5",
			"question_text": "What is the typical size of offering companies that adopt this software business model as described in the article?",
			"response_found": true,
			"extracted_value": "Predominantly young companies: 65% less than 10 years old, 30% between 11-20 years, 3% between 21-30 years, and only 2% over 30 years",
			"synonyms_found": ["SaaS vendors", "vendors", "software vendors"],
			"source_citation": "Page 3, Table II: 'Age of vendors <10 65, 11-20 30, 21-30 3, >30 2'",
			"confidence_level": "high"
		},
		{
			"question_id": "6",
			"question_text": "In which geographic region was the software business model presented in the article studied or applied?",
			"response_found": true,
			"extracted_value": "Global study with predominance of USA (63.2%), followed by Canada (7.1%), UK (6.8%), Australia (5.4%), India (2.8%), New Zealand (2.0%), Ireland (1.7%), and 22 other countries (11%). Total of 26 countries represented.",
			"synonyms_found": [
				"countries",
				"USA",
				"Canada",
				"UK",
				"Australia",
				"India",
				"New Zealand",
				"Ireland"
			],
			"source_citation": "Page 3, Table II: 'Country of vendors (No. of countries: 26) USA 63.2, Canada 7.1, UK 6.8, Australia 5.4, India 2.8, New Zealand 2.0, Ireland 1.7, Others 11'",
			"confidence_level": "high"
		},
		{
			"question_id": "7",
			"question_text": "What specific customer segment is most detailed in the article regarding the software business model?",
			"response_found": true,
			"extracted_value": "Diverse client segments with varied usage patterns: (1) Low-breadth but high-depth usage clients (low frequency but complicated modules), (2) High-breadth but low-depth usage clients (high frequency but simple modules), and (3) Clients demanding access from odd times or obscure locations",
			"synonyms_found": [
				"clients",
				"SaaS clients",
				"usage patterns",
				"diversified clients"
			],
			"source_citation": "Page 2: 'The third challenge resides in clients' varied usage of software services. Whereas some clients may exhibit low-breadth but high-depth usage (i.e., low frequency of service usage but complicated software modules required), others may register the opposite usage pattern (i.e., high frequency of service usage but simple software modules required) or demand access to required services at odd times or from obscure locations'",
			"confidence_level": "high"
		},
		{
			"question_id": "8",
			"question_text": "What is the type of product or service offered by the software business model presented in the article?",
			"response_found": true,
			"extracted_value": [
				"Application (CRM, collaboration, project management, etc.)",
				"Platform (hosted services)",
				"Managed Service (supplementary delivery and maintenance services)"
			],
			"synonyms_found": [
				"hosted service",
				"software services",
				"application",
				"SaaS software",
				"supplementary services"
			],
			"source_citation": "Page 1: 'By hosting single-versioned software coupled with supplementary delivery and maintenance services, SaaS vendors can effectively differentiate their product offerings' | Page 1: 'software are deployed as hosted services to be accessed by clients from remote locations' | Page 3, Table II: Application types include 'CRM 8.8, Collaboration 8.5, Project Management 6.2, Marketing 5.3, Accounting/Financial 4.9, Document Management 4.9'",
			"confidence_level": "high"
		},
		{
			"question_id": "9",
			"question_text": "How is the software delivered or deployed in the business model presented in the article?",
			"response_found": true,
			"extracted_value": [
				"Multi-tenant SaaS (single-versioned software with multi-tenant architecture accessed remotely over the Internet)"
			],
			"synonyms_found": [
				"remotely hosted",
				"hosted service",
				"accessed over the Internet",
				"multi-tenant architecture",
				"single versioned"
			],
			"source_citation": "Page 1: 'Software-as-a-Service (SaaS), \"software deployed as a hosted service and accessed over the Internet\"' | Page 1: 'SaaS is remotely hosted, meaning that software are deployed as hosted services to be accessed by clients from remote locations' | Page 1: 'SaaS is single versioned, meaning that there is only one version of software being accessed by every client at any moment in time. The multi-tenant architecture of SaaS benefits both clients and vendors alike'",
			"confidence_level": "high"
		},
		{
			"question_id": "10",
			"question_text": "What is the intellectual property regime adopted by the software business model presented in the article?",
			"response_found": false,
			"extracted_value": "not reported",
			"synonyms_found": [],
			"source_citation": "information not found in text",
			"confidence_level": "high"
		},
		{
			"question_id": "11",
			"question_text": "Are there specific restrictions or compatibilities of licensing mentioned in the article about the software business model?",
			"response_found": true,
			"extracted_value": "SaaS licenses differ from traditional software: (1) Perpetual usage license fee is no longer applicable - clients charged only for what they utilized on periodic basis, (2) Maintenance revenues disappear as maintenance is now vendor responsibility, (3) Versioning is irrelevant due to single-version deployment",
			"synonyms_found": [
				"license",
				"licensing",
				"licensing practices",
				"software licenses",
				"perpetual license"
			],
			"source_citation": "Page 2: 'Revenue sources for SaaS are different from those of on-premise software in that the 'perpetual' usage license fee is no longer applicable and clients are charged for only what they have utilized, usually on a periodic basis. Additionally, maintenance revenues disappear as well because maintenance activities are now primarily the responsibilities of SaaS vendors' | Page 6: 'This study also highlighted discrepancies in licensing practices between SaaS and traditional on-premise software (e.g., versioning irrelevant)'",
			"confidence_level": "high"
		},
		{
			"question_id": "12",
			"question_text": "What are the revenue sources of the software business model presented in the article?",
			"response_found": true,
			"extracted_value": [
				"Subscription (recurring usage fees, monthly/annual subscriptions)",
				"Support (helpdesk, setup/training, configuration/integration)",
				"Usage/consumption (pay-per-use, resource consumption, transactions)",
				"Others (backup services, security services)"
			],
			"synonyms_found": [
				"recurring subscription fees",
				"recurring usage fee",
				"subscription fees",
				"pay-as-you-go",
				"service fee"
			],
			"source_citation": "Page 1: 'clients are charged through recurring subscription fees on a pay-as-you-go basis' | Page 3: 'Nowadays, a SaaS vendor typically charges his clients who subscribe hosted services a recurring usage fee' | Page 3: 'Monthly subscription fees are the most popular pricing model nowadays' | Page 2: 'The revenue model of software vendors comprises three main sources. First, the upfront usage license fee for the 'perpetual' right to utilize the licensed version of the software...Second, the ongoing maintenance fee...Third, the service fee for one-off or ongoing services such as software installation, customization, integration and user training' | Page 3, Table I: Service-based pricing includes 'Helpdesk...Backup...Security...Setup/Training...Configuration/Integration'",
			"confidence_level": "high"
		},
		{
			"question_id": "13",
			"question_text": "What is the base unit for pricing of the software business model presented in the article?",
			"response_found": true,
			"extracted_value": "Multiple pricing units: User/seat (named or concurrent users), Transactions, Computing time (time-based access), Storage (memory/bandwidth in GB or Kbps), Role-based, Location-based, Performance metrics (business performance reflecting usage intensity)",
			"synonyms_found": [
				"user based",
				"transaction based",
				"time based",
				"performance based",
				"memory/bandwidth based",
				"role based",
				"location based"
			],
			"source_citation": "Page 2-3, Table I: 'User based. Does pricing refer to certain number of users (e.g., named or concurrent users)? | Transaction based. Does pricing refer to certain number of transactions processed by software? | Time based. Does pricing refer to time (e.g., minutes) of accessing SaaS application? | Performance based. Does pricing refer to business performance metrics reflecting software usage intensity (e.g., number of rooms managed in a hotel management service)? | Memory/Bandwidth based. Does pricing refer to units of memory (e.g., GB) or bandwidth (e.g., Kpbs) required? | Role based. Does pricing refer to a set of pre-defined roles (e.g., authoring user or viewing user in a document management application)? | Location based. Does pricing refer to certain location (e.g., particular computers, computer networks, or other physical devices)?'",
			"confidence_level": "high"
		},
		{
			"question_id": "14",
			"question_text": "What is the price presentation structure of the software business model described in the article?",
			"response_found": true,
			"extracted_value": [
				"Tiers/Plans (function-based configurations, different pricing plans)",
				"Prepaid credits (bulk payment with discount)",
				"Pay-as-you-go (usage-dependent pricing)",
				"Custom negotiation (organization/region based, bundling options)"
			],
			"synonyms_found": [
				"pricing plans",
				"payment frequency",
				"bulk payment discount",
				"function based",
				"bundling",
				"organization/region based"
			],
			"source_citation": "Page 2-3, Table I: 'Payment Frequency based. Does pricing refer to multiple frequency of recurring payment (e.g., monthly, annual, etc.)? | Bulk Payment Discount. Does pricing refer to discount depending on payment frequency? | Function based. Does pricing refer to different functionality configurations? | Bundling. Does pricing refer to different bundle options of components? | Organization/Region based. Does pricing refer to different types of organizations or regions?' | Page 3: 'a vendor may offer different pricing plans for an application according to certain product-related criteria (e.g., different combinations of functionality) and charge clients differently according to the pricing plan selected by clients'",
			"confidence_level": "high"
		},
		{
			"question_id": "15",
			"question_text": "What currency and billing periodicity are used in the software business model as described in the article?",
			"response_found": true,
			"extracted_value": "USD currency. Billing periodicity: monthly is most popular, with options for annual and multiple payment frequencies. 67.2% use single payment frequency, 30% use multiple frequencies with bulk payment discounts.",
			"synonyms_found": [
				"monthly",
				"annual",
				"payment frequency",
				"periodic basis",
				"recurring"
			],
			"source_citation": "Page 1: 'the global SaaS market is expected to reach 12.1 billion USD by 2014' | Page 3: 'Monthly subscription fees are the most popular pricing model nowadays' | Page 2, Table I: 'Payment Frequency based. Does pricing refer to multiple frequency of recurring payment (e.g., monthly, annual, etc.)?' | Page 2: 'clients are charged for only what they have utilized, usually on a periodic basis' | Page 5: '67.2% of the vendors used single payment frequency, while 30% used multiple payment frequency options and complementary bulk payment discount incentive'",
			"confidence_level": "high"
		},
		{
			"question_id": "16",
			"question_text": "What is the role of the offering company in the ecosystem of the software business model presented in the article?",
			"response_found": true,
			"extracted_value": "Standalone product (SaaS vendors provide complete hosted software services directly to clients, managing all infrastructure, software, and professional services)",
			"synonyms_found": [
				"SaaS vendors",
				"software vendors",
				"vendors",
				"service provider"
			],
			"source_citation": "Page 1: 'SaaS is outsourced software, meaning that both technology infrastructure and management - hardware, software and professional services - are contracted out to software vendors' | Page 1: 'software are deployed as hosted services to be accessed by clients from remote locations'",
			"confidence_level": "high"
		},
		{
			"question_id": "17",
			"question_text": "What type of network effect is present in the software business model presented in the article?",
			"response_found": true,
			"extracted_value": "Direct network effects (economies of scale through expanding client base - vendors need sizeable pool of clients to achieve economies of scale with single-versioned multi-tenant architecture)",
			"synonyms_found": [
				"economies of scale",
				"economy of scale",
				"client base",
				"broad markets"
			],
			"source_citation": "Page 2: 'SaaS vendors are hence compelled to steadily improve service quality and price it accordingly in order to retain a sizeable pool of clients and achieve economies of scale' | Page 5-6: 'SaaS vendors tend to target broad markets to gain economy of scale. In SaaS, the deployment of a single version of software serving various clients with diversified requirements eliminates vendors' revenue sources from the provision of software maintenance. The recurring subscription fees from clients substitute vendors' revenue from the traditional up-front payments. To survive and thrive, vendors are supposed to expand clients base continuously in order to leverage on economy of scale'",
			"confidence_level": "high"
		},
		{
			"question_id": "18",
			"question_text": "What are the customer acquisition channels of the software business model presented in the article?",
			"response_found": false,
			"extracted_value": "not reported",
			"synonyms_found": [],
			"source_citation": "information not found in text",
			"confidence_level": "high"
		},
		{
			"question_id": "19",
			"question_text": "Does the software business model presented in the article use cloud marketplaces or platforms?",
			"response_found": false,
			"extracted_value": "not reported",
			"synonyms_found": [],
			"source_citation": "information not found in text",
			"confidence_level": "high"
		},
		{
			"question_id": "20",
			"question_text": "Which Business Model Canvas elements are detailed in the article about the software business model?",
			"response_found": true,
			"extracted_value": [
				"Value Proposition: Single-versioned software with supplementary delivery and maintenance services, faster consumption of innovation, elimination of version management complexity",
				"Customer Segment: Small and medium enterprises (most aggressive adopters), large corporations, diverse industries with varied usage patterns",
				"Revenue Streams: Recurring subscription fees (pay-as-you-go), usage fees, service fees (helpdesk, backup, security, setup/training, configuration/integration)",
				"Key Resources: Single-versioned multi-tenant software architecture, hosting infrastructure",
				"Key Activities: Hosting and maintaining software, provision of supplementary services (backup, security), functionality enhancements and service innovations",
				"Cost Structure: Hosting and maintenance costs, provision of supplementary services, significant variable costs from remote hosting"
			],
			"synonyms_found": ["value", "clients", "revenue", "costs", "services"],
			"source_citation": "Page 1: 'By hosting single-versioned software coupled with supplementary delivery and maintenance services, SaaS vendors can effectively differentiate their product offerings from that of traditional on-premise software (TOPS)' | Page 1: 'For clients, the consumption of innovation is faster as new capabilities are released simultaneously with each service upgrade. For vendors, the complexities and costs associated with managing and maintaining multiple software versions can be eliminated, thereby freeing up resources to focus on functionality enhancements and service innovations' | Page 2: 'The second challenge comes from the diversity of SaaS clients, among which small and medium enterprises have been the most aggressive adopters. Likewise, large corporations are equally attracted to the idea of acquiring software services on demand' | Page 1-2: 'clients are charged through recurring subscription fees on a pay-as-you-go basis...For SaaS licenses to be sustainable, software vendors would have to take into account not only the costs of hosting and maintaining the software, but also the costs associated with the provision of supplementary services (e.g., backup and security)' | Page 3: 'Cost-based pricing makes sense for SaaS because the remote hosting of software services culminates in significant variable costs for vendors'",
			"confidence_level": "high"
		},
		{
			"question_id": "21",
			"question_text": "Which actors participate in the ecosystem of the software business model presented in the article and how do they interact?",
			"response_found": true,
			"extracted_value": [
				{
					"Actor": "SaaS Vendors",
					"Role": "Provide hosted software services, manage infrastructure, maintain software, offer supplementary services",
					"Interaction_with_offering_company": "They are the offering company",
					"Interaction_with_other_actors": "Contract with clients to provide hosted services, charge recurring fees"
				},
				{
					"Actor": "Clients (SMEs and Large Corporations)",
					"Role": "Subscribe to and use hosted software services",
					"Interaction_with_offering_company": "Pay recurring subscription fees, consume software services remotely",
					"Interaction_with_other_actors": "End users of the service with varied usage patterns"
				}
			],
			"synonyms_found": [
				"SaaS vendors",
				"software vendors",
				"vendors",
				"clients",
				"small and medium enterprises",
				"large corporations"
			],
			"source_citation": "Page 1: 'SaaS is outsourced software, meaning that both technology infrastructure and management - hardware, software and professional services - are contracted out to software vendors' | Page 2: 'The second challenge comes from the diversity of SaaS clients, among which small and medium enterprises have been the most aggressive adopters. Likewise, large corporations are equally attracted to the idea of acquiring software services on demand' | Page 1: 'clients are charged through recurring subscription fees on a pay-as-you-go basis'",
			"confidence_level": "medium"
		},
		{
			"question_id": "22",
			"question_text": "What motivations lead to the adoption of the software business model presented in the article?",
			"response_found": true,
			"extracted_value": [
				"For clients: Faster consumption of innovation (new capabilities released simultaneously with upgrades)",
				"For clients: Elimination of infrastructure management burden (outsourced to vendors)",
				"For clients: Pay only for what is used (no upfront perpetual license fees)",
				"For clients: Simplified licensing (only pay for use of subscribed software)",
				"For vendors: Eliminate complexities and costs of managing multiple software versions",
				"For vendors: Free up resources to focus on functionality enhancements and service innovations",
				"For vendors: Achieve economies of scale through multi-tenant architecture",
				"Market growth opportunity (26% compound annual growth rate expected)"
			],
			"synonyms_found": ["benefits", "advantages", "growth", "innovation"],
			"source_citation": "Page 1: 'The multi-tenant architecture of SaaS benefits both clients and vendors alike. For clients, the consumption of innovation is faster as new capabilities are released simultaneously with each service upgrade. For vendors, the complexities and costs associated with managing and maintaining multiple software versions can be eliminated, thereby freeing up resources to focus on functionality enhancements and service innovations' | Page 1: 'the global SaaS market is expected to reach 12.1 billion USD by 2014, reflecting a compound annual growth rate of 26%' | Page 3: 'From clients' perspective, such software licenses are greatly simplified for the fact that they only pay for their use of the subscribed software' | Page 2: 'clients are charged for only what they have utilized, usually on a periodic basis'",
			"confidence_level": "high"
		},
		{
			"question_id": "23",
			"question_text": "What factors contribute to the success of the software business model as described in the article?",
			"response_found": true,
			"extracted_value": [
				"Value-based pricing orientation → helps secure sustainable revenue through high quality SaaS software",
				"Targeting broad markets → achieve economies of scale necessary for survival",
				"Expanding client base continuously → leverage economies of scale",
				"Usage-based pricing strategies → reflect both vendors' costs to deliver and clients' costs to consume services",
				"Steadily improving service quality → retain sizeable pool of clients",
				"Pricing aligned with client value perception → maximize business value for clients",
				"Flexible payment options with bulk discounts → alleviate financial pressure and encourage prepayment",
				"Accommodating diverse client preferences through multiple pricing components → collect extra revenue from customized requirements"
			],
			"synonyms_found": [
				"success",
				"sustainable revenue",
				"economies of scale",
				"quality",
				"value"
			],
			"source_citation": "Page 5: 'SaaS vendors seem to prefer value-based to cost-based orientation in software pricing. Value is what clients really want to pay for. For SaaS vendors, the focus on value-based orientation in software pricing will help them in securing sustainable revenue through the offering of high quality SaaS software' | Page 5-6: 'SaaS vendors tend to target broad markets to gain economy of scale...To survive and thrive, vendors are supposed to expand clients base continuously in order to leverage on economy of scale' | Page 2: 'SaaS vendors are hence compelled to steadily improve service quality and price it accordingly in order to retain a sizeable pool of clients and achieve economies of scale' | Page 6: 'usage-based pricing strategies were popular among SaaS vendors because usage-based metrics reflect both vendors' costs to deliver services and clients' costs to consume services' | Page 3: 'Payment-based pricing benefits clients by granting them more payment freedom' | Page 5: 'Adopting pricing components from different categories could help in accommodating diverse client preferences...some SaaS vendors included pricing components from different categories in their pricing strategies might demonstrate their endeavor to collect extra revenue by targeting clients with customized requirements'",
			"confidence_level": "high"
		},
		{
			"question_id": "24",
			"question_text": "What prerequisites or conditions are necessary for the software business model as described in the article?",
			"response_found": true,
			"extracted_value": [
				"Multi-tenant architecture capability → enable single-versioned software for all clients",
				"Remote hosting infrastructure → deploy software as hosted services accessible from remote locations",
				"Internet connectivity → enable access to hosted services",
				"Technology infrastructure management capability → manage hardware, software and professional services",
				"Ability to provide supplementary services → backup, security, helpdesk, setup/training, configuration/integration",
				"Sizeable client pool → achieve economies of scale necessary for sustainability"
			],
			"synonyms_found": [
				"infrastructure",
				"multi-tenant",
				"hosting",
				"technology",
				"services"
			],
			"source_citation": "Page 1: 'SaaS is outsourced software, meaning that both technology infrastructure and management - hardware, software and professional services - are contracted out to software vendors. Second, SaaS is remotely hosted, meaning that software are deployed as hosted services to be accessed by clients from remote locations. Third, SaaS is single versioned, meaning that there is only one version of software being accessed by every client at any moment in time. The multi-tenant architecture of SaaS benefits both clients and vendors alike' | Page 1: 'Software-as-a-Service (SaaS), \"software deployed as a hosted service and accessed over the Internet\"' | Page 1-2: 'software vendors would have to take into account not only the costs of hosting and maintaining the software, but also the costs associated with the provision of supplementary services (e.g., backup and security)' | Page 2: 'in order to retain a sizeable pool of clients and achieve economies of scale'",
			"confidence_level": "high"
		},
		{
			"question_id": "25",
			"question_text": "What restrictions or incompatibilities are mentioned in the article about the software business model?",
			"response_found": true,
			"extracted_value": [
				"Perpetual licensing no longer applicable → cannot charge upfront perpetual usage license fees",
				"Maintenance revenue eliminated → maintenance is now vendor responsibility, not separate revenue stream",
				"Low switching costs for clients → easy for clients to switch vendors, creating retention pressure",
				"Single-version requirement → cannot maintain multiple software versions for different clients",
				"Compact pricing strategies may limit niche market profitability → difficult to cover broader markets with few pricing components",
				"Complex pricing increases overhead costs → extra costs for customer care support with multiple pricing components"
			],
			"synonyms_found": [
				"challenges",
				"restrictions",
				"limitations",
				"no longer applicable",
				"eliminated"
			],
			"source_citation": "Page 2: 'Revenue sources for SaaS are different from those of on-premise software in that the 'perpetual' usage license fee is no longer applicable and clients are charged for only what they have utilized, usually on a periodic basis. Additionally, maintenance revenues disappear as well because maintenance activities are now primarily the responsibilities of SaaS vendors' | Page 2: 'given the nature of SaaS as remotely hosted software services, switching is neither expensive nor tedious for clients' | Page 1: 'SaaS is single versioned, meaning that there is only one version of software being accessed by every client at any moment in time' | Page 5: 'compact pricing strategies may jeopardize SaaS vendor' profits from clients from niche market because it is often difficult to cover a broader markets' | Page 6: 'adopting more components in software pricing will result in complicated pricing solutions, which are often translated to high overheads at the vendors' side, such as extra cost for customer care support'",
			"confidence_level": "high"
		},
		{
			"question_id": "26",
			"question_text": "What challenges are identified in implementing the software business model as presented in the article?",
			"response_found": true,
			"extracted_value": [
				"Better service quality expectations with loss of upfront and maintenance revenue placing financial pressure on vendors",
				"Low switching costs making client retention difficult",
				"Diversity of SaaS clients (SMEs and large corporations) with conflicting functional requirements",
				"Need to tailor licenses to match firm-specific requirements across diverse industries",
				"Varied usage patterns of clients (low-breadth/high-depth vs high-breadth/low-depth)",
				"Creating sustainable software licenses remains elusive goal",
				"Balancing compact pricing (simplicity) vs comprehensive pricing (coverage) strategies",
				"Risk of neglecting alignment between license and client value when targeting broad markets"
			],
			"synonyms_found": [
				"challenges",
				"difficulties",
				"pressure",
				"elusive goal"
			],
			"source_citation": "Page 2: 'The first challenge stems from clients' expectations for better service quality. Revenue sources for SaaS are different from those of on-premise software in that the 'perpetual' usage license fee is no longer applicable...Loss of revenue from up-front and maintenance payments therefore place greater financial pressure on SaaS vendors to secure a constant source of revenue. Yet, given the nature of SaaS as remotely hosted software services, switching is neither expensive nor tedious for clients' | Page 2: 'The second challenge comes from the diversity of SaaS clients, among which small and medium enterprises have been the most aggressive adopters. Likewise, large corporations are equally attracted to the idea of acquiring software services on demand. Moreover, diversities are also found in the industries within which SaaS clients are situated. Such diversity translates to conflicting functional requirements and the need for SaaS vendors to tailor licenses to match these firm-specific requirements' | Page 2: 'The third challenge resides in clients' varied usage of software services' | Page 3: 'from SaaS vendors' perspective, the creation of sustainable software licenses remains a pertinent and yet elusive goal in the near term' | Page 6: 'We argue this strategy is not sustainable for SaaS vendors in the long run because it may cause neglect to the importance of the alignment between license and client's value'",
			"confidence_level": "high"
		},
		{
			"question_id": "27",
			"question_text": "What practices are used to mitigate challenges of the software business model as described in the article?",
			"response_found": true,
			"extracted_value": [
				"Value-based pricing orientation → deliver more value to clients → secure sustainable revenue",
				"Targeting broad markets → expand client base → leverage economies of scale",
				"Usage-based pricing constructs → charge clients for what they use → align with client value perception",
				"Flexible payment options with bulk discounts → alleviate financial pressure → encourage prepayment",
				"Multiple pricing components across categories → accommodate diverse preferences → increase revenues",
				"Specialized market targeting (recommended) → reduce usage variations → easier expertise accumulation → improve service quality",
				"Fine-tuning licensing models toward varied usages → specialized market approach → extra revenues",
				"Complementing usage-independent pricing with payment discounts → maximize revenues while offering flexibility"
			],
			"synonyms_found": ["practices", "strategies", "approaches", "solutions"],
			"source_citation": "Page 6: 'Our work indicates that the licensing practices from current SaaS vendors mainly focus on value-based orientation to deliver more value to clients, targeting at broad markets to leverage economy of scale, and charging clients for what they use by fine-tuning usage-based pricing constructs' | Page 3: 'To alleviate financial pressure, software vendors encourage clients to prepay their subscriptions. Sometimes software vendors offer some degree of discount for those bulk payment clients' | Page 5: 'Adopting pricing components from different categories could help in accommodating diverse client preferences...some SaaS vendors included pricing components from different categories in their pricing strategies might demonstrate their endeavor to collect extra revenue by targeting clients with customized requirements' | Page 6: 'We suggest that it is vital for SaaS vendors to target at specialized markets in software licensing. Compared to the generalized market orientation, specialized market orientation implies that the usage variations among clients are less and the accumulation of expertise becomes relatively easy to achieve. This benefits vendors by supporting them to improve the quality of software services and create and deliver value-added client service. Also, specialized market orientation benefits SaaS vendors with extra revenues by allowing them to fine-tune licensing models towards varied usages of software services' | Page 6: 'when usage-independent based components were adopted, vendors usually complement them with discount options for pre-pay or bulk-pay subscribers'",
			"confidence_level": "high"
		},
		{
			"question_id": "28",
			"question_text": "What metrics and quantitative results are reported in the article about the software business model?",
			"response_found": true,
			"extracted_value": [
				{
					"Metric": "Global SaaS market size",
					"Value": "12.1",
					"Unit": "billion USD",
					"Period": "by 2014",
					"Method": "Gartner study forecast",
					"Source": "Gartner"
				},
				{
					"Metric": "SaaS market compound annual growth rate",
					"Value": "26",
					"Unit": "%",
					"Period": "forecast period",
					"Method": "Gartner study",
					"Source": "Gartner"
				},
				{
					"Metric": "Vendors preferring compact licensing (C1)",
					"Value": "57",
					"Unit": "%",
					"Period": "2012 study",
					"Method": "Cluster analysis of 353 vendors",
					"Source": "Study results"
				},
				{
					"Metric": "Vendors in C1 using ≤2 pricing components",
					"Value": "63",
					"Unit": "%",
					"Period": "2012 study",
					"Method": "Cluster analysis",
					"Source": "Study results"
				},
				{
					"Metric": "Vendors in C1 using ≤3 pricing components",
					"Value": "91",
					"Unit": "%",
					"Period": "2012 study",
					"Method": "Cluster analysis",
					"Source": "Study results"
				},
				{
					"Metric": "Vendors preferring value-based pricing (C2)",
					"Value": "28",
					"Unit": "%",
					"Period": "2012 study",
					"Method": "Cluster analysis",
					"Source": "Study results"
				},
				{
					"Metric": "Vendors preferring cost-based pricing (C3)",
					"Value": "15",
					"Unit": "%",
					"Period": "2012 study",
					"Method": "Cluster analysis",
					"Source": "Study results"
				},
				{
					"Metric": "Vendors using single payment frequency",
					"Value": "67.2",
					"Unit": "%",
					"Period": "2012 study",
					"Method": "Content analysis",
					"Source": "Study results"
				},
				{
					"Metric": "Vendors using multiple payment frequencies with bulk discount",
					"Value": "30",
					"Unit": "%",
					"Period": "2012 study",
					"Method": "Content analysis",
					"Source": "Study results"
				},
				{
					"Metric": "Vendors <10 years old",
					"Value": "65",
					"Unit": "%",
					"Period": "2012 sample",
					"Method": "Descriptive statistics",
					"Source": "353 vendor sample"
				},
				{
					"Metric": "Vendors from USA",
					"Value": "63.2",
					"Unit": "%",
					"Period": "2012 sample",
					"Method": "Descriptive statistics",
					"Source": "353 vendor sample"
				},
				{
					"Metric": "Vendors using function-based pricing (in C2 product cluster)",
					"Value": "100",
					"Unit": "%",
					"Period": "2012 study",
					"Method": "Cluster analysis",
					"Source": "Study results"
				},
				{
					"Metric": "Vendors preferring user-based pricing",
					"Value": "67",
					"Unit": "%",
					"Period": "2012 study",
					"Method": "Cluster analysis",
					"Source": "Study results"
				}
			],
			"synonyms_found": [
				"market size",
				"growth rate",
				"percentage",
				"statistics",
				"metrics"
			],
			"source_citation": "Page 1: 'According to a study by Gartner, the global SaaS market is expected to reach 12.1 billion USD by 2014, reflecting a compound annual growth rate of 26%' | Page 4: 'The largest cluster (C1) makes up 57% of our sample...in C1 63% vendors considered no more than two components and 91% vendors considered no more than three' | Page 4: 'Cluster two (C2) makes up 28% of our sample' | Page 4: 'Cluster three (C3) makes up 15% of our sample' | Page 5: '67.2% of the vendors used single payment frequency, while 30% used multiple payment frequency options and complementary bulk payment discount incentive' | Page 3, Table II: 'Age of vendors <10 65' | Page 3, Table II: 'USA 63.2' | Page 5: '100% of the vendors adopted the function-based pricing component' | Page 5: 'Vendors from cluster one, making up 67% of our sample, prefer the user-based pricing component'",
			"confidence_level": "high"
		},
		{
			"question_id": "29",
			"question_text": "What is the temporal period and maturity of the software business model as presented in the article?",
			"response_found": true,
			"extracted_value": "Observed period: Data collected September 1, 2012 from 353 SaaS vendors, with market forecasts to 2014. Article published 2014. Maturity status: Growing (SaaS has proliferated over past decade with signs of continued/accelerated growth; described as 'emerging business model' but with established practices)",
			"synonyms_found": [
				"emerging",
				"growth",
				"proliferated",
				"decade",
				"expected to grow"
			],
			"source_citation": "Page 1: 'software-as-a-service (SaaS) has proliferated over the past decade and there are signs to suggest that this growth is likely to continue or even accelerate in the near future' | Page 1: 'Software-as-a-Service (SaaS)...is an emerging business model that is expected to grow rapidly' | Page 3: 'The data collection work was done on September 1, 2012' | Page 1: '©2014 IEEE' | Page 6: 'As an emerging business model, SaaS is attracting more and more attention from both the software industry and the academia'",
			"confidence_level": "high"
		},
		{
			"question_id": "30",
			"question_text": "What is the type of evidence presented in the article about the software business model?",
			"response_found": true,
			"extracted_value": "Multiple cases (content analysis of 353 SaaS vendors) combined with secondary data analysis (market studies, literature review)",
			"synonyms_found": [
				"content analysis",
				"cluster analysis",
				"investigation",
				"study",
				"empirical analysis"
			],
			"source_citation": "Page 3: 'To gain insights into pricing strategies of SaaS vendors, we conducted content analysis to investigate the software licensing practices for SaaS' | Page 3: 'We were eventually left with 353 data points in our final sample' | Page 4: 'we performed cluster analyses on these pricing data in order to gain insights into the SaaS licensing practice' | Page 3: 'The pricing data source is obtained through our examination of each SaaS vendor's website according to the vendor list provided by the New Cloud Computing Showplace website'",
			"confidence_level": "high"
		},
		{
			"question_id": "31",
			"question_text": "Which companies or products are cited as examples of the software business model in the article?",
			"response_found": true,
			"extracted_value": [
				"New Cloud Computing Showplace (www.saas-showplace.com) → Vendor-independent resource center providing comprehensive SaaS vendor list, source of 353 vendor sample",
				"Generic application categories cited: CRM (8.8%), Collaboration (8.5%), Project Management (6.2%), Marketing (5.3%), Accounting/Financial (4.9%), Document Management (4.9%), BPM (4.6%), others",
				"Generic industry examples: Professional Services (9.8%), Technology (9.7%), Software (9.2%), Banking/Financial Services (7.3%), Healthcare (5.8%), Government (4.8%), others"
			],
			"synonyms_found": [
				"SaaS vendors",
				"Cloud Computing Showplace",
				"application types",
				"industry types"
			],
			"source_citation": "Page 3: 'The pricing data source is obtained through our examination of each SaaS vendor's website according to the vendor list provided by the New Cloud Computing Showplace website (http://www.saas-showplace.com). Based on our knowledge, we tend to believe the SaaS vendor list presented by the prior website is the most comprehensive one. Besides, this website is regarded as the vendor-independent, resource center of industrial best practices in SaaS market' | Page 3, Table II: 'Application Types (No. of application types: 45) CRM 8.8, Collaboration 8.5, Project Management 6.2, Marketing 5.3, Accounting/Financial 4.9, Document Management 4.9, BPM 4.6, Productivity 3.6, Content Management 3.3, Business Intelligence 2.9, IT/Application Management 2.8, Others 44.2' | Page 3, Table II: 'Industry Types (No. of industry types: 32) Professional Services 9.8, Technology 9.7, Software 9.2, Banking/Financial Services 7.3, Healthcare 5.8, Government 4.8, Entertainment/Media 4.7, Legal 4.5, Manufacturing 4.3, Education 4.0, Non-Profit 3.4, Others 32.5'",
			"confidence_level": "medium"
		},
		{
			"question_id": "32",
			"question_text": "Are there variations or subtypes of the software business model described in the article?",
			"response_found": true,
			"extracted_value": [
				"Value-based orientation models → Client-dictated pricing based on business value assessment (includes payment-based, product-based, usage-dependent categories)",
				"Cost-based orientation models → Vendor-dictated pricing based on cost accounting (includes usage-independent, service-based categories)",
				"Compact licensing models (57% of vendors) → Use few pricing components for simplicity",
				"Value-focused models (28% of vendors) → Prefer value-based over cost-based components",
				"Cost-focused models (15% of vendors) → Prefer cost-based over value-based components",
				"Payment-focus models (47% of vendors) → Emphasize payment-based and usage-independent pricing",
				"Usage-dependent models (33% of vendors) → Focus on usage-dependent pricing",
				"Service-based models (20% of vendors) → Emphasize service-based pricing with complex licenses"
			],
			"synonyms_found": [
				"orientation",
				"categories",
				"clusters",
				"models",
				"pricing strategies"
			],
			"source_citation": "Page 3: 'Layer 1 of our pricing framework consists of two types of pricing orientations, namely cost-based and value-based. Cost-based pricing implies that price levels of SaaS licenses are defined through cost accounting...cost-based pricing is dictated by SaaS vendors rather than clients. Conversely, value-based pricing of SaaS licenses means that price levels are determined through clients' assessment of the business value to be extracted from such software services. Value-based pricing is thus in sharp contrast to cost-based pricing in that it is dictated by clients rather than SaaS vendors' | Page 4: 'The largest cluster (C1) makes up 57% of our sample...most SaaS vendors prefer compact licensing models' | Page 4: 'Cluster two (C2) makes up 28% of our sample...vendors in C2 attach more importance on value-based rather than cost-based orientation' | Page 4: 'Cluster three (C3) makes up 15% of our sample...vendors in C3 attach more importance on cost-based rather than value-based orientation' | Page 4-5: 'Cluster one (C1) that makes up 47% of the sample represent vendors that attached more importance on pricing components from the payment-based and usage-independent based categories' | Page 5: 'Vendors in Cluster two (C2) that make up 33% of the sample attach more importance on pricing components from the usage-dependent based category' | Page 5: 'Vendors in Cluster three (C3) that makes up 20% of the sample attach more importance on pricing components from the service-based category'",
			"confidence_level": "high"
		},
		{
			"question_id": "33",
			"question_text": "What future trends or evolutions are mentioned in the article about the software business model?",
			"response_found": true,
			"extracted_value": [
				"Continued/accelerated growth expected beyond 2014 → signs suggest SaaS growth will continue or accelerate",
				"Global market reaching $12.1 billion by 2014 at 26% CAGR → strong expansion trajectory",
				"Shift from generalized to specialized market orientation (recommended) → better alignment between licenses and client value",
				"Evolution toward more sophisticated pricing frameworks → incorporation of previously overlooked pricing components",
				"Increasing importance of value-based pricing → focus on delivering value to clients",
				"Greater emphasis on usage-based pricing strategies → better reflection of vendor costs and client value",
				"Need for improved alignment between license design and client value → sustainable competitive advantage"
			],
			"synonyms_found": [
				"expected",
				"future",
				"continue",
				"accelerate",
				"evolution",
				"trend"
			],
			"source_citation": "Page 1: 'software-as-a-service (SaaS) has proliferated over the past decade and there are signs to suggest that this growth is likely to continue or even accelerate in the near future' | Page 1: 'the global SaaS market is expected to reach 12.1 billion USD by 2014, reflecting a compound annual growth rate of 26%' | Page 6: 'We suggest that it is vital for SaaS vendors to target at specialized markets in software licensing. Compared to the generalized market orientation, specialized market orientation implies that the usage variations among clients are less and the accumulation of expertise becomes relatively easy to achieve' | Page 6: 'This framework should also facilitate the identification and consideration of previously overlooked pricing components can then be incorporated into contemporary licenses for SaaS vendors' | Page 5: 'SaaS vendors seem to prefer value-based to cost-based orientation in software pricing...the focus on value-based orientation in software pricing will help them in securing sustainable revenue' | Page 6: 'usage-based pricing strategies could be attached greater importance by SaaS vendors'",
			"confidence_level": "high"
		}
	]
}
