{
  "extraction_metadata": {
    "article_title": "Systematic Literature Review of Monetization in Mobile App: Strategies, Trends, Challenges, and Best Practices",
    "extraction_date": "2025-01-27"
  },
  "extracted_data": [
    {
      "question_id": "1",
      "question_text": "What is the name and definition of the software business model presented in the article?",
      "response_found": true,
      "extracted_value": "Freemium - A business model that combines free and premium versions of a product, where users can access a free version with restricted functionality and a complete version that costs money but has more features and capabilities. It is a mix of the terms 'free' and 'premium'.",
      "synonyms_found": [
        "freemium strategy",
        "freemium model",
        "freemium monetization strategy"
      ],
      "source_citation": "Page 3: 'The phrase \"freemium\" refers to two different versions of a product: a free version with restricted functionality and a complete version that costs money but has more features and capabilities. It is a mix of the terms \"free\" and \"premium\"'",
      "confidence_level": "high"
    },
    {
      "question_id": "2",
      "question_text": "What synonyms or alternative terms are used in the article to refer to this software business model?",
      "response_found": true,
      "extracted_value": [
        "freemium strategy",
        "freemium model",
        "freemium monetization strategy",
        "de facto business model"
      ],
      "synonyms_found": [
        "freemium strategy",
        "freemium model",
        "freemium monetization strategy",
        "de facto business model"
      ],
      "source_citation": "Page 3: 'The freemium monetization strategy has emerged as a prominent and widely studied topic. Scholars have recognized it as a \"de facto business model\"'",
      "confidence_level": "high"
    },
    {
      "question_id": "3",
      "question_text": "What is the main vertical segment or industry where the software business model presented in the article is applied?",
      "response_found": true,
      "extracted_value": "Mobile Application Development",
      "synonyms_found": [
        "mobile app industry",
        "mobile market",
        "mobile application development"
      ],
      "source_citation": "Page 1: 'In the digital age, the concept of monetization has undergone significant transformations, particularly within the mobile app industry'",
      "confidence_level": "high"
    },
    {
      "question_id": "4",
      "question_text": "What is the target customer type of the software business model presented in the article?",
      "response_found": true,
      "extracted_value": "B2C",
      "synonyms_found": [
        "users",
        "consumers",
        "end users"
      ],
      "source_citation": "Page 1: 'For mobile app developers, the identification of an optimal monetization strategy is crucial for achieving success' and throughout the article references to 'users' as the primary target",
      "confidence_level": "high"
    },
    {
      "question_id": "5",
      "question_text": "What is the typical size of offering companies that adopt this software business model as described in the article?",
      "response_found": true,
      "extracted_value": "Various sizes from startups to large corporations, with emphasis on firms that can implement effective monetization strategies",
      "synonyms_found": [
        "firms",
        "companies",
        "developers",
        "larger developers"
      ],
      "source_citation": "Page 3: 'only larger developers are able to collect personal data without being viewed as detrimental by users' and Page 1: 'assist firms in selecting the most suitable revenue stream'",
      "confidence_level": "medium"
    },
    {
      "question_id": "6",
      "question_text": "In which geographic region was the software business model presented in the article studied or applied?",
      "response_found": true,
      "extracted_value": "Global/Worldwide",
      "synonyms_found": [
        "worldwide",
        "globally",
        "international"
      ],
      "source_citation": "Page 1: 'According to a Grand View Research analysis, the worldwide mobile market is expected to increase at a 13.8% compound annual growth rate (CAGR) between 2023 and 2030' and Page 6: '9 apps that consistently rank in the top 20 worldwide'",
      "confidence_level": "high"
    },
    {
      "question_id": "7",
      "question_text": "What specific customer segment is most detailed in the article regarding the software business model?",
      "response_found": true,
      "extracted_value": "Mobile app users who engage with freemium applications",
      "synonyms_found": [
        "users",
        "free users",
        "paying users",
        "premium users"
      ],
      "source_citation": "Page 3: 'Among users, free applications are highly favored, primarily due to their zero-cost nature' and Page 4: 'The presence of free users in the freemium landscape is crucial as it contributes to the overall success of the strategy'",
      "confidence_level": "high"
    },
    {
      "question_id": "8",
      "question_text": "What is the type of product or service offered by the software business model presented in the article?",
      "response_found": true,
      "extracted_value": [
        "Application"
      ],
      "synonyms_found": [
        "mobile applications",
        "apps",
        "mobile apps"
      ],
      "source_citation": "Page 1: 'Mobile applications have grown significantly in popularity' and throughout the article references to 'mobile apps' and 'applications'",
      "confidence_level": "high"
    },
    {
      "question_id": "9",
      "question_text": "How is the software delivered or deployed in the business model presented in the article?",
      "response_found": true,
      "extracted_value": [
        "Mobile"
      ],
      "synonyms_found": [
        "mobile devices",
        "mobile phones",
        "mobile platforms"
      ],
      "source_citation": "Page 1: 'Mobile applications have grown significantly in popularity over the past three decades and have integrated themselves significantly into daily life. They are made up of a collection of apps created especially for mobile devices'",
      "confidence_level": "high"
    },
    {
      "question_id": "10",
      "question_text": "What is the intellectual property regime adopted by the software business model presented in the article?",
      "response_found": false,
      "extracted_value": "not reported",
      "synonyms_found": [],
      "source_citation": "information not found in text",
      "confidence_level": "high"
    },
    {
      "question_id": "11",
      "question_text": "Are there specific restrictions or compatibilities of licensing mentioned in the article about the software business model?",
      "response_found": false,
      "extracted_value": "not reported",
      "synonyms_found": [],
      "source_citation": "information not found in text",
      "confidence_level": "high"
    },
    {
      "question_id": "12",
      "question_text": "What are the revenue sources of the software business model presented in the article?",
      "response_found": true,
      "extracted_value": [
        "Subscription",
        "Usage/consumption",
        "Advertising",
        "Support"
      ],
      "synonyms_found": [
        "in-app purchases",
        "in-app advertising",
        "subscription-based model",
        "one-time purchase",
        "advertisements"
      ],
      "source_citation": "Page 3: 'implementing one-time purchases and subscription-based models are common practices within the premium app market' and Page 3: 'Developers employ various practices to implement freemium strategies, with in-app purchases (IAP) and in-app advertising being the primary approaches used'",
      "confidence_level": "high"
    },
    {
      "question_id": "13",
      "question_text": "What is the base unit for pricing of the software business model presented in the article?",
      "response_found": true,
      "extracted_value": "User/seat",
      "synonyms_found": [
        "users",
        "user base",
        "paying users"
      ],
      "source_citation": "Page 4: 'What drives users to pay in freemium is the social prestige associated with using a high-end product' and throughout the article references to user-based pricing models",
      "confidence_level": "medium"
    },
    {
      "question_id": "14",
      "question_text": "What is the price presentation structure of the software business model described in the article?",
      "response_found": true,
      "extracted_value": [
        "Freemium",
        "Trial",
        "Tiers/Plans"
      ],
      "synonyms_found": [
        "free version",
        "premium version",
        "trial period",
        "sample version"
      ],
      "source_citation": "Page 3: 'offering trial versions of premium apps has been recognized as an effective approach to stimulate sales' and Page 3: 'The phrase \"freemium\" refers to two different versions of a product: a free version with restricted functionality and a complete version that costs money'",
      "confidence_level": "high"
    },
    {
      "question_id": "15",
      "question_text": "What currency and billing periodicity are used in the software business model as described in the article?",
      "response_found": false,
      "extracted_value": "not reported",
      "synonyms_found": [],
      "source_citation": "information not found in text",
      "confidence_level": "high"
    },
    {
      "question_id": "16",
      "question_text": "What is the role of the offering company in the ecosystem of the software business model presented in the article?",
      "response_found": true,
      "extracted_value": "Standalone product",
      "synonyms_found": [
        "firms",
        "developers",
        "companies"
      ],
      "source_citation": "Page 1: 'For mobile app developers, the identification of an optimal monetization strategy is crucial for achieving success' and throughout the article, companies are positioned as standalone app developers",
      "confidence_level": "high"
    },
    {
      "question_id": "17",
      "question_text": "What type of network effect is present in the software business model presented in the article?",
      "response_found": true,
      "extracted_value": "Direct (more users = more value)",
      "synonyms_found": [
        "network effects",
        "network externalities",
        "social prestige"
      ],
      "source_citation": "Page 4: 'What drives users to pay in freemium is the social prestige associated with using a high-end product. This aspect highlights the fundamental reason why implementing a network within the application is important' and Page 4: 'the presence of asymmetry in network effects plays a significant role in determining the success of freemium applications'",
      "confidence_level": "high"
    },
    {
      "question_id": "18",
      "question_text": "What are the customer acquisition channels of the software business model presented in the article?",
      "response_found": true,
      "extracted_value": [
        "Product-led Growth",
        "Digital marketing"
      ],
      "synonyms_found": [
        "trial version",
        "sample version",
        "digital marketing orientation"
      ],
      "source_citation": "Page 5: 'These features may be seen in the trial version with advertisements' and Page 4: 'apps can gain a competitive edge by adopting a digital marketing orientation'",
      "confidence_level": "medium"
    },
    {
      "question_id": "19",
      "question_text": "Does the software business model presented in the article use cloud marketplaces or platforms?",
      "response_found": true,
      "extracted_value": "Yes",
      "synonyms_found": [
        "app stores",
        "Google Store",
        "Apple Store"
      ],
      "source_citation": "Page 1: 'By Store Type (Google Store, Apple Store, Others)' and references to app distribution through mobile app stores",
      "confidence_level": "medium"
    },
    {
      "question_id": "20",
      "question_text": "Which Business Model Canvas elements are detailed in the article about the software business model?",
      "response_found": true,
      "extracted_value": [
        "Value Proposition: Free version with restricted functionality and premium version with enhanced features",
        "Customer Segment: Mobile app users, both free and paying users",
        "Revenue Streams: In-app purchases, in-app advertising, subscription models, one-time purchases",
        "Key Activities: App development, monetization strategy implementation, user retention optimization"
      ],
      "synonyms_found": [
        "value proposition",
        "customer segment",
        "revenue streams",
        "key activities"
      ],
      "source_citation": "Page 3: 'The phrase \"freemium\" refers to two different versions of a product: a free version with restricted functionality and a complete version that costs money but has more features and capabilities' and Page 3: 'implementing one-time purchases and subscription-based models are common practices'",
      "confidence_level": "medium"
    },
    {
      "question_id": "21",
      "question_text": "Which actors participate in the ecosystem of the software business model presented in the article and how do they interact?",
      "response_found": true,
      "extracted_value": [
        "App Developers | Create and maintain mobile applications | Provide apps to users | Compete with other developers",
        "Users (Free) | Use free version of apps | Generate data and network effects | Influence paying users through social networks",
        "Users (Paying) | Purchase premium features | Generate revenue for developers | Provide social prestige to free users",
        "Advertisers | Pay for ad placement | Provide revenue through advertising | Target users through app advertising"
      ],
      "synonyms_found": [
        "developers",
        "users",
        "advertisers",
        "firms"
      ],
      "source_citation": "Page 4: 'What drives users to pay in freemium is the social prestige associated with using a high-end product' and Page 3: 'Developers employ various practices to implement freemium strategies, with in-app purchases (IAP) and in-app advertising being the primary approaches'",
      "confidence_level": "high"
    },
    {
      "question_id": "22",
      "question_text": "What motivations lead to the adoption of the software business model presented in the article?",
      "response_found": true,
      "extracted_value": [
        "Flexibility in choosing revenue sources",
        "Ability to attract large user base",
        "Social prestige for paying users",
        "Network effects benefits",
        "Gradual increase in sales"
      ],
      "synonyms_found": [
        "flexibility",
        "user base",
        "social prestige",
        "network effects",
        "sales"
      ],
      "source_citation": "Page 4: 'This research led to the result where freemium stands out as the best strategy to implement. This result is supported by studies that mention freemium can generate a large user base while providing more flexibility in choosing the source of revenue' and Page 4: 'What drives users to pay in freemium is the social prestige associated with using a high-end product'",
      "confidence_level": "high"
    },
    {
      "question_id": "23",
      "question_text": "What factors contribute to the success of the software business model as described in the article?",
      "response_found": true,
      "extracted_value": [
        "Clear distinction between free and premium features → Higher conversion rates",
        "Network effects → Increased user engagement and social prestige",
        "User retention → Strong indicator of monetization success",
        "Proper balance of service quality → Meaningful value proposition for customers",
        "Uncertainty in app quality → Higher sales through upgrade concept"
      ],
      "synonyms_found": [
        "distinction",
        "network effects",
        "retention",
        "balance",
        "uncertainty"
      ],
      "source_citation": "Page 4: 'It is crucial for firms to define the maximum features available for free users and the minimum features offered to premium users' and Page 4: 'Measuring the effectiveness of a freemium model can be done through time retention, which serves as a strong indicator of monetization success'",
      "confidence_level": "high"
    },
    {
      "question_id": "24",
      "question_text": "What prerequisites or conditions are necessary for the software business model as described in the article?",
      "response_found": true,
      "extracted_value": [
        "High-quality base product → Essential for attracting and retaining users",
        "Clear feature boundaries → Affects network effects and conversion rates",
        "User comfort and usability → Affects user retention",
        "Network implementation → Affects social prestige and user engagement"
      ],
      "synonyms_found": [
        "quality",
        "boundaries",
        "comfort",
        "network"
      ],
      "source_citation": "Page 5: 'A high-quality base for the services is essential to attract users and retain them on the platform' and Page 4: 'It is crucial for firms to define the maximum features available for free users and the minimum features offered to premium users'",
      "confidence_level": "high"
    },
    {
      "question_id": "25",
      "question_text": "What restrictions or incompatibilities are mentioned in the article about the software business model?",
      "response_found": true,
      "extracted_value": [
        "Too many free users → Can harm businesses and reduce revenue (cannibalization)",
        "Poor quality balance → Users may stop paying or refrain from purchasing",
        "Frequent advertisements → Can negatively impact user experience",
        "Low service quality → May discourage users from continuing to use the product"
      ],
      "synonyms_found": [
        "cannibalization",
        "balance",
        "advertisements",
        "quality"
      ],
      "source_citation": "Page 4: 'Too many free users can harm businesses and reduce revenue. When the availability of free services threatens profitability, this process is known as the \"cannibalization\" of paying clients' and Page 3: 'the frequency of ads can negatively impact users' experience'",
      "confidence_level": "high"
    },
    {
      "question_id": "26",
      "question_text": "What challenges are identified in implementing the software business model as presented in the article?",
      "response_found": true,
      "extracted_value": [
        "Determining optimal balance between free and premium features",
        "Managing advertisement frequency to avoid user irritation",
        "Preventing cannibalization of paying customers by free users",
        "Setting appropriate pricing for in-app purchases",
        "Maintaining user retention and engagement",
        "Handling user data collection without being perceived as harmful"
      ],
      "synonyms_found": [
        "balance",
        "advertisements",
        "cannibalization",
        "pricing",
        "retention",
        "data collection"
      ],
      "source_citation": "Page 5: 'This strategy presents more complex challenges. When it comes to advertisements, the frequency of ads can negatively impact users' experience' and Page 4: 'Too many free users can harm businesses and reduce revenue'",
      "confidence_level": "high"
    },
    {
      "question_id": "27",
      "question_text": "What practices are used to mitigate challenges of the software business model as described in the article?",
      "response_found": true,
      "extracted_value": [
        "Implementing trial versions → Mitigates user uncertainty → Increases conversion rates",
        "Digital marketing orientation → Mitigates competition → Enhances value proposition",
        "Focus on user comfort and usability → Mitigates low retention → Improves user engagement",
        "Shorter contract lengths → Mitigates high termination rates → Reduces churn",
        "Proper feature distinction → Mitigates cannibalization → Maintains revenue streams"
      ],
      "synonyms_found": [
        "trial versions",
        "digital marketing",
        "user comfort",
        "contract lengths",
        "feature distinction"
      ],
      "source_citation": "Page 5: 'offering trial versions of premium apps has been recognized as an effective approach to stimulate sales' and Page 5: 'A shorter contract length is also fundamentally linked to a lower termination rate'",
      "confidence_level": "high"
    },
    {
      "question_id": "28",
      "question_text": "What metrics and quantitative results are reported in the article about the software business model?",
      "response_found": true,
      "extracted_value": [
        "Market Size; USD 206.85 billion; 2022; Market analysis; Grand View Research",
        "Projected Market Size; USD 567.19 billion; 2030; CAGR 13.8%; Grand View Research",
        "User Retention; 3%; 30 days; User behavior analysis; Bothma study",
        "WhatsApp Users; 2.5 billion; 2022; User statistics; Business of Apps"
      ],
      "synonyms_found": [
        "market size",
        "user retention",
        "users",
        "revenue"
      ],
      "source_citation": "Page 1: 'According to a Grand View Research analysis, the worldwide mobile market is expected to increase at a 13.8% compound annual growth rate (CAGR) between 2023 and 2030, reaching a value of USD 206.85 billion in 2022' and Page 1: 'As pointed out by Bothma, a mere 3% of users continue using an application after 30 days'",
      "confidence_level": "high"
    },
    {
      "question_id": "29",
      "question_text": "What is the temporal period and maturity of the software business model as presented in the article?",
      "response_found": true,
      "extracted_value": "2018-2023 period + Growing",
      "synonyms_found": [
        "recent years",
        "last five years",
        "growing"
      ],
      "source_citation": "Page 1: 'This analysis is conducted through an investigation of marketing and technology journals published within the last five years' and Page 1: 'the worldwide mobile market is expected to increase at a 13.8% compound annual growth rate'",
      "confidence_level": "high"
    },
    {
      "question_id": "30",
      "question_text": "What is the type of evidence presented in the article about the software business model?",
      "response_found": true,
      "extracted_value": "Literature review",
      "synonyms_found": [
        "systematic literature review",
        "SLR methodology"
      ],
      "source_citation": "Page 2: 'To acquire comprehensive knowledge for this study, the authors employed the Systematic Literature Review (SLR) methodology'",
      "confidence_level": "high"
    },
    {
      "question_id": "31",
      "question_text": "Which companies or products are cited as examples of the software business model in the article?",
      "response_found": true,
      "extracted_value": [
        "Vine → Example of failure due to lack of proper monetization strategy",
        "Amazon → Freemium model with ads and in-app purchases",
        "Facebook → Freemium model with advertising",
        "Instagram → Freemium model with advertising",
        "Messenger → Freemium model with ads and in-app purchases",
        "Netflix → Premium subscription model",
        "Snapchat → Freemium model with advertising",
        "Spotify → Freemium model with ads and subscription",
        "TikTok → Freemium model with ads and in-app purchases",
        "WhatsApp → Free model (no monetization)"
      ],
      "synonyms_found": [
        "Vine",
        "Amazon",
        "Facebook",
        "Instagram",
        "Messenger",
        "Netflix",
        "Snapchat",
        "Spotify",
        "TikTok",
        "WhatsApp"
      ],
      "source_citation": "Page 1: 'Take the case of Vine, a once popular social media platform, which is said to have failed in part due to its lack of a proper monetization plan' and Page 6: 'Our key findings reveal that 7 out of the top 9 apps fall within the freemium spectrum'",
      "confidence_level": "high"
    },
    {
      "question_id": "32",
      "question_text": "Are there variations or subtypes of the software business model described in the article?",
      "response_found": true,
      "extracted_value": [
        "Level 5 - Premium → All-inclusive payment model with trial period",
        "Level 4 - Semi-premium → Partially-inclusive payment with additional paid features",
        "Level 3 - In-app advertising & in-app purchases → Free app with ads encouraging payments",
        "Level 2 - Sample & premium → Two separate applications with intentional quality difference",
        "Level 1 - In-app advertising → Single version relying solely on advertising revenue",
        "Level 0 - Free → No monetization strategy, benefits from personal data"
      ],
      "synonyms_found": [
        "premium",
        "semi-premium",
        "in-app advertising",
        "sample & premium",
        "free"
      ],
      "source_citation": "Page 5: 'In Fig. 2, the authors have illustrated six levels of monetization strategies. These levels represent varying degrees of strategical importance, ranging from 5, where users are required to fully pay for the application, to 0, indicating that users do not need to spend any money'",
      "confidence_level": "high"
    },
    {
      "question_id": "33",
      "question_text": "What future trends or evolutions are mentioned in the article about the software business model?",
      "response_found": true,
      "extracted_value": [
        "Market growth projection to USD 567.19 billion by 2030 with 13.8% CAGR",
        "Need for deeper insights into different app categories (gaming, social networking, retail, e-commerce, music, entertainment)",
        "Continued evolution of freemium as the dominant strategy due to flexibility and user base attraction"
      ],
      "synonyms_found": [
        "market growth",
        "app categories",
        "freemium evolution"
      ],
      "source_citation": "Page 1: 'According to a Grand View Research analysis, the worldwide mobile market is expected to increase at a 13.8% compound annual growth rate (CAGR) between 2023 and 2030, reaching a value of USD 206.85 billion in 2022' and Page 7: 'Future research should focus on several mobile application categories, including gaming, social networking, retail and e-commerce, music and entertainment'",
      "confidence_level": "high"
    }
  ]
}