{
	"qualitative_analysis": [
		{
			"article_id": "190638760",
			"article_title": "A Pricing Framework for Software-as-a-Service",
			"quote": "software-as-a-service (SaaS) has proliferated over the past decade and there are signs to suggest that this growth is likely to continue or even accelerate in the near future.",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Growing business model",
				"Future growth potential"
			],
			"justification": "Descreve o SaaS como modelo em crescimento com potencial de expansão futura acelerada."
		},
		{
			"article_id": "190638760",
			"article_title": "A Pricing Framework for Software-as-a-Service",
			"quote": "By hosting single-versioned software coupled with supplementary delivery and maintenance services, SaaS vendors can effectively differentiate their product offerings from that of traditional on-premise software (TOPS)",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Single-version deployment",
				"Service-oriented model",
				"Remote hosting"
			],
			"justification": "Destaca a arquitetura de versão única e a entrega de software como serviço hospedado remotamente, diferenciando-se do software tradicional."
		},
		{
			"article_id": "190638760",
			"article_title": "A Pricing Framework for Software-as-a-Service",
			"quote": "SaaS is outsourced software, meaning that both technology infrastructure and management - hardware, software and professional services - are contracted out to software vendors.",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Cloud computing infrastructure",
				"Service-oriented model"
			],
			"justification": "Define o SaaS como outsourcing completo de infraestrutura e gestão para fornecedores."
		},
		{
			"article_id": "190638760",
			"article_title": "A Pricing Framework for Software-as-a-Service",
			"quote": "clients are charged through recurring subscription fees on a pay-as-you-go basis",
			"assigned_codes": [
				"Subscription-based pricing",
				"Pay-as-you-go pricing",
				"Revenue stream transformation"
			],
			"justification": "Descreve o modelo de precificação recorrente e baseado em uso característico do SaaS."
		},
		{
			"article_id": "190638781",
			"article_title": "Selection of the Proper Revenue and Pricing Model for SaaS",
			"quote": "Software as a Service (SaaS), which provides applications on top of PaaS and IaaS",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Cloud computing infrastructure",
				"Cloud delivery model"
			],
			"justification": "Posiciona o SaaS como camada de aplicação sobre a infraestrutura de computação em nuvem."
		},
		{
			"article_id": "190638781",
			"article_title": "Selection of the Proper Revenue and Pricing Model for SaaS",
			"quote": "software renting is becoming more frequent in the new era of computing, in which software is delivered via the SaaS model",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Subscription-based pricing",
				"Service-oriented model"
			],
			"justification": "Descreve a mudança para modelo de aluguel de software ao invés de compra perpétua."
		},
		{
			"article_id": "190638781",
			"article_title": "Selection of the Proper Revenue and Pricing Model for SaaS",
			"quote": "SaaS has multi-tenant or multi-instance architecture; the former refers to the situation in which a vendor hosts a single instance on a server that serves multiple customers (tenants), whereas the latter is related to the model in which a vendor hosts separate instances for each customer within shared hardware",
			"assigned_codes": [
				"Multi-tenant architecture",
				"Multi-instance architecture",
				"Cloud computing infrastructure"
			],
			"justification": "Define as duas principais arquiteturas de implantação do SaaS: multi-tenant e multi-instance."
		},
		{
			"article_id": "190638871",
			"article_title": "Transition to the Cloud: A Vendor Perspective",
			"quote": "The National Institute of Standards and Technology (NIST) defines cloud computing as \"a model for enabling convenient, on-demand network access to a shared pool of configurable computing resources that can be rapidly provisioned and released with minimal management effort\"",
			"assigned_codes": [
				"Cloud computing infrastructure",
				"On-demand access",
				"Cloud delivery model"
			],
			"justification": "Definição técnica oficial de computação em nuvem destacando acesso sob demanda e recursos compartilhados."
		},
		{
			"article_id": "190638871",
			"article_title": "Transition to the Cloud: A Vendor Perspective",
			"quote": "the business model of cloud computing implies a different revenue stream: instead of relying on upfront license fee, IT vendors are now collecting periodic subscription fee",
			"assigned_codes": [
				"Revenue stream transformation",
				"Subscription-based pricing",
				"Established vendor transition"
			],
			"justification": "Descreve a mudança fundamental no modelo de receita de licenças perpétuas para assinaturas periódicas."
		},
		{
			"article_id": "190638871",
			"article_title": "Transition to the Cloud: A Vendor Perspective",
			"quote": "In this paper, we present a case study of an ERP vendor for SMB (small and medium-size business) in making a transition towards a cloud-based business model.",
			"assigned_codes": [
				"Established vendor transition",
				"SME market focus",
				"Cloud delivery model"
			],
			"justification": "Foca na transição de fornecedor tradicional para modelo cloud, com foco em pequenas e médias empresas."
		},
		{
			"article_id": "190638976",
			"article_title": "Managing a Software Business",
			"quote": "Start with your business model, the idea that describes how you create value. Will that be a pure software product, such as Microsoft Windows; a software–hardware combination (consider the iPhone); or a service, such as eBay?",
			"assigned_codes": ["Service-oriented model", "Hybrid business model"],
			"justification": "Apresenta diferentes tipos de modelos de negócio de software: produto puro, combinação hardware-software, ou serviço."
		},
		{
			"article_id": "190638976",
			"article_title": "Managing a Software Business",
			"quote": "Having a service component in your offering lets you secure recurring revenue. However, you'll also need to invest in and manage the operations required to deliver it.",
			"assigned_codes": [
				"Service-oriented model",
				"Subscription-based pricing",
				"Revenue stream transformation"
			],
			"justification": "Destaca benefícios de receita recorrente e desafios operacionais do modelo de serviço."
		},
		{
			"article_id": "190653396",
			"article_title": "Digital sustainable business models: Using digital technology to integrate ecological sustainability into the core of business models",
			"quote": "digital sustainable BMs, including the value proposition, value delivery, and value capture, those start-ups do not curb to environmental damage reactively but use digital technologies proactively to tackle global warming as an integral part of their BM.",
			"assigned_codes": [
				"Sustainability focus",
				"Digital transformation",
				"Startup company focus"
			],
			"justification": "Descreve modelos de negócio que integram sustentabilidade ecológica proativamente através de tecnologias digitais."
		},
		{
			"article_id": "190653396",
			"article_title": "Digital sustainable business models: Using digital technology to integrate ecological sustainability into the core of business models",
			"quote": "we go beyond using digital technology to optimise production or logistics or enable remote work and implement ecological sustainability as a core logic of the organisation and its identity",
			"assigned_codes": [
				"Sustainability focus",
				"Digital transformation",
				"Value-based orientation"
			],
			"justification": "Enfatiza sustentabilidade como lógica central da organização, não apenas otimização operacional."
		},
		{
			"article_id": "190653434",
			"article_title": "When does a freemium business model lead to high performance?",
			"quote": "As an emerging business model, the freemium business model has received considerable attention from business research in recent years. Freemium combines \"free\" and \"premium,\" i.e., offering a free basic version of the product and a fully paid version.",
			"assigned_codes": ["Freemium model", "Emerging business model"],
			"justification": "Define o modelo freemium como emergente, combinando versões gratuitas e pagas."
		},
		{
			"article_id": "190653434",
			"article_title": "When does a freemium business model lead to high performance?",
			"quote": "The business adds more value through one (or several) premium sales (from which it gets value)",
			"assigned_codes": ["Freemium model", "Subscription-based pricing"],
			"justification": "Descreve a estratégia de captura de valor através de vendas premium no modelo freemium bundled."
		},
		{
			"article_id": "190653434",
			"article_title": "When does a freemium business model lead to high performance?",
			"quote": "The company creates value with free products and then adds more value with many \"fragmented\" upsell products",
			"assigned_codes": ["Freemium model", "Flexible pricing strategies"],
			"justification": "Descreve o modelo freemium fragmentado com múltiplos produtos de upsell."
		},
		{
			"article_id": "190653582",
			"article_title": "Strategy and business model evolution at Adobe",
			"quote": "Why Adobe made an important yet risky strategic decision to transition from the time-tested perpetual licence price model to a cloud and subscription-based pricing model",
			"assigned_codes": [
				"Established vendor transition",
				"Revenue stream transformation",
				"Subscription-based pricing",
				"Cloud delivery model"
			],
			"justification": "Descreve a transição estratégica e arriscada de Adobe de licenças perpétuas para assinaturas cloud."
		},
		{
			"article_id": "190653582",
			"article_title": "Strategy and business model evolution at Adobe",
			"quote": "In 2012, Adobe went from a perpetual licence-based business strategy to a monthly subscription business model",
			"assigned_codes": [
				"Established vendor transition",
				"Subscription-based pricing",
				"Revenue stream transformation"
			],
			"justification": "Marco temporal específico da mudança de modelo de negócio da Adobe."
		},
		{
			"article_id": "190653589",
			"article_title": "Navigating the paradox of global scaling",
			"quote": "We show that globally scaling digital MNEs follow a new-to-the-literature strategy, which we label replicable innovation, to navigate these competing demands and sustain competitiveness.",
			"assigned_codes": [
				"Global market presence",
				"Market expansion",
				"Technology evolution"
			],
			"justification": "Apresenta estratégia de inovação replicável para empresas digitais em escala global."
		},
		{
			"article_id": "190653595",
			"article_title": "Spillover Effects and Freemium Strategy in the Mobile App Market",
			"quote": "Freemium,' whereby a basic service level is provided free of charge but consumers are charged for more advanced features, has become a popular business model for firms selling digital goods.",
			"assigned_codes": [
				"Freemium model",
				"Mobile app market",
				"Consolidated business model"
			],
			"justification": "Define freemium como modelo consolidado e popular no mercado de bens digitais."
		},
		{
			"article_id": "190653734",
			"article_title": "Systematic Literature Review of Monetization in Mobile App",
			"quote": "The phrase \"freemium\" refers to two different versions of a product: a free version with restricted functionality and a complete version that costs money but has more features and capabilities. It is a mix of the terms \"free\" and \"premium\"",
			"assigned_codes": [
				"Freemium model",
				"Mobile app market",
				"Flexible pricing strategies"
			],
			"justification": "Define freemium no contexto de aplicativos móveis com versões diferenciadas."
		},
		{
			"article_id": "190653772",
			"article_title": "Current practices and emerging trends of transit apps",
			"quote": "Based on interviewees' descriptions of how their transit apps were developed and maintained, five business models were identified",
			"assigned_codes": [
				"Mobile app market",
				"B2B business model",
				"Cross-industry applications"
			],
			"justification": "Identifica múltiplos modelos de negócio para aplicativos de transporte público."
		},
		{
			"article_id": "190653856",
			"article_title": "Stuck Inside a Cloud: Do SaaS business models require a rethink",
			"quote": "subscription business models differ from their traditional counterparts. Subscriptions provide vendors with reliable, steady streams of income over predefined periods",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Subscription-based pricing",
				"Revenue stream transformation"
			],
			"justification": "Destaca a diferença fundamental entre modelos de assinatura e tradicionais em termos de fluxo de receita."
		},
		{
			"article_id": "190653872",
			"article_title": "Managing Software-as-a-Service: Pricing and operations",
			"quote": "The National Institute of Standards and Technology (NIST) defines SaaS as the capability provided to the consumer of using the provider's applications running on a cloud infrastructure where the applications are accessible from various client devices and interfaces and the consumer generally does not manage or control the infrastructure.",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Cloud computing infrastructure",
				"On-demand access",
				"Remote hosting"
			],
			"justification": "Definição técnica oficial do NIST para SaaS enfatizando acesso cloud e abstração de infraestrutura."
		},
		{
			"article_id": "190653882",
			"article_title": "Converting free users to paid subscribers in the SaaS context",
			"quote": "Software-as-a-service (SaaS) is a popular business model that centrally hosts and licenses software on a subscription basis. Many software companies such as Microsoft and Salesforce have adopted the SaaS model.",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Subscription-based pricing",
				"Remote hosting",
				"Established vendor transition"
			],
			"justification": "Descreve adoção do SaaS por grandes empresas estabelecidas como Microsoft e Salesforce."
		},
		{
			"article_id": "190653882",
			"article_title": "Converting free users to paid subscribers in the SaaS context",
			"quote": "customers pay a monthly or annual subscription fee that is usually less expensive than the price of a perpetual license",
			"assigned_codes": [
				"Subscription-based pricing",
				"Pay-as-you-go pricing",
				"Low switching costs"
			],
			"justification": "Compara o custo de assinaturas SaaS com licenças perpétuas, destacando economia para clientes."
		},
		{
			"article_id": "190653942",
			"article_title": "Optimal distinctiveness across revenue models",
			"quote": "firms offering free products may also increase transparency by following a \"freemium\" approach, where a base product is provided at no charge in concert with priced product upgrades",
			"assigned_codes": [
				"Freemium model",
				"Mobile app market",
				"Flexible pricing strategies"
			],
			"justification": "Descreve freemium como estratégia de transparência com produto base gratuito e upgrades pagos."
		},
		{
			"article_id": "190653950",
			"article_title": "On top of the game? The double-edged sword of incorporating social features",
			"quote": "The freemium business model —where a firm offers a base product for free and users can pay for premium content and features after they have adopted the base product —has gained widespread popularity on digital platforms",
			"assigned_codes": [
				"Freemium model",
				"Gaming industry focus",
				"Network effects",
				"Consolidated business model"
			],
			"justification": "Destaca a popularidade consolidada do freemium em plataformas digitais, especialmente jogos."
		},
		{
			"article_id": "190653984",
			"article_title": "Toward Building Specialized Information Systems as Software Platforms",
			"quote": "A software platform is a kind of software that creates value through a synergy, by surrounding itself with an ecosystem of external connections, data, and processes. The goal of platform thinking is to build a software platform that is a foundation for a new ecosystem.",
			"assigned_codes": [
				"Platform business model",
				"Network effects",
				"API-based business model"
			],
			"justification": "Define plataforma de software como criadora de valor através de ecossistema de conexões externas."
		},
		{
			"article_id": "190653993",
			"article_title": "Development of service-dominant business model for CAE software industry",
			"quote": "this project develops a service-dominant business model which involves how to integrate significant software features and hardware criteria, how to measure service quality, and what business risks might take place",
			"assigned_codes": [
				"Service-oriented model",
				"Quality management",
				"B2B business model"
			],
			"justification": "Desenvolve modelo orientado a serviço integrando software, hardware e qualidade de serviço."
		},
		{
			"article_id": "190654058",
			"article_title": "MintM: the start-up transforming businesses real-time",
			"quote": "MintM has a business to business (B2B) based model that relies on its own proprietary software to display targeted audio-visual content in stores and supermarkets",
			"assigned_codes": [
				"B2B business model",
				"Data-driven monetization",
				"Startup company focus"
			],
			"justification": "Startup B2B que monetiza através de conteúdo direcionado e análise de dados de clientes."
		},
		{
			"article_id": "190654085",
			"article_title": "Business model innovation in mobile apps market",
			"quote": "subscription-based business model where consumers periodically pay a fee to access a product/service",
			"assigned_codes": [
				"Subscription-based pricing",
				"Mobile app market",
				"B2C business model"
			],
			"justification": "Define modelo de assinatura com pagamento periódico para acesso a catálogo de serviços."
		},
		{
			"article_id": "190654085",
			"article_title": "Business model innovation in mobile apps market",
			"quote": "These subscription-based plans ask users to pay a fee to get access to a catalogue of services (such as movies, songs, books), instead of asking them to pay for each of them one by one",
			"assigned_codes": [
				"Subscription-based pricing",
				"Mobile app market",
				"Flexible pricing strategies"
			],
			"justification": "Descreve mudança de pagamento por item para assinatura de catálogo completo."
		},
		{
			"article_id": "190654186",
			"article_title": "Competition Among Proprietary and Open-Source Software Firms",
			"quote": "This professional open-source business model, where profit-motivated firms are driven by revenues stemming from a market for professional services... characterized by firms that typically generate the bulk of their revenues by providing complementary services around their products",
			"assigned_codes": [
				"Open source business model",
				"Service-oriented model",
				"B2B business model"
			],
			"justification": "Define modelo open source profissional focado em receita de serviços complementares."
		},
		{
			"article_id": "190654465",
			"article_title": "The Business Case for a Journey Planning and Ticketing App",
			"quote": "mobility as a service' (MaaS), which 'aims to combine different transport modes to seamless trips over one user interface'",
			"assigned_codes": [
				"Platform business model",
				"Mobile app market",
				"B2C business model",
				"API-based business model"
			],
			"justification": "MaaS como plataforma que integra múltiplos modos de transporte através de interface única."
		},
		{
			"article_id": "190654531",
			"article_title": "Hypothesis-driven Adaptation of Business Models based on Product Line Engineering",
			"quote": "We call this concept a Business Model Decision Line (BMDL). The BMDL matches business domain knowledge in the form of a feature model with customer needs to derive hypotheses about the business model together with experiments for validation.",
			"assigned_codes": [
				"Hybrid business model",
				"Value-based orientation",
				"Pilot implementation"
			],
			"justification": "Framework que combina conhecimento de domínio com necessidades do cliente para validação de modelos."
		},
		{
			"article_id": "190654542",
			"article_title": "E-business evolution: an analysis of mobile applications' business models",
			"quote": "Wirtz, Schilke, and Ullrich (2010), in recognising the new challenges and opportunities of the new digital era seminally defined four general typologies of business model",
			"assigned_codes": [
				"Mobile app market",
				"B2C business model",
				"B2B business model",
				"Cross-industry applications"
			],
			"justification": "Define quatro tipologias de modelos e-business: content, commerce, context e connection-oriented."
		},
		{
			"article_id": "190654598",
			"article_title": "A Study on Cloud-Based Software Marketing Strategies Using Cloud Marketplace",
			"quote": "Cloud service providers (CSPs) try to build a marketplace where software can be easily used for their customers and try to acquire a wide variety of software developers. Software developers can achieve global sales at lower costs than conventional software distribution methods",
			"assigned_codes": [
				"Marketplace model",
				"Cloud delivery model",
				"Global market presence",
				"Platform business model"
			],
			"justification": "Marketplace em nuvem como plataforma que conecta desenvolvedores e clientes globalmente com baixo custo."
		},
		{
			"article_id": "190654601",
			"article_title": "Software as a service: Lessons from the video game industry",
			"quote": "The provision of multiplayer and standalone games via the internet —essentially a variant of SaaS —has led to the growth of a distinct games-as-a-service (GaaS) business model, where all the software needed to play the game is located on an external server",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Gaming industry focus",
				"Remote hosting",
				"Cloud delivery model"
			],
			"justification": "GaaS como variante de SaaS específica para indústria de jogos com software em servidores externos."
		},
		{
			"article_id": "190654601",
			"article_title": "Software as a service: Lessons from the video game industry",
			"quote": "With the GaaS model, they can update a game on the fly —that is, release as many updates as they want, whenever they want —allowing all players to receive them as soon as they connect to the server.",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Gaming industry focus",
				"Single-version deployment",
				"Service quality improvement"
			],
			"justification": "GaaS permite atualizações contínuas instantâneas para todos os jogadores, melhorando qualidade."
		},
		{
			"article_id": "190654605",
			"article_title": "The SaaS Payoff",
			"quote": "SaaS has facilitated (1) the provision of virtualised SaaS-based solutions from a centralised location which possess the capability to automatically scale-up and down dynamically based on the demand for computational resources",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Cloud computing infrastructure",
				"Economies of scale",
				"On-demand access"
			],
			"justification": "Destaca capacidade de escalonamento dinâmico do SaaS baseado em demanda de recursos."
		},
		{
			"article_id": "190654664",
			"article_title": "Searching for synergy from a combination of heterogeneous business models",
			"quote": "Based on interviews with company representatives, as well as consultations with Polish software industry experts, we have found 40 key variables which are characteristic for business models of resellers and integrators.",
			"assigned_codes": [
				"Hybrid business model",
				"B2B business model",
				"Cross-industry applications"
			],
			"justification": "Estudo sobre sinergia entre modelos heterogêneos: integrador e revendedor com valor agregado."
		},
		{
			"article_id": "190654709",
			"article_title": "Business Models for Emerging Technologies: The Case of Affective Computing",
			"quote": "This paper explores the key features of disruptive business models in the affective computing industry",
			"assigned_codes": [
				"Emerging business model",
				"SaaS (Software as a Service)",
				"API-based business model",
				"Technology evolution"
			],
			"justification": "Explora modelos disruptivos para tecnologia emergente de computação afetiva via SaaS e APIs."
		},
		{
			"article_id": "190654717",
			"article_title": "Economics of open source library software",
			"quote": "Open-source software (OSS) is a new way of developing software, which is primarily developed by the users and for the users.",
			"assigned_codes": ["Open source business model", "Network effects"],
			"justification": "Define OSS como desenvolvimento colaborativo pelos e para os usuários."
		},
		{
			"article_id": "190654717",
			"article_title": "Economics of open source library software",
			"quote": "OSS espouses a philosophy where collaborative development and sharing are inextricably intertwined... the OSS movement took off through the activity of a community that did not follow profit motivations, but it is based on altruism.",
			"assigned_codes": ["Open source business model", "Ecosystem management"],
			"justification": "Descreve filosofia OSS baseada em altruísmo e desenvolvimento colaborativo não-lucrativo."
		},
		{
			"article_id": "190654720",
			"article_title": "Making a Business Out of Predictive Application Management in the Fog",
			"quote": "Asset Manufacturers should pay yearly license fees (Revenue Streams) to access the predictive application management service and to include it in their ecosystems",
			"assigned_codes": [
				"Subscription-based pricing",
				"B2B business model",
				"API-based business model"
			],
			"justification": "Modelo baseado em licenças anuais para fabricantes integrarem serviços em seus ecossistemas."
		},
		{
			"article_id": "190654720",
			"article_title": "Making a Business Out of Predictive Application Management in the Fog",
			"quote": "freemium models require the costs of non-paying customers to be covered by another part of the business model or by another Customer Segment. We, therefore, split Application Operators into two segments, i.e. free and subscribing customers.",
			"assigned_codes": [
				"Freemium model",
				"Flexible pricing strategies",
				"B2B business model"
			],
			"justification": "Implementação freemium B2B com segmentação entre clientes gratuitos e pagantes."
		},
		{
			"article_id": "190654834",
			"article_title": "Synergies between App-Based Car-Related Shared Mobility Services",
			"quote": "These new mobility business models have changed the urban mobility sector from a limited transportation offer to a scenario full of new players offering mobility-on-demand in different ways.",
			"assigned_codes": [
				"Mobile app market",
				"Platform business model",
				"On-demand access",
				"Digital transformation"
			],
			"justification": "Modelos de mobilidade sob demanda transformando digitalmente o setor de transporte urbano."
		},
		{
			"article_id": "190654956",
			"article_title": "Open source ERP business model framework",
			"quote": "Some smaller vendors utilized a free distribution system (Free/Open Source ERP, FOS-ERP) for their source code, relying on various business models for corporate success.",
			"assigned_codes": [
				"Open source business model",
				"Service-oriented model",
				"SME market focus"
			],
			"justification": "Pequenos fornecedores usam distribuição open source gerando receita via serviços."
		},
		{
			"article_id": "190655012",
			"article_title": "Analysis of Freemium Business Model Considering Network Externalities",
			"quote": "An emerging business model increasingly used by companies in the online software market is to provide both a free basic version and a paid premium version for a service or a product to customers.",
			"assigned_codes": [
				"Freemium model",
				"Network effects",
				"Growing business model"
			],
			"justification": "Freemium como modelo emergente em crescimento considerando efeitos de rede."
		},
		{
			"article_id": "190655012",
			"article_title": "Analysis of Freemium Business Model Considering Network Externalities",
			"quote": "The existence of the free version can reduce the customer uncertainty regarding the evaluation of the commercial software and make use of network effect to improve the firm's profit.",
			"assigned_codes": [
				"Freemium model",
				"Network effects",
				"Low switching costs"
			],
			"justification": "Versão gratuita reduz incerteza do cliente e potencializa efeitos de rede para aumentar lucro."
		},
		{
			"article_id": "190655172",
			"article_title": "Investigating e-business models' value retention for start-ups",
			"quote": "Four different themes in e-business models are classified by Amit and Zott (2001): novelty-centred business model referring to novel ways of conducting economic exchanges among various participants; efficiency-centred business model referring to means of gaining transaction efficiency",
			"assigned_codes": [
				"Startup company focus",
				"Digital transformation",
				"B2C business model"
			],
			"justification": "Classifica modelos e-business para startups em quatro temas: novidade, eficiência, lock-in e complementaridade."
		},
		{
			"article_id": "190655172",
			"article_title": "Investigating e-business models' value retention for start-ups",
			"quote": "lock-in-centred business model concerning the means to retain engagement with existing transaction partners by creating switching costs or incentives",
			"assigned_codes": [
				"High switching costs",
				"Network effects",
				"Startup company focus"
			],
			"justification": "Modelo focado em criar custos de troca ou incentivos para reter parceiros de transação."
		},
		{
			"article_id": "190655181",
			"article_title": "Growth of a platform business model as an entrepreneurial ecosystem",
			"quote": "Platforms provide architectures to combine internal and external innovations in ways that create value throughout the chain of activities that deliver useful technology to the market",
			"assigned_codes": [
				"Platform business model",
				"Network effects",
				"Ecosystem management",
				"Value-based orientation"
			],
			"justification": "Plataformas como arquiteturas que combinam inovações internas e externas criando valor no ecossistema."
		},
		{
			"article_id": "190655186",
			"article_title": "Developing enterprise social software in China",
			"quote": "according to the industry classification, Mingdao provides cloud computing services... The new Mingdao platform will also be a standard SaaS.",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Enterprise market focus",
				"Cloud delivery model",
				"B2B business model"
			],
			"justification": "Plataforma SaaS para colaboração social empresarial no mercado chinês."
		},
		{
			"article_id": "190655190",
			"article_title": "Open source - Is it an alternative to intellectual property?",
			"quote": "In open source, a community of individuals makes contributions to a body of knowledge, sets up peer-review systems for quality control and then nurtures and nourishes that body of knowledge",
			"assigned_codes": [
				"Open source business model",
				"Ecosystem management",
				"Quality management"
			],
			"justification": "Descreve modelo open source como comunidade colaborativa com controle de qualidade por pares."
		},
		{
			"article_id": "190655190",
			"article_title": "Open source - Is it an alternative to intellectual property?",
			"quote": "Companies that rely on \"reciprocal licenses\", based on copyleft will have their revenues coming from professional services...\"Academic licenses\", on the other hand, enable companies to generate revenue from both licensing and professional services",
			"assigned_codes": [
				"Open source business model",
				"Service-oriented model",
				"Hybrid business model"
			],
			"justification": "Diferentes modelos de licenciamento open source: recíproco (serviços), acadêmico (licenças + serviços), e dual."
		},
		{
			"article_id": "190655198",
			"article_title": "Difficult Business Models of Digital Business Platforms for Health Data",
			"quote": "Multi-sided platforms bring together two or more distinct but interdependent groups of customers and create value by facilitating interactions between the different groups",
			"assigned_codes": [
				"Platform business model",
				"Healthcare technology",
				"Network effects",
				"B2B business model"
			],
			"justification": "Plataforma multi-sided para saúde conectando grupos interdependentes de clientes."
		},
		{
			"article_id": "190655206",
			"article_title": "Onboarding customer companies to electronic invoicing platform",
			"quote": "The service provider model is embraced when supplier or buyer wishes to buy e-invoice issuing or receiving from a professional third party... The service provider manages the e-invoice transfer process",
			"assigned_codes": [
				"Platform business model",
				"B2B business model",
				"Service-oriented model",
				"API-based business model"
			],
			"justification": "Modelo de plataforma de terceiros gerenciando transferência de e-invoices entre partes."
		},
		{
			"article_id": "190655218",
			"article_title": "How Service Offerings and Operational Maturity Influence the Viability of HIEs",
			"quote": "Health information exchanges (HIEs) are new organizational forms in the United States that facilitate digital exchange of health data across participants. Many believe that these multi-sided digital platforms will become key enablers of the digital transformation of healthcare",
			"assigned_codes": [
				"Platform business model",
				"Healthcare technology",
				"Digital transformation",
				"B2B business model"
			],
			"justification": "HIEs como plataformas multi-sided habilitando transformação digital da saúde nos EUA."
		},
		{
			"article_id": "190655219",
			"article_title": "Mobile ticketing services in the Northern Europe",
			"quote": "Started as SMS ticketing, today, mobile ticketing services become a platform for combined mobility solutions that integrate mobile ticketing, bike renting, car sharing, and parking payment services",
			"assigned_codes": [
				"Platform business model",
				"Mobile app market",
				"B2C business model",
				"Technology evolution"
			],
			"justification": "Evolução de ticketing móvel para plataforma integrando múltiplos serviços de mobilidade."
		},
		{
			"article_id": "190655247",
			"article_title": "The effect of free sampling strategies on freemium conversion rates",
			"quote": "Freemium describes business models where firms offer a service or a product for free, but a fee is charged for a premium version that entails advanced features, functionality or less disturbance (i.e., advertising)",
			"assigned_codes": [
				"Freemium model",
				"Flexible pricing strategies",
				"B2C business model"
			],
			"justification": "Define freemium com versão gratuita e premium com recursos avançados ou sem anúncios."
		},
		{
			"article_id": "190655350",
			"article_title": "Give Away Your Digital Services: Leveraging Big Data to Capture Value",
			"quote": "New models that capture the value embedded in the data generated by digital services may make it viable for companies to offer those services for free",
			"assigned_codes": [
				"Data-driven monetization",
				"Freemium model",
				"Platform business model"
			],
			"justification": "Modelo onde serviços gratuitos são viabilizados pela monetização de dados dos usuários."
		},
		{
			"article_id": "190655350",
			"article_title": "Give Away Your Digital Services: Leveraging Big Data to Capture Value",
			"quote": "Our analysis suggested three possible strategies for leveraging big data, which we've called enhanced advertising, e-ethnography, and data trading",
			"assigned_codes": [
				"Data-driven monetization",
				"B2C business model",
				"Platform business model"
			],
			"justification": "Três estratégias de captura de valor através de big data: publicidade, etnografia digital e venda de dados."
		},
		{
			"article_id": "190655362",
			"article_title": "Making Digital Freemium Business Models a Success",
			"quote": "In recent years, freemium has become the dominant pricing strategy for software, games, and social network apps",
			"assigned_codes": [
				"Freemium model",
				"Consolidated business model",
				"Mobile app market",
				"Gaming industry focus"
			],
			"justification": "Freemium como estratégia dominante consolidada em software, jogos e redes sociais."
		},
		{
			"article_id": "190655362",
			"article_title": "Making Digital Freemium Business Models a Success",
			"quote": "It allows companies to suppress entry barriers and thus to attract a much larger audience than paid services do. However, only a minority of such users actually become paying customers.",
			"assigned_codes": [
				"Freemium model",
				"Low switching costs",
				"Network effects"
			],
			"justification": "Freemium reduz barreiras de entrada atraindo grande audiência, mas poucos convertem para pagantes."
		},
		{
			"article_id": "190655382",
			"article_title": "Understanding the influence of absorptive capacity and ambidexterity",
			"quote": "Around 15% of the global cloud-computing market comprises Software as a Service (SaaS), an on-demand software delivery service that offers ubiquitous access to applications and shares a pool of common resources managed by SaaS providers",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Cloud computing infrastructure",
				"On-demand access",
				"Growing business model"
			],
			"justification": "SaaS como segmento crescente representando 15% do mercado global de cloud computing."
		},
		{
			"article_id": "190655382",
			"article_title": "Understanding the influence of absorptive capacity and ambidexterity",
			"quote": "Because services are provided on a pay-per-use basis, SaaS allows for the shifting of capital expenditures to operational expenditures.",
			"assigned_codes": [
				"Pay-as-you-go pricing",
				"SaaS (Software as a Service)",
				"Revenue stream transformation"
			],
			"justification": "SaaS transforma CapEx em OpEx através de modelo pay-per-use."
		},
		{
			"article_id": "190655386",
			"article_title": "Transition to the Cloud: A Vendor Perspective",
			"quote": "The National Institute of Standards and Technology (NIST) defines cloud computing as \"a model for enabling convenient, on-demand network access to a shared pool of configurable computing resources\"",
			"assigned_codes": [
				"Cloud computing infrastructure",
				"On-demand access",
				"Cloud delivery model"
			],
			"justification": "Definição NIST de cloud computing enfatizando acesso sob demanda a recursos compartilhados."
		},
		{
			"article_id": "190655389",
			"article_title": "Business models and opportunity creation",
			"quote": "The case firm, G-cluster, develops interactive cloud gaming platforms and games-on-demand services... In the G-cluster business model, by contrast, games are run on a cloud platform.",
			"assigned_codes": [
				"Gaming industry focus",
				"Cloud delivery model",
				"SaaS (Software as a Service)",
				"Startup company focus"
			],
			"justification": "Startup de cloud gaming executando jogos em plataforma cloud ao invés de dispositivos locais."
		},
		{
			"article_id": "190655397",
			"article_title": "Revenue models, in-app purchase, and the app performance",
			"quote": "We can identify at least three main models utilized by developers in the app stores. First, some developers adopt a free app strategy... Second, other developers market only paid apps... Finally, some other developers combine \"free\" and \"paid\" models",
			"assigned_codes": [
				"Mobile app market",
				"Freemium model",
				"Flexible pricing strategies",
				"Data-driven monetization"
			],
			"justification": "Três modelos principais em app stores: gratuito (ads/dados), pago, e freemium."
		},
		{
			"article_id": "190655417",
			"article_title": "Commercialization of Composite Software Resulting from Collaborative Research",
			"quote": "Thus, flexible business models are required that are based on loose partnerships among involved companies, but still enable a common presence on the market",
			"assigned_codes": [
				"Platform business model",
				"Ecosystem management",
				"B2B business model",
				"API-based business model"
			],
			"justification": "Modelo flexível baseado em parcerias frouxas entre provedores de software complementar."
		},
		{
			"article_id": "190655425",
			"article_title": "Adjusting software revenue and pricing strategies in the era of cloud computing",
			"quote": "Thus, instead of selling software licenses, software vendors can rent software as a service to customers",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Subscription-based pricing",
				"Revenue stream transformation"
			],
			"justification": "Mudança de venda de licenças para aluguel de software como serviço."
		},
		{
			"article_id": "190655425",
			"article_title": "Adjusting software revenue and pricing strategies in the era of cloud computing",
			"quote": "In the SaaS model, software is delivered as a service and used over the Internet",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Cloud delivery model",
				"Remote hosting",
				"Internet connectivity requirement"
			],
			"justification": "SaaS como entrega de software via Internet requerendo conectividade."
		},
		{
			"article_id": "190655440",
			"article_title": "Designing business models for cloud platforms",
			"quote": "Platform as a service (PaaS) has become a strategic option for software vendors who expect to benefit from value co-creation with partners by developing complementary components and applications",
			"assigned_codes": [
				"Platform business model",
				"Cloud delivery model",
				"Ecosystem management",
				"API-based business model"
			],
			"justification": "PaaS como plataforma estratégica para co-criação de valor com parceiros desenvolvendo componentes complementares."
		},
		{
			"article_id": "190655451",
			"article_title": "Business Models for Cloud Computing: Experiences from MSaaS",
			"quote": "Modeling & Simulation as a Service (MSaaS) therefore enables simulation software vendors and providers to offer simulation applications through the cloud to their end-users. The user can consume simulation services without having to install or maintain the simulation software locally.",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Cloud delivery model",
				"B2B business model",
				"Economies of scale"
			],
			"justification": "MSaaS como aplicação específica de SaaS para simulação, eliminando instalação/manutenção local."
		},
		{
			"article_id": "190655528",
			"article_title": "A Study on a Decentralized SaaS Business Model",
			"quote": "We propose a decentralized SaaS (Software as a Service) business model and compare it with a common centralized model in cloud computing... In this case, local servers are competing with each other to maximize their own profit",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Multi-instance architecture",
				"Emerging business model"
			],
			"justification": "Modelo descentralizado de SaaS com servidores locais independentes competindo entre si."
		},
		{
			"article_id": "190655555",
			"article_title": "Selection of the Proper Revenue and Pricing Model for SaaS",
			"quote": "Recent research on software revenue and pricing models has revealed important ways in which firms can benefit from software renting. However, it is still unclear how SaaS providers select a proper revenue and pricing model",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Flexible pricing strategies",
				"Subscription-based pricing"
			],
			"justification": "Pesquisa sobre seleção de modelos de receita e precificação apropriados para provedores SaaS."
		},
		{
			"article_id": "190655589",
			"article_title": "Service-Centric Business Model in Cloud Environment",
			"quote": "Cloud Business Model (short for CBM) is the cloud enabled BM which describes the relatively stable logics of enterprises to do their business to create value for both customers and themselves in the new business ecosystems based on cloud environment.",
			"assigned_codes": [
				"Service-oriented model",
				"Cloud delivery model",
				"Value-based orientation",
				"Ecosystem management"
			],
			"justification": "Modelo centrado em serviço habilitado por cloud focando criação de valor no ecossistema."
		},
		{
			"article_id": "190655614",
			"article_title": "Designing Viable Multi-sided Data Platforms",
			"quote": "Advances in data semantification and natural language querying are enabling new generations of context-aware mobile applications. Such applications would rely on platforms that integrate heterogeneous sets of user data from a range of applications and systems.",
			"assigned_codes": [
				"Platform business model",
				"Data-driven monetization",
				"Mobile app market",
				"API-based business model"
			],
			"justification": "Plataforma multi-sided integrando dados heterogêneos para aplicações móveis context-aware."
		},
		{
			"article_id": "190655631",
			"article_title": "Economic and business perspectives on smartphones as multi-sided platforms",
			"quote": "We interpret mobile operating systems such as iOS and Android as multi-sided platforms that serve a variety of \"customers,\" including consumers (users), handset makers, network operators, app developers, advertisers, and chip manufacturers.",
			"assigned_codes": [
				"Platform business model",
				"Mobile app market",
				"Network effects",
				"Marketplace model"
			],
			"justification": "Sistemas operacionais móveis como plataformas multi-sided servindo múltiplos tipos de clientes."
		},
		{
			"article_id": "190655648",
			"article_title": "Crushing Candy: The Free-to-Play Game in Its Connective Commodity Form",
			"quote": "Rather than drawing on the traditional paid-for or \"premium\" revenue model and charging an upfront fee per game, King derived its 2013 profits primarily via optional virtual consumption.",
			"assigned_codes": [
				"Freemium model",
				"Gaming industry focus",
				"B2C business model",
				"Data-driven monetization"
			],
			"justification": "Modelo free-to-play de jogos gerando receita através de consumo virtual opcional."
		},
		{
			"article_id": "190655698",
			"article_title": "Effects of Freemium Strategy in the Mobile App Market",
			"quote": "Freemium, a combination of the words \"free\" and \"premium,\" is a business model by which a service or a product is offered free of charge, but a premium is charged for advanced features, functionality, or related products and services",
			"assigned_codes": [
				"Freemium model",
				"Mobile app market",
				"Flexible pricing strategies"
			],
			"justification": "Define freemium no mercado de apps móveis cobrando por recursos avançados."
		},
		{
			"article_id": "190655702",
			"article_title": "Network Externalities, Incumbent's Competitive Advantage",
			"quote": "we derive the necessary condition(s) in terms of the strength of network externalities for observing the adoption of a business model that comprises the offering of both proprietary and OS solutions by the entrant (i.e., hybrid business model)",
			"assigned_codes": [
				"Hybrid business model",
				"Open source business model",
				"Network effects",
				"Startup company focus"
			],
			"justification": "Modelo híbrido combinando soluções proprietárias e open source considerando externalidades de rede."
		},
		{
			"article_id": "190655721",
			"article_title": "A Pricing Framework for Software-as-a-Service",
			"quote": "Software-as-a-Service (SaaS), \"software deployed as a hosted service and accessed over the Internet,\" is an emerging business model that is expected to grow rapidly",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Emerging business model",
				"Future growth potential",
				"Cloud delivery model"
			],
			"justification": "SaaS como modelo emergente com expectativa de crescimento rápido."
		},
		{
			"article_id": "190655747",
			"article_title": "Clarifying the Value Elements of Business Models for Disturbance Management",
			"quote": "The new service is a database-based service solution that aims to provide a tool for companies to analyze and manage transport disturbances... The solution is planned to work with Software as a Service (SaaS) principles",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"B2B business model",
				"Cloud delivery model",
				"Service-oriented model"
			],
			"justification": "Solução SaaS B2B para gerenciamento de distúrbios em supply chain."
		},
		{
			"article_id": "190655750",
			"article_title": "The Impact of Open Source Software Commercialization on Firm Value",
			"quote": "Vendors of proprietary software products are increasingly moving to business models inspired by open source software (OSS). This study investigates sources of heterogeneity in value appropriation associated with commercializing OSS.",
			"assigned_codes": [
				"Open source business model",
				"Hybrid business model",
				"Established vendor transition",
				"Service-oriented model"
			],
			"justification": "Fornecedores proprietários transitando para modelos inspirados em OSS, comercializando através de serviços."
		},
		{
			"article_id": "190655785",
			"article_title": "The relationship between Open Innovation and Strategy",
			"quote": "Open innovation was originally defined as \"a model allowing the commercialization of both the ideas of a company as well as ideas coming from other firms\"",
			"assigned_codes": [
				"Open source business model",
				"Platform business model",
				"Ecosystem management"
			],
			"justification": "Open innovation como modelo permitindo comercialização de ideias próprias e de terceiros."
		},
		{
			"article_id": "190655819",
			"article_title": "Open-Source Software Entrepreneurial Business Modelling",
			"quote": "Built on top of established business modelling frameworks, the Open-Source Software Entrepreneurial Business Modelling (OSS_EBM) can be a useful strategic management and entrepreneurial tool.",
			"assigned_codes": [
				"Open source business model",
				"Startup company focus",
				"Value-based orientation"
			],
			"justification": "Framework de modelagem de negócios específico para empreendimentos open source."
		},
		{
			"article_id": "190655845",
			"article_title": "Towards a better Understanding of the Dynamics of PaaS Business Models",
			"quote": "Platform as a Service. Platforms in the software industry are defined as \"… the extensible codebase of a software-based system that provides core functionality shared by the modules that interoperate with it\"",
			"assigned_codes": [
				"Platform business model",
				"Cloud delivery model",
				"API-based business model",
				"Ecosystem management"
			],
			"justification": "PaaS como plataforma extensível fornecendo funcionalidade core compartilhada para módulos interoperáveis."
		}
	]
}
