{
	"qualitative_analysis": [
		{
			"article_id": "190638760",
			"article_title": "A Pricing Framework for Software-as-a-Service",
			"quote": "Whereas some clients may exhibit low-breadth but high-depth usage (i.e., low frequency of service usage but complicated software modules required), others may register the opposite usage pattern (i.e., high frequency of service usage but simple software modules required) or demand access to required services at odd times or from obscure locations",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Pay-as-you-go pricing",
				"Cross-industry applications"
			],
			"justification": "O texto descreve diferentes padrões de uso de clientes SaaS com necessidades variadas de módulos e frequência de acesso, indicando um modelo de precificação baseado em uso e aplicável a diversos tipos de clientes."
		},
		{
			"article_id": "190638781",
			"article_title": "Selection of the Proper Revenue and Pricing Model for SaaS",
			"quote": "within the first six months we realized that this does not work with smaller customers who do not have servers in the firm. It became clear that 90 percent of our customers wanted to use this through a public cloud",
			"assigned_codes": [
				"SME market focus",
				"Cloud delivery model",
				"SaaS (Software as a Service)"
			],
			"justification": "O texto descreve a necessidade de pequenos e médios clientes sem infraestrutura de servidores própria, indicando foco no mercado SME com entrega via nuvem pública."
		},
		{
			"article_id": "190638781",
			"article_title": "Selection of the Proper Revenue and Pricing Model for SaaS",
			"quote": "Low initial costs in software renting enabled to expand the customer base from large-sized customers toward small and medium-sized customers",
			"assigned_codes": [
				"SME market focus",
				"Market expansion",
				"Subscription-based pricing"
			],
			"justification": "O texto demonstra estratégia de expansão de mercado de grandes empresas para PMEs através de custos iniciais reduzidos em modelo de aluguel de software."
		},
		{
			"article_id": "190638781",
			"article_title": "Selection of the Proper Revenue and Pricing Model for SaaS",
			"quote": "customers who had already invested in IT infrastructure and their own IT personnel, they saw traditional software licensing as a more attractive choice",
			"assigned_codes": [
				"Enterprise market focus",
				"Perpetual licensing",
				"Hybrid business model"
			],
			"justification": "O texto descreve clientes empresariais com infraestrutura de TI estabelecida que preferem licenciamento tradicional, indicando um mercado empresarial com modelo híbrido."
		},
		{
			"article_id": "190638871",
			"article_title": "Transition to the Cloud: A Vendor Perspective",
			"quote": "The second segment is small and medium size business with less than 1000 employees, where ERP Co works closely with their partners, all what they refer to as value added resellers",
			"assigned_codes": [
				"SME market focus",
				"B2B business model",
				"Ecosystem management"
			],
			"justification": "O texto descreve foco específico em pequenas e médias empresas atendidas através de parceiros revendedores de valor agregado, demonstrando modelo B2B com gestão de ecossistema."
		},
		{
			"article_id": "190638871",
			"article_title": "Transition to the Cloud: A Vendor Perspective",
			"quote": "VAR is a critical part of ERP Co's business ecosystem, as they are in direct charge of selling to the largest customer segment, the small and medium size businesses",
			"assigned_codes": [
				"SME market focus",
				"Ecosystem management",
				"Market expansion"
			],
			"justification": "O texto enfatiza a importância dos revendedores de valor agregado para alcançar o maior segmento de clientes (PMEs), demonstrando estratégia de expansão de mercado através de ecossistema de parceiros."
		},
		{
			"article_id": "190653396",
			"article_title": "Digital sustainable business models: Using digital technology to integrate ecological sustainability into the core of business models",
			"quote": "The information provided by the platform enables investors to make ecological investment decisions, but Arabesque also helps rated companies analyse their performance relative to their peers",
			"assigned_codes": [
				"Platform business model",
				"Sustainability focus",
				"B2B business model",
				"Data-driven monetization"
			],
			"justification": "O texto descreve uma plataforma que serve tanto investidores quanto empresas com foco em sustentabilidade, usando dados para criar valor em um modelo B2B."
		},
		{
			"article_id": "190653396",
			"article_title": "Digital sustainable business models: Using digital technology to integrate ecological sustainability into the core of business models",
			"quote": "digital platforms for their partners, such as restaurants, supermarkets, or hotels, to sell surplus food that would otherwise go to waste to individuals at reduced prices",
			"assigned_codes": [
				"Platform business model",
				"Marketplace model",
				"Sustainability focus",
				"B2C business model"
			],
			"justification": "O texto descreve um marketplace digital que conecta estabelecimentos comerciais com consumidores finais para venda de excedentes alimentares, integrando sustentabilidade em modelo B2C."
		},
		{
			"article_id": "190653434",
			"article_title": "When does a freemium business model lead to high performance? — A qualitative comparative analysis based on fuzzy Sets",
			"quote": "The success mode of the freemium business model lies in a small percentage of freemium users spending money on premium upgrades, and there are significant differences in the amount of money spent by freemium users",
			"assigned_codes": [
				"Freemium model",
				"B2C business model",
				"Network effects"
			],
			"justification": "O texto descreve o modelo freemium focado em conversão de usuários gratuitos para premium, típico de modelos B2C com efeitos de rede."
		},
		{
			"article_id": "190653434",
			"article_title": "When does a freemium business model lead to high performance? — A qualitative comparative analysis based on fuzzy Sets",
			"quote": "firms traded off between increasing the number of paying subscribers to gain subscription revenue and increasing the number of basic subscribers to gain advertising sponsorship revenue",
			"assigned_codes": [
				"Freemium model",
				"Subscription-based pricing",
				"Data-driven monetization"
			],
			"justification": "O texto demonstra estratégia de monetização dual no modelo freemium: receita de assinaturas e receita de publicidade, caracterizando monetização baseada em dados."
		},
		{
			"article_id": "190653582",
			"article_title": "Strategy and business model evolution at Adobe: Competing in digital media software industry",
			"quote": "The professional category includes animators, editors and video recording/mixing professionals who use software applications to derive their primary income directly",
			"assigned_codes": [
				"B2C business model",
				"Subscription-based pricing",
				"Cross-industry applications"
			],
			"justification": "O texto descreve profissionais criativos como segmento-alvo que dependem do software para sua renda, indicando modelo B2C com aplicações cross-industry."
		},
		{
			"article_id": "190653589",
			"article_title": "Navigating the paradox of global scaling",
			"quote": "sales and service transactions are complex. Customers buy only the functionality they require, rather than a single uniform product version",
			"assigned_codes": [
				"Enterprise market focus",
				"B2B business model",
				"Value-based pricing"
			],
			"justification": "O texto descreve transações complexas e personalizadas típicas do mercado empresarial, com precificação baseada em funcionalidades específicas requeridas."
		},
		{
			"article_id": "190653589",
			"article_title": "Navigating the paradox of global scaling",
			"quote": "the greater emphasis on personal relationships in sales processes when pursuing opportunities with large corporate clients",
			"assigned_codes": [
				"Enterprise market focus",
				"B2B business model",
				"Service-oriented model"
			],
			"justification": "O texto enfatiza relacionamentos pessoais em vendas para grandes clientes corporativos, característica de modelos B2B empresariais orientados a serviço."
		},
		{
			"article_id": "190653595",
			"article_title": "Spillover Effects and Freemium Strategy in the Mobile App Market",
			"quote": "We focus on game apps as it is the most popular category in App Store and purchases tend to be for personal use instead of business purposes",
			"assigned_codes": [
				"Gaming industry focus",
				"Mobile app market",
				"B2C business model",
				"Freemium model"
			],
			"justification": "O texto identifica aplicativos de jogos para uso pessoal como foco, caracterizando mercado de apps móveis com modelo freemium B2C na indústria de games."
		},
		{
			"article_id": "190653734",
			"article_title": "Systematic Literature Review of Monetization in Mobile App: Strategies, Trends, Challenges, and Best Practices",
			"quote": "Among users, free applications are highly favored, primarily due to their zero-cost nature. The presence of free users in the freemium landscape is crucial as it contributes to the overall success of the strategy",
			"assigned_codes": [
				"Freemium model",
				"Mobile app market",
				"B2C business model",
				"Network effects"
			],
			"justification": "O texto descreve a preferência por aplicativos gratuitos e a importância dos usuários gratuitos no modelo freemium de apps móveis, indicando efeitos de rede em modelo B2C."
		},
		{
			"article_id": "190653772",
			"article_title": "Current practices and emerging trends of transit apps for fixed-route bus services in the US",
			"quote": "transit agencies that have developed and operated an official transit app that serves their bus riders",
			"assigned_codes": [
				"B2C business model",
				"Mobile app market",
				"USA-dominant market"
			],
			"justification": "O texto descreve agências de transporte público nos EUA desenvolvendo apps para passageiros, caracterizando modelo B2C no mercado de apps móveis americano."
		},
		{
			"article_id": "190653856",
			"article_title": "Stuck Inside a Cloud: Do SaaS business models require a rethink of the traditional approach to public market valuation?",
			"quote": "20 publicly traded SaaS companies. market participants seem to favour this form of company. SaaS companies have experienced a remarkable rise in stock market valuations",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Established vendor transition",
				"Global market presence"
			],
			"justification": "O texto descreve empresas SaaS publicamente negociadas com valorização crescente no mercado, indicando transição de fornecedores estabelecidos com presença global."
		},
		{
			"article_id": "190653872",
			"article_title": "Managing Software-as-a-Service: Pricing and operations",
			"quote": "Apple Music charged a $9.99/month subscription fee for an individual user and $14.99/month for a family (up to six family members)",
			"assigned_codes": [
				"B2C business model",
				"Subscription-based pricing",
				"SaaS (Software as a Service)"
			],
			"justification": "O texto exemplifica modelo de assinatura B2C no SaaS com precificação diferenciada por tipo de usuário (individual vs. família)."
		},
		{
			"article_id": "190653872",
			"article_title": "Managing Software-as-a-Service: Pricing and operations",
			"quote": "Benlian and Hess (2011) analyze a survey of 349 German IT executives and find that cost advantages affect perceptions of SaaS opportunities heavily",
			"assigned_codes": [
				"Enterprise market focus",
				"B2B business model",
				"SaaS (Software as a Service)",
				"Value-based pricing"
			],
			"justification": "O texto descreve executivos de TI avaliando vantagens de custo do SaaS, caracterizando mercado empresarial B2B com precificação baseada em valor percebido."
		},
		{
			"article_id": "190653872",
			"article_title": "Managing Software-as-a-Service: Pricing and operations",
			"quote": "23% of small and medium businesses surveyed said the per-hour cost of IT system-related downtime for their business was more than $40,001",
			"assigned_codes": [
				"SME market focus",
				"B2B business model",
				"Value-based pricing"
			],
			"justification": "O texto apresenta dados sobre PMEs e custos de downtime, demonstrando foco no mercado SME B2B com considerações de valor baseado em custos operacionais."
		},
		{
			"article_id": "190653882",
			"article_title": "Converting free users to paid subscribers in the SaaS context: The impact of marketing touchpoints, message content, and usage",
			"quote": "free-trial acquisition, which allows prospective consumers to explore the service at no charge",
			"assigned_codes": [
				"Freemium model",
				"SaaS (Software as a Service)",
				"B2C business model"
			],
			"justification": "O texto descreve estratégia de trial gratuito para converter prospects em clientes pagantes, típico de modelo freemium SaaS B2C."
		},
		{
			"article_id": "190653942",
			"article_title": "Optimal distinctiveness across revenue models: Performance effects of differentiation of paid and free products in a mobile app market",
			"quote": "Customers are naturally skeptical of products offered at no charge, especially in digital contexts where privacy is an increasingly important concern among consumers",
			"assigned_codes": [
				"Mobile app market",
				"Freemium model",
				"B2C business model",
				"Security concerns"
			],
			"justification": "O texto aborda preocupações de consumidores com privacidade em apps gratuitos, destacando desafios de segurança no modelo freemium B2C de apps móveis."
		},
		{
			"article_id": "190653950",
			"article_title": "On top of the game? The double-edged sword of incorporating social features into freemium products",
			"quote": "We explore this question by analyzing a sample of 9,700 products released between 2011 and 2016 on Steam; the market-leading distribution platform for digital PC games",
			"assigned_codes": [
				"Gaming industry focus",
				"Platform business model",
				"Freemium model",
				"B2C business model"
			],
			"justification": "O texto descreve análise de produtos de jogos digitais na plataforma Steam, caracterizando mercado de games com modelo freemium B2C em plataforma."
		},
		{
			"article_id": "190653984",
			"article_title": "Toward Building Specialized Information Systems as Software Platforms",
			"quote": "A specialized information system (SIS) is a type of information system that is designed to support a specific business or organization",
			"assigned_codes": [
				"B2B business model",
				"Platform business model",
				"Enterprise market focus"
			],
			"justification": "O texto descreve sistemas de informação especializados para organizações específicas, caracterizando modelo B2B de plataforma para mercado empresarial."
		},
		{
			"article_id": "190653993",
			"article_title": "Development of service-dominant business model for CAE software industry in Greater China: a case study",
			"quote": "If heavy users require daily analysis. tool builders are not willing to adopt public cloud services",
			"assigned_codes": [
				"B2B business model",
				"Enterprise market focus",
				"Pay-as-you-go pricing",
				"Hybrid business model"
			],
			"justification": "O texto descreve usuários intensivos e construtores de ferramentas com necessidades específicas, indicando mercado empresarial B2B com modelo híbrido de precificação."
		},
		{
			"article_id": "190654058",
			"article_title": "MintM: the start-up transforming businesses real-time",
			"quote": "formidable brands such as Abbbot, ITC, Nestlé, Nivea, Pepsico, Reliance, Tata Group etc. especially in FMCG domain where last level connect would instantly translate into sales",
			"assigned_codes": [
				"Enterprise market focus",
				"B2B business model",
				"Cross-industry applications"
			],
			"justification": "O texto lista grandes marcas globais no setor FMCG como clientes, caracterizando mercado empresarial B2B com aplicações cross-industry."
		},
		{
			"article_id": "190654085",
			"article_title": "Business model innovation in mobile apps market: Exploring the new subscription plans with a behavioral reasoning perspective",
			"quote": "we engaged 18 people (nine males and nine females) of different age groups selected to have user in three categories non-experts (those with fewer than 40 apps installed on their phones), users (with 40 to 80 apps on their phones), and enthusiast users (more than 80 apps installed on their phones)",
			"assigned_codes": [
				"Mobile app market",
				"B2C business model",
				"Subscription-based pricing"
			],
			"justification": "O texto categoriza usuários de apps móveis por nível de engajamento, indicando segmentação B2C no mercado de apps com modelo de assinatura."
		},
		{
			"article_id": "190654186",
			"article_title": "Competition Among Proprietary and Open-Source Software Firms: The Role of Licensing in Strategic Contribution",
			"quote": "selling management tools and services that make it easier to run Kafka to enterprise customers",
			"assigned_codes": [
				"Enterprise market focus",
				"B2B business model",
				"Open source business model",
				"Service-oriented model"
			],
			"justification": "O texto descreve venda de ferramentas e serviços para clientes empresariais baseados em software open source, caracterizando modelo B2B empresarial orientado a serviços."
		},
		{
			"article_id": "190654465",
			"article_title": "The Business Case for a Journey Planning and Ticketing App—Comparison between a Simulation Analysis and Real-World Data",
			"quote": "direct marketing to P&R customers at P&R sites. around 70% of commuting trips by car",
			"assigned_codes": ["B2C business model", "Mobile app market"],
			"justification": "O texto descreve marketing direto para usuários de Park and Ride e commuters, caracterizando modelo B2C no mercado de apps de transporte."
		},
		{
			"article_id": "190654531",
			"article_title": "Hypothesis-driven Adaptation of Business Models based on Product Line Engineering",
			"quote": "we focused on different customer segments of private users for which we proposed different value propositions to solve their problems. Here, we have the fitness improver, who will get special features for meal and gym times, and life improver, who we will propose to save a work&life balance. Moreover, we have business improver, where we will use the proposition to optimize workflows",
			"assigned_codes": [
				"B2C business model",
				"Cross-industry applications",
				"Value-based pricing"
			],
			"justification": "O texto descreve segmentação de usuários privados com propostas de valor específicas para diferentes necessidades (fitness, vida pessoal, negócios), caracterizando modelo B2C com precificação baseada em valor."
		},
		{
			"article_id": "190654542",
			"article_title": "E-business evolution: an analysis of mobile applications' business models",
			"quote": "30 users' comments for each app have been randomically collected and later thematically analysed",
			"assigned_codes": ["Mobile app market", "B2C business model"],
			"justification": "O texto descreve análise de comentários de usuários de apps da Google Play Store, caracterizando mercado B2C de aplicações móveis."
		},
		{
			"article_id": "190654598",
			"article_title": "A Study on Cloud-Based Software Marketing Strategies Using Cloud Marketplace",
			"quote": "KT Cloud users are provided a KT Cloud server (virtual machine [VM]) machine image. Through CEART marketplace, users can search and install their cloud services through category and search function",
			"assigned_codes": [
				"Cloud delivery model",
				"Marketplace model",
				"Platform business model",
				"B2B business model"
			],
			"justification": "O texto descreve marketplace de nuvem onde usuários buscam e instalam serviços, caracterizando plataforma B2B com entrega via cloud e modelo de marketplace."
		},
		{
			"article_id": "190654601",
			"article_title": "Software as a service: Lessons from the video game industry",
			"quote": "The results were super gamer (54%), console warrior (11%), transitional gamer (14%), daily dabbler (19%), and incidental player (2%)",
			"assigned_codes": [
				"Gaming industry focus",
				"B2C business model",
				"SaaS (Software as a Service)"
			],
			"justification": "O texto categoriza gamers em diferentes perfis de uso, demonstrando segmentação detalhada no mercado B2C de games como serviço."
		},
		{
			"article_id": "190654605",
			"article_title": "The SaaS Payoff: Measuring the Business Value of Provisioning Software-as-a-Service Technologies",
			"quote": "Individual customers and small and medium enterprises represent new market segments which both case organisations are attempting to establish a strong presence",
			"assigned_codes": [
				"SME market focus",
				"B2C business model",
				"Market expansion",
				"SaaS (Software as a Service)"
			],
			"justification": "O texto descreve expansão de mercado para PMEs e clientes individuais, indicando estratégia de crescimento em múltiplos segmentos com SaaS."
		},
		{
			"article_id": "190654664",
			"article_title": "Searching for synergy from a combination of heterogeneous business models: measurement and assessment from the Polish software industry",
			"quote": "Target Customer: Large Organizations for INT and All Organizations for VAR. Competing on the value added for the customer in strategic segments",
			"assigned_codes": [
				"Enterprise market focus",
				"SME market focus",
				"B2B business model",
				"Value-based pricing"
			],
			"justification": "O texto descreve dois modelos complementares focando grandes organizações (INT) e todas organizações (VAR), demonstrando estratégia B2B multi-segmento baseada em valor."
		},
		{
			"article_id": "190654709",
			"article_title": "Business Models for Emerging Technologies: The Case of Affective Computing",
			"quote": "business customers (B2B) is the largest customer segment for ER solutions with healthcare, automotive and retail industries leading the way",
			"assigned_codes": [
				"B2B business model",
				"Healthcare technology",
				"Cross-industry applications",
				"Emerging business model"
			],
			"justification": "O texto identifica clientes B2B em múltiplas indústrias (saúde, automotivo, varejo) como segmento principal para tecnologias emergentes de computação afetiva."
		},
		{
			"article_id": "190654717",
			"article_title": "Economics of open source library software: evidences from Indian libraries",
			"quote": "This study presents a holistic picture of the 38 libraries of IITs and National Institute of Technology (NIT). Out of 38 libraries, 42.1 per cent (n= 16) were from IITs and 57.9 per cent (n= 22) from NITs",
			"assigned_codes": ["Open source business model", "B2B business model"],
			"justification": "O texto descreve adoção de software open source por instituições técnicas de ensino, caracterizando modelo B2B baseado em open source."
		},
		{
			"article_id": "190654720",
			"article_title": "Making a Business Out of (Predictive Application Management in) the Fog",
			"quote": "Asset Manufacturers (AMs) which are producing hardware components and systems (e.g., access points, routers, switches) to build Fog infrastructures (e.g., CISCO and Dell), and often take care of deploying and managing their equipment for other service providers",
			"assigned_codes": [
				"B2B business model",
				"Enterprise market focus",
				"Platform business model"
			],
			"justification": "O texto descreve fabricantes de ativos produzindo infraestrutura para provedores de serviços, caracterizando modelo B2B empresarial de plataforma."
		},
		{
			"article_id": "190654720",
			"article_title": "Making a Business Out of (Predictive Application Management in) the Fog",
			"quote": "Among them, those which are also producing customised hardware to run part of their application (e.g., Philips Hue, Ikea Tradfri), represent a particularly interesting segment",
			"assigned_codes": ["B2C business model", "Hybrid business model"],
			"justification": "O texto descreve operadores de aplicação que produzem hardware customizado para consumidores finais, caracterizando modelo híbrido B2C."
		},
		{
			"article_id": "190654834",
			"article_title": "Synergies between App-Based Car-Related Shared Mobility Services for the Development of More Profitable Business Models",
			"quote": "Some ridesharing and shared ride-hailing services target specific Customer Segments, such as commuters or long-distance travellers. singular ride-hailing services mainly target leisure, city night uses, and other short trips",
			"assigned_codes": [
				"B2C business model",
				"Mobile app market",
				"Platform business model",
				"Cross-industry applications"
			],
			"justification": "O texto descreve diferentes segmentos de usuários de apps de mobilidade compartilhada (commuters, viajantes, lazer), caracterizando plataforma B2C multi-segmento."
		},
		{
			"article_id": "190654956",
			"article_title": "Open source ERP business model framework",
			"quote": "small businesses or entrepreneurs often could not see how they could afford such systems mainly due to its high upfront prices and resources required to deploy and maintain the system. To attack this niche market of ERP in the SME sector",
			"assigned_codes": [
				"SME market focus",
				"Open source business model",
				"B2B business model",
				"Low switching costs"
			],
			"justification": "O texto descreve foco em pequenas empresas que não podem pagar sistemas proprietários, caracterizando modelo open source B2B para PMEs com baixos custos de entrada."
		},
		{
			"article_id": "190654956",
			"article_title": "Open source ERP business model framework",
			"quote": "Small enterprises may not be able to afford this level of expenditure. FOS-ERP offers a viable alternative for these small organizations. This is also true for local governments and for firms operating in developing countries",
			"assigned_codes": [
				"SME market focus",
				"Open source business model",
				"B2B business model"
			],
			"justification": "O texto destaca ERP open source como alternativa viável para pequenas empresas e governos locais, especialmente em países em desenvolvimento, caracterizando modelo B2B acessível para PMEs."
		},
		{
			"article_id": "190655012",
			"article_title": "Analysis of Freemium Business Model Considering Network Externalities and Consumer Uncertainty",
			"quote": "In Taobao net, customers are free to open a shop but need to charge if they want to 'decorate' the online shop. QQ offers a variety of services such as online social games and music service",
			"assigned_codes": [
				"Freemium model",
				"Platform business model",
				"B2C business model",
				"Network effects"
			],
			"justification": "O texto exemplifica modelo freemium em plataformas online (e-commerce, jogos sociais) com efeitos de rede, caracterizando modelo B2C de plataforma."
		},
		{
			"article_id": "190655172",
			"article_title": "Investigating e-business models' value retention for start-ups: The moderating role of venture capital investment intensity",
			"quote": "These figures are hard to understand by non tech savvy consumers or amateur health enthusiasts, and fail to provide any valuable insights",
			"assigned_codes": [
				"B2C business model",
				"Mobile app market",
				"Healthcare technology",
				"Startup company focus"
			],
			"justification": "O texto descreve desafios de startups de apps de saúde IoT em comunicar valor para consumidores não técnicos, caracterizando modelo B2C de startup no mercado de health tech."
		},
		{
			"article_id": "190655181",
			"article_title": "Growth of a platform business model as an entrepreneurial ecosystem and its effects on regional development",
			"quote": "Apple acknowledges the passive iOS modification of developers. D group hotels mainly use Booking.com because they need user openness most of all",
			"assigned_codes": [
				"Platform business model",
				"B2B business model",
				"Ecosystem management",
				"Network effects"
			],
			"justification": "O texto descreve plataformas (iOS, Booking.com) gerenciando ecossistemas de desenvolvedores e hotéis, caracterizando modelo de plataforma B2B com efeitos de rede."
		},
		{
			"article_id": "190655186",
			"article_title": "Developing enterprise social software in China: insights from Mingdao",
			"quote": "The Mingdao platform's design is suitable for any team of 50-200 people. our clients, including many small and medium enterprises, are in need of a platform with features and capability of sharing or exchanging valuable information",
			"assigned_codes": [
				"SME market focus",
				"B2B business model",
				"Platform business model",
				"SaaS (Software as a Service)"
			],
			"justification": "O texto descreve plataforma de software social empresarial focada em PMEs com equipes de 50-200 pessoas, caracterizando modelo SaaS B2B para SMEs."
		},
		{
			"article_id": "190655190",
			"article_title": "Open source - Is it an alternative to intellectual property?",
			"quote": "People often start as just users and soon some will become more involved by reporting bugs. Later on, some may become developers who fix bugs or make minor improvements. Some developers will get more involved in the process and grow to the rank of core developers",
			"assigned_codes": [
				"Open source business model",
				"Ecosystem management",
				"Network effects"
			],
			"justification": "O texto descreve progressão hierárquica de contribuidores em comunidades open source, demonstrando gestão de ecossistema com efeitos de rede no modelo open source."
		},
		{
			"article_id": "190655190",
			"article_title": "Open source - Is it an alternative to intellectual property?",
			"quote": "a reciprocal license model will be largely service oriented, where the revenue mainly comes from professional services like maintenance, support customization, consulting and training",
			"assigned_codes": [
				"Open source business model",
				"Service-oriented model",
				"B2B business model"
			],
			"justification": "O texto descreve modelo de receita open source baseado em serviços profissionais, caracterizando modelo B2B orientado a serviços."
		},
		{
			"article_id": "190655198",
			"article_title": "Difficult Business Models of Digital Business Platforms for Health Data: A Framework for Evaluation of the Ecosystem Viability",
			"quote": "The producers and consumers of patient data are organizational actors and their employees. Satakunta region started with connecting their secondary care EHR system to the RHIS so that all primary care doctors would have the opportunity to consume the data",
			"assigned_codes": [
				"Healthcare technology",
				"Platform business model",
				"B2B business model",
				"Ecosystem management"
			],
			"justification": "O texto descreve plataforma de dados de saúde conectando organizações hospitalares e profissionais de saúde, caracterizando modelo B2B de plataforma em health tech com gestão de ecossistema."
		},
		{
			"article_id": "190655206",
			"article_title": "Onboarding customer companies to electronic invoicing platform – developing a marketing and a partnering strategy for Tieto, an e-invoicing service provider",
			"quote": "In the three-corner model, the service provider enrolls all the trading partners (TPs) – buyers and suppliers – to its platform so that different counterparts have separate contractual relationships with the same platform",
			"assigned_codes": [
				"Platform business model",
				"B2B business model",
				"Marketplace model",
				"Network effects"
			],
			"justification": "O texto descreve plataforma de e-invoicing conectando compradores e fornecedores com efeitos de rede, caracterizando modelo de marketplace B2B."
		},
		{
			"article_id": "190655218",
			"article_title": "How Service Offerings and Operational Maturity Influence the Viability of Health Information Exchanges",
			"quote": "CORHIO spent a fair amount of time establishing and communicating a clear value proposition for all providers —including federally qualified health centers, behavioral health providers, long-term care providers, physicians, hospitals, clinics",
			"assigned_codes": [
				"Healthcare technology",
				"Platform business model",
				"B2B business model",
				"Value-based pricing"
			],
			"justification": "O texto descreve plataforma HIE com proposta de valor para diversos provedores de saúde, caracterizando modelo B2B de plataforma em health tech com precificação baseada em valor."
		},
		{
			"article_id": "190655219",
			"article_title": "Mobile ticketing services in the Northern Europe: Critical business model issues",
			"quote": "The first apps did offer single tickets only and targeted non-regular public transport passengers having no travel card. Now, the majority of ticketing apps offers almost a full range of available tickets for all types of passengers",
			"assigned_codes": [
				"B2C business model",
				"Mobile app market",
				"Market expansion"
			],
			"justification": "O texto descreve evolução de apps de ticketing expandindo de passageiros ocasionais para todos os tipos de usuários, demonstrando estratégia de expansão de mercado B2C."
		},
		{
			"article_id": "190655247",
			"article_title": "The effect of free sampling strategies on freemium conversion rates",
			"quote": "Increasing the proportion of premium users opposed to free users continues to be a challenging but critical lever for reaching profitability. Premium users typically account for 3–5 % of total users",
			"assigned_codes": [
				"Freemium model",
				"B2C business model",
				"Network effects"
			],
			"justification": "O texto descreve desafio de conversão de usuários gratuitos para premium no modelo freemium B2C, destacando baixa taxa de conversão típica."
		},
		{
			"article_id": "190655350",
			"article_title": "Give Away Your Digital Services: Leveraging Big Data to Capture Value",
			"quote": "Nike Running customers to understand how people use its core product—shoes. App users provide a huge amount of information about their workout habits that allows the company to profile its customers",
			"assigned_codes": [
				"B2C business model",
				"Mobile app market",
				"Data-driven monetization"
			],
			"justification": "O texto descreve app gratuito que coleta dados de usuários para entender comportamento e perfilar clientes, caracterizando modelo B2C com monetização baseada em dados."
		},
		{
			"article_id": "190655362",
			"article_title": "Making Digital Freemium Business Models a Success: Predicting Customers' Lifetime Value via Initial Purchase Information",
			"quote": "In digital freemium business models such as those of online games or social apps, a large share of overall revenue derives from a small portion of the user base. Companies operating in these and similar businesses are increasingly constructing forecasting models with which to identify potential heavy users as early as possible",
			"assigned_codes": [
				"Freemium model",
				"Gaming industry focus",
				"B2C business model",
				"Data-driven monetization"
			],
			"justification": "O texto descreve modelos freemium de jogos e apps sociais onde pequena parcela de usuários gera maior receita, usando analytics para identificar heavy users, caracterizando modelo B2C data-driven."
		},
		{
			"article_id": "190655382",
			"article_title": "Understanding the influence of absorptive capacity and ambidexterity on the process of business model change – the case of on-premise and cloud-computing software",
			"quote": "SaaS initially attracted low-end customer segments and prior non-users of ERP systems that valued SaaS because it offered scalable, rapidly implementable and easy-to-use software services. These customers, mainly SMEs, were over-served by existing ERP systems",
			"assigned_codes": [
				"SME market focus",
				"SaaS (Software as a Service)",
				"B2B business model",
				"Market expansion"
			],
			"justification": "O texto descreve SaaS atraindo PMEs que eram mal atendidas por ERPs tradicionais, demonstrando expansão de mercado para segmento SME B2B."
		},
		{
			"article_id": "190655386",
			"article_title": "Transition to the Cloud: A Vendor Perspective",
			"quote": "The second segment is small and medium size business with less than 1000 employees, where ERP Co works closely with their partners, all what they refer to as value added resellers. Customers in this segment can obtain tailor made system based on standard ERP Co product through ERP Co partners",
			"assigned_codes": [
				"SME market focus",
				"B2B business model",
				"Ecosystem management",
				"Cloud delivery model"
			],
			"justification": "O texto descreve segmento de PMEs atendidas por revendedores de valor agregado que customizam produtos padrão, caracterizando modelo B2B com gestão de ecossistema para SMEs."
		},
		{
			"article_id": "190655389",
			"article_title": "Business models and opportunity creation: How IT entrepreneurs create and develop business models under uncertainty",
			"quote": "G-cluster now focused solely on IPTV users. the console worked over any wireless network... This expanded G-cluster's customer base to players without IPTV services",
			"assigned_codes": [
				"B2C business model",
				"Gaming industry focus",
				"Market expansion",
				"Hybrid business model"
			],
			"justification": "O texto descreve evolução de foco de mercado de jogadores móveis para IPTV e depois expansão para qualquer rede wireless, demonstrando estratégia de expansão B2C híbrida na indústria de games."
		},
		{
			"article_id": "190655397",
			"article_title": "Revenue models, in-app purchase, and the app performance: Evidence from Apple's App Store and Google Play",
			"quote": "it is widely recognized that Apple targets exclusively the high-end of the market, whereas the sales of Android devices are mostly determined by low-end segments of the market. This implies that consumers accessing the Apple's App Store are on average more valuable than those in Google Play consumers",
			"assigned_codes": [
				"B2C business model",
				"Mobile app market",
				"Value-based pricing"
			],
			"justification": "O texto diferencia segmentos de consumidores de alto valor (Apple) e baixo valor (Android), caracterizando segmentação B2C baseada em valor no mercado de apps móveis."
		},
		{
			"article_id": "190655417",
			"article_title": "Commercialization of Composite Software Resulting from Collaborative Research",
			"quote": "Three of the involved companies had an established customer base in the broadcasting industry. organized presentations at several broadcasters",
			"assigned_codes": ["B2B business model", "Enterprise market focus"],
			"justification": "O texto descreve empresas com base de clientes estabelecida na indústria de broadcasting, caracterizando modelo B2B empresarial focado em setor específico."
		},
		{
			"article_id": "190655425",
			"article_title": "Adjusting software revenue and pricing strategies in the era of cloud computing",
			"quote": "servitization of the offering and software renting helped the firms to expand their customer base, especially from large-sized customers toward small and medium-sized customers",
			"assigned_codes": [
				"Market expansion",
				"SME market focus",
				"Subscription-based pricing",
				"Cloud delivery model"
			],
			"justification": "O texto descreve expansão de mercado de grandes empresas para PMEs através de servitização e aluguel de software, demonstrando estratégia de crescimento com modelo de assinatura na nuvem."
		},
		{
			"article_id": "190655425",
			"article_title": "Adjusting software revenue and pricing strategies in the era of cloud computing",
			"quote": "some of the customers of firm A, C, and D favored software licensing plus usage of the software in their internal data center, because of security concerns over highly sensitive data",
			"assigned_codes": [
				"Enterprise market focus",
				"Hybrid business model",
				"Security concerns",
				"Perpetual licensing"
			],
			"justification": "O texto descreve clientes empresariais preferindo licenciamento tradicional em data centers próprios por questões de segurança, caracterizando modelo híbrido para mercado empresarial com preocupações de segurança."
		},
		{
			"article_id": "190655440",
			"article_title": "Designing business models for cloud platforms",
			"quote": "it allows external developers to deploy and run their complementary software components. application-centric platforms such as Salesforce Force.com allow ISVs [independent software vendors] to develop extensions",
			"assigned_codes": [
				"Platform business model",
				"B2B business model",
				"Cloud delivery model",
				"Ecosystem management"
			],
			"justification": "O texto descreve plataforma cloud permitindo ISVs desenvolverem extensões, caracterizando modelo de plataforma B2B com gestão de ecossistema de desenvolvedores."
		},
		{
			"article_id": "190655451",
			"article_title": "Business Models for Cloud Computing: Experiences from Developing Modeling & Simulation as a Service Applications in Industry",
			"quote": "At one end of this chain, there exist the end-user companies from the manufacturing and engineering sector. In the CloudSME project, these companies are represented as two distinct categories: end-users who already utilize simulation technologies and end-users for whom simulation solutions are novel",
			"assigned_codes": [
				"B2B business model",
				"Enterprise market focus",
				"Cloud delivery model",
				"SaaS (Software as a Service)"
			],
			"justification": "O texto descreve dois segmentos de empresas manufatureiras e de engenharia (usuários existentes e novos de simulação), caracterizando modelo B2B empresarial de SaaS na nuvem."
		},
		{
			"article_id": "190655528",
			"article_title": "A Study on a Decentralized SaaS Business Model",
			"quote": "local servers are belong to independent business entity. Hereafter, the term server refers to a business entity (e.g., a URL) that provides services in the context of decentralized SaaS model",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Platform business model",
				"B2B business model"
			],
			"justification": "O texto descreve modelo descentralizado de SaaS onde servidores locais são entidades de negócio independentes, caracterizando modelo de plataforma B2B distribuído."
		},
		{
			"article_id": "190655555",
			"article_title": "Selection of the Proper Revenue and Pricing Model for SaaS",
			"quote": "The software can be used in many different types of organizations, including financial institutions and government organizations. If customers had already invested in IT infrastructure and their own IT personnel, they saw traditional software licensing as a more attractive choice",
			"assigned_codes": [
				"Enterprise market focus",
				"B2B business model",
				"Hybrid business model",
				"Cross-industry applications"
			],
			"justification": "O texto descreve software para diversos tipos de organizações (financeiras, governamentais) com preferências variadas por modelos de licenciamento, caracterizando modelo B2B híbrido cross-industry."
		},
		{
			"article_id": "190655589",
			"article_title": "Service-Centric Business Model in Cloud Environment",
			"quote": "Organizations are gaining profit from not only the potential benefits of cloud computing, but the practical opportunities induced from cloud environment to adapt their existing BM for satisfying all the customers' demands",
			"assigned_codes": [
				"Cloud delivery model",
				"B2B business model",
				"Service-oriented model"
			],
			"justification": "O texto descreve organizações adaptando modelos de negócio para ambiente cloud visando atender demandas de clientes, caracterizando modelo B2B orientado a serviços na nuvem."
		},
		{
			"article_id": "190655614",
			"article_title": "Designing Viable Multi-sided Data Platforms: The Case of Context-Aware Mobile Travel Applications",
			"quote": "The intended population comprises young people who have a smartphone and who have a habit of traveling to cities. A convenience sample of Dutch students is used",
			"assigned_codes": [
				"B2C business model",
				"Mobile app market",
				"Platform business model"
			],
			"justification": "O texto descreve app de viagem focado em jovens com smartphones que viajam para cidades, caracterizando plataforma B2C no mercado de apps móveis."
		},
		{
			"article_id": "190655631",
			"article_title": "Economic and business perspectives on smartphones as multi-sided platforms",
			"quote": "the BlackBerry, a device that allowed business executives to access their corporate email wirelessly from anywhere at any time",
			"assigned_codes": [
				"Enterprise market focus",
				"B2B business model",
				"Platform business model"
			],
			"justification": "O texto descreve BlackBerry focado em executivos de negócios acessando email corporativo, caracterizando plataforma B2B para mercado empresarial."
		},
		{
			"article_id": "190655648",
			"article_title": "Crushing Candy: The Free-to-Play Game in Its Connective Commodity Form",
			"quote": "Casual games differ from the previous decades of so-called hard-core games because (1) their fiction preference tends to be positive, (2) casual games require less initial knowledge to play, and (3) they demand lower time investments",
			"assigned_codes": [
				"Gaming industry focus",
				"Freemium model",
				"B2C business model"
			],
			"justification": "O texto descreve características de jogos casuais que demandam menor investimento de tempo e conhecimento, caracterizando modelo freemium B2C na indústria de games."
		},
		{
			"article_id": "190655698",
			"article_title": "Effects of Freemium Strategy in the Mobile App Market: An Empirical Study of Google Play",
			"quote": "For the Android consumers, Google Play is such a one-stop shop for thousands of Android apps. more than 60 percent of smartphone users rely heavily on the information provided by mobile app online marketplaces",
			"assigned_codes": [
				"Mobile app market",
				"Platform business model",
				"B2C business model",
				"Freemium model"
			],
			"justification": "O texto descreve Google Play como marketplace central para apps Android onde consumidores buscam informações, caracterizando plataforma B2C com modelo freemium."
		},
		{
			"article_id": "190655702",
			"article_title": "Network Externalities, Incumbent's Competitive Advantage and the Degree of Openness of Software Start-Ups",
			"quote": "relatively new entrants (software start-ups aged less than four years). Above 70 % of them consider the diffusion of incompatible proprietary solutions as the main barrier for the diffusion of OS solutions",
			"assigned_codes": [
				"Startup company focus",
				"Open source business model",
				"Network effects"
			],
			"justification": "O texto descreve startups de software enfrentando barreiras de efeitos de rede de soluções proprietárias incompatíveis, caracterizando desafios de startups open source."
		},
		{
			"article_id": "190655721",
			"article_title": "A Pricing Framework for Software-as-a-Service",
			"quote": "The second challenge comes from the diversity of SaaS clients, among which small and medium enterprises have been the most aggressive adopters",
			"assigned_codes": [
				"SME market focus",
				"SaaS (Software as a Service)",
				"B2B business model"
			],
			"justification": "O texto identifica PMEs como adotantes mais agressivos de SaaS, caracterizando foco no mercado SME B2B."
		},
		{
			"article_id": "190655747",
			"article_title": "Clarifying the Value Elements of Business Models for Disturbance Management in Supply Chains",
			"quote": "Logistic operators. Among logistic operators the need for management and analysis of transport problems is already identified, and it is an important part of companies' operations. In the logistic industry the companies search for competitive advantage especially with cost-effectiveness and quality",
			"assigned_codes": [
				"B2B business model",
				"Enterprise market focus",
				"Value-based pricing"
			],
			"justification": "O texto descreve operadores logísticos buscando vantagem competitiva através de custo-efetividade e qualidade, caracterizando modelo B2B empresarial com precificação baseada em valor."
		},
		{
			"article_id": "190655750",
			"article_title": "The Impact of Open Source Software Commercialization on Firm Value",
			"quote": "for-profit firms collaborating with OSS communities. firms that aim to develop a commercial product jointly with a community do so mainly to receive design help from their potential future customers",
			"assigned_codes": [
				"Open source business model",
				"B2B business model",
				"Ecosystem management"
			],
			"justification": "O texto descreve empresas comerciais colaborando com comunidades OSS para co-criar produtos com futuros clientes, caracterizando modelo open source B2B com gestão de ecossistema."
		},
		{
			"article_id": "190655785",
			"article_title": "The relationship between Open Innovation and Strategy: data-driven analysis of the Mobile Value Services Industry",
			"quote": "Mobile Network Operator (H3G, TIM, Vodafone, Wind) and Device Manufacturer (Apple, Nokia, Siemens) are the most detailed categories in the sample",
			"assigned_codes": [
				"B2B business model",
				"Platform business model",
				"Ecosystem management",
				"Mobile app market"
			],
			"justification": "O texto identifica operadoras de rede móvel e fabricantes de dispositivos como categorias principais, caracterizando ecossistema de plataforma B2B no mercado móvel."
		},
		{
			"article_id": "190655819",
			"article_title": "Open-Source Software Entrepreneurial Business Modelling",
			"quote": "Our ultimate goal is to offer technology-minded founders a useful tool for managing the wide selection of business model components. Feedback was collected informally from bootstrap entrepreneurs, serial entrepreneurs",
			"assigned_codes": ["Startup company focus", "Open source business model"],
			"justification": "O texto descreve framework para fundadores empreendedores de tecnologia gerenciarem componentes de modelos de negócio open source, caracterizando foco em startups."
		},
		{
			"article_id": "190655845",
			"article_title": "Towards a better Understanding of the Dynamics of Platform as a Service Business Models",
			"quote": "IT startups are dynamic in their early stages and thus will use new technologies and products compared to companies established before them. Platform modules are provided by independent software vendors (ISV)",
			"assigned_codes": [
				"Startup company focus",
				"Platform business model",
				"B2B business model",
				"Cloud delivery model"
			],
			"justification": "O texto descreve startups de TI como early adopters de plataformas PaaS onde ISVs fornecem módulos, caracterizando ecossistema de plataforma B2B cloud focado em startups."
		}
	]
}
