{
	"qualitative_analysis": [
		{
			"article_id": "190638760",
			"article_title": "A Pricing Framework for Software-as-a-Service",
			"quote": "According to a study by Gartner, the global SaaS market is expected to reach 12.1 billion USD by 2014, reflecting a compound annual growth rate of 26%",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Future growth potential",
				"Growing business model"
			],
			"justification": "Reporta crescimento significativo do mercado SaaS globalmente, demonstrando evolução e potencial de crescimento do modelo de negócio."
		},
		{
			"article_id": "190638760",
			"article_title": "A Pricing Framework for Software-as-a-Service",
			"quote": "The largest cluster (C1) makes up 57% of our sample...in C1 63% vendors considered no more than two components and 91% vendors considered no more than three",
			"assigned_codes": [
				"Subscription-based pricing",
				"Flexible pricing strategies"
			],
			"justification": "Demonstra padrões de estratégias de precificação entre fornecedores SaaS, com preferência por modelos compactos de licenciamento."
		},
		{
			"article_id": "190638760",
			"article_title": "A Pricing Framework for Software-as-a-Service",
			"quote": "Cluster two (C2) makes up 28% of our sample...Cluster three (C3) makes up 15% of our sample",
			"assigned_codes": ["Value-based pricing", "Cost-based pricing"],
			"justification": "Identifica segmentação de fornecedores entre estratégias baseadas em valor e custo, demonstrando diversidade de abordagens de precificação."
		},
		{
			"article_id": "190638760",
			"article_title": "A Pricing Framework for Software-as-a-Service",
			"quote": "Age of vendors <10 65...USA 63.2",
			"assigned_codes": ["Startup company focus", "USA-dominant market"],
			"justification": "Indica predominância de empresas jovens e forte concentração geográfica nos EUA no mercado SaaS."
		},
		{
			"article_id": "190638781",
			"article_title": "Selection of the Proper Revenue and Pricing Model for SaaS",
			"quote": "It is based on revenue sharing between three players, the content owner, a portal, and ourselves –all sharing the content revenue. If the content is [equivalent to] five dollars, we share it so that there are two dollars for the portal, and two dollars for the content owner, and one for us",
			"assigned_codes": [
				"Platform business model",
				"Marketplace model",
				"Ecosystem management"
			],
			"justification": "Descreve modelo de compartilhamento de receita entre múltiplos stakeholders em plataforma, caracterizando modelo de marketplace."
		},
		{
			"article_id": "190638781",
			"article_title": "Selection of the Proper Revenue and Pricing Model for SaaS",
			"quote": "It became clear that 90 percent of our customers wanted to use this through a public cloud",
			"assigned_codes": ["Cloud delivery model", "Customer trust maintenance"],
			"justification": "Alta preferência por cloud pública demonstra aceitação do modelo de entrega baseado em nuvem e confiança dos clientes."
		},
		{
			"article_id": "190638871",
			"article_title": "Transition to the Cloud: A Vendor Perspective",
			"quote": "corporate IT spending on cloud computing will increase by 42% in 2015, and by year 2018, more than 60% of the companies will have at least half their software and infrastructure in cloud",
			"assigned_codes": [
				"Cloud computing infrastructure",
				"Future growth potential",
				"Digital transformation"
			],
			"justification": "Projeções indicam crescimento acelerado da adoção de cloud computing e transformação digital das empresas."
		},
		{
			"article_id": "190638871",
			"article_title": "Transition to the Cloud: A Vendor Perspective",
			"quote": "ERP Co adjusted their research and development resources to 80% in SaaS and 20% in on-premise...adjusted to 50% each for SaaS products and on-premise products",
			"assigned_codes": [
				"Established vendor transition",
				"Hybrid model adoption",
				"Hybrid business model"
			],
			"justification": "Demonstra transição estratégica de fornecedor tradicional para modelo híbrido, equilibrando investimentos entre SaaS e on-premise."
		},
		{
			"article_id": "190638871",
			"article_title": "Transition to the Cloud: A Vendor Perspective",
			"quote": "up to 50% of the initial ERP Co license fees do go to VAR",
			"assigned_codes": [
				"Partner ecosystem disruption",
				"Revenue stream transformation"
			],
			"justification": "Revela impacto significativo nos parceiros de canal e transformação do modelo de receita durante transição para cloud."
		},
		{
			"article_id": "190638976",
			"article_title": "Managing a Software Business",
			"quote": "entering a mass market is hard; for example, more than two-thirds of the millions of mobile phone apps are never or hardly ever downloaded",
			"assigned_codes": ["Mobile app market", "Market expansion"],
			"justification": "Destaca desafios de penetração no mercado de massa de aplicativos móveis, relevante para estratégias de expansão."
		},
		{
			"article_id": "190653396",
			"article_title": "Digital sustainable business models",
			"quote": "31 start-ups analyzed...Initial sample size 50 companies...various archetype classifications",
			"assigned_codes": [
				"Startup company focus",
				"Sustainability focus",
				"Platform business model"
			],
			"justification": "Análise quantitativa de startups com foco em sustentabilidade, identificando diferentes arquétipos de modelos de negócio digitais sustentáveis."
		},
		{
			"article_id": "190653434",
			"article_title": "When does a freemium business model lead to high performance?",
			"quote": "Share of freemium apps on Apple App Store 25 percent (2009)...80 percent (over) (2022)...App Store subscriptions 745 million (2021)...900 million (2022)",
			"assigned_codes": [
				"Freemium model",
				"Mobile app market",
				"Growing business model",
				"Subscription-based pricing"
			],
			"justification": "Evidencia crescimento explosivo do modelo freemium no mercado de apps, com aumento massivo de adoção e assinaturas."
		},
		{
			"article_id": "190653582",
			"article_title": "Strategy and business model evolution at Adobe",
			"quote": "Adobe reported a record $1.31 billion in revenue for the fourth quarter of 2015...record annual revenue of $4.8 billion in 2015. The recurring revenue from subscriptions represented 74% of Adobe's business",
			"assigned_codes": [
				"Subscription-based pricing",
				"Revenue stream transformation",
				"Established vendor transition"
			],
			"justification": "Caso exemplar de transição bem-sucedida para modelo de assinatura, com receita recorrente dominando o modelo de negócio."
		},
		{
			"article_id": "190653589",
			"article_title": "Navigating the paradox of global scaling",
			"quote": "global scaling firms to exhibit hypergrowth with a compound annual growth rate exceeding 40%...Total worldwide revenue for cloud-based software was estimated to be roughly $46 billion in 2017, growing at almost 20% a year",
			"assigned_codes": [
				"Cloud delivery model",
				"Future growth potential",
				"Global market presence",
				"Market expansion"
			],
			"justification": "Métricas de hipercrescimento demonstram dinâmica acelerada de expansão global em modelos de negócio baseados em cloud."
		},
		{
			"article_id": "190653595",
			"article_title": "Spillover Effects and Freemium Strategy in the Mobile App Market",
			"quote": "the launch of the free version leads to an 8.9% increase in the daily number of ratings",
			"assigned_codes": [
				"Freemium model",
				"Network effects",
				"Mobile app market"
			],
			"justification": "Evidencia efeitos de spillover positivos do freemium, onde versão gratuita aumenta demanda pela versão paga através de efeitos de rede."
		},
		{
			"article_id": "190653734",
			"article_title": "Systematic Literature Review of Monetization in Mobile App",
			"quote": "the worldwide mobile market is expected to increase at a 13.8% compound annual growth rate (CAGR) between 2023 and 2030, reaching a value of USD 206.85 billion in 2022",
			"assigned_codes": [
				"Mobile app market",
				"Future growth potential",
				"Growing business model"
			],
			"justification": "Projeções de crescimento substancial do mercado mobile demonstram oportunidades contínuas de monetização."
		},
		{
			"article_id": "190653772",
			"article_title": "Current practices and emerging trends of transit apps",
			"quote": "About half of the transit agencies (N=115) developed or endorsed branded transit apps...about 15–50% of their tickets were sold via transit apps",
			"assigned_codes": [
				"B2C business model",
				"Mobile app market",
				"Digital transformation"
			],
			"justification": "Adoção significativa de apps de trânsito demonstra transformação digital do setor de transporte público."
		},
		{
			"article_id": "190653856",
			"article_title": "Stuck Inside a Cloud: SaaS business models and public market valuation",
			"quote": "The S&P 500 grew 136% in the three years while the SaaS companies grew on average 354% over the same period...The Sharpe ratio of the SaaS Index over the observed period is 4.269",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Future growth potential",
				"Growing business model"
			],
			"justification": "Performance superior de empresas SaaS versus mercado tradicional evidencia valor e maturidade do modelo de negócio."
		},
		{
			"article_id": "190653872",
			"article_title": "Managing Software-as-a-Service: Pricing and operations",
			"quote": "Gartner (2021) predicts the revenue of worldwide software-as-a-service (SaaS) services reaching $145 billion by 2022 at a compound annual growth rate of 18.9% since 2020",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Future growth potential",
				"Pay-as-you-go pricing"
			],
			"justification": "Previsões de crescimento robusto do mercado SaaS global demonstram consolidação e expansão contínua do modelo."
		},
		{
			"article_id": "190653872",
			"article_title": "Managing Software-as-a-Service: Pricing and operations",
			"quote": "38% of SaaS companies adopt pricing plans based on usage...Netflix's recommendation system saves the company $1 billion annually through reduced churn",
			"assigned_codes": [
				"Pay-as-you-go pricing",
				"Data-driven monetization",
				"Service quality improvement"
			],
			"justification": "Diversidade de estratégias de precificação baseadas em uso e valor significativo de retenção através de qualidade de serviço."
		},
		{
			"article_id": "190653882",
			"article_title": "Converting free users to paid subscribers in the SaaS context",
			"quote": "12,297 prospective customers...734 conversions...On average, free-trial users convert to paid subscribers in 23 days, with a median of 9 days",
			"assigned_codes": [
				"Freemium model",
				"SaaS (Software as a Service)",
				"Low switching costs"
			],
			"justification": "Métricas de conversão de trials demonstram dinâmica de aquisição de clientes em modelo freemium SaaS."
		},
		{
			"article_id": "190653942",
			"article_title": "Optimal distinctiveness across revenue models",
			"quote": "Sample of 268,126 apps: 72,017 paid, 196,019 free...over a period of 18 months...cumulative revenue in excess of $200 billion",
			"assigned_codes": [
				"Mobile app market",
				"Freemium model",
				"B2C business model"
			],
			"justification": "Análise massiva do mercado de apps revela predominância de apps gratuitos e receita substancial do ecossistema."
		},
		{
			"article_id": "190653950",
			"article_title": "On top of the game? Social features in freemium products",
			"quote": "When the platform's installed base is large, free-to-play games with many social features have a 49 percentage points higher probability of becoming a superstar",
			"assigned_codes": [
				"Freemium model",
				"Network effects",
				"Gaming industry focus"
			],
			"justification": "Evidencia forte impacto de recursos sociais e efeitos de rede no sucesso de jogos freemium."
		},
		{
			"article_id": "190654058",
			"article_title": "MintM: the start-up transforming businesses real-time",
			"quote": "revenues tripled soon thereafter...Successfully raising 750 USD K in various funding rounds...geographical presence in Brazil, India, Ireland, Malaysia, Singapore, UAE, and USA",
			"assigned_codes": [
				"Startup company focus",
				"Global market presence",
				"Market expansion"
			],
			"justification": "Crescimento rápido e expansão geográfica demonstram escalabilidade de startup com modelo de negócio digital."
		},
		{
			"article_id": "190654085",
			"article_title": "Business model innovation in mobile apps market",
			"quote": "an expected global market bigger than 935 billion U.S. dollars in 2023...more than 2 million apps in the Google's Play store and 1.83 million apps in Apple's AppStore in 2019",
			"assigned_codes": [
				"Mobile app market",
				"Subscription-based pricing",
				"Future growth potential"
			],
			"justification": "Tamanho massivo do mercado de apps e projeções de crescimento indicam oportunidades contínuas para inovação em modelos de negócio."
		},
		{
			"article_id": "190654465",
			"article_title": "The Business Case for a Journey Planning and Ticketing App",
			"quote": "Active Users rose to a maximum of 92k...App Profitability is in fact more than £3k/month by month 60...monthly profit of between £14.5k and £140k in month 60",
			"assigned_codes": [
				"Mobile app market",
				"B2C business model",
				"Market expansion"
			],
			"justification": "Modelagem de viabilidade demonstra potencial de lucratividade de app de transporte público com diferentes cenários de crescimento."
		},
		{
			"article_id": "190654531",
			"article_title": "Hypothesis-driven Adaptation of Business Models based on Product Line Engineering",
			"quote": "It was created for mobile applications and consists of 89 variation points of different business model decisions...we found different niches (31 decisions), which are currently not implemented by the analyzed competitors",
			"assigned_codes": [
				"Mobile app market",
				"Flexible pricing strategies",
				"Market expansion"
			],
			"justification": "Análise sistemática de pontos de variação em modelos de negócio móveis identifica oportunidades de nicho inexploradas."
		},
		{
			"article_id": "190654542",
			"article_title": "E-business evolution: an analysis of mobile applications' business models",
			"quote": "the content category accounts for 80% (901 out of 1125) and 91.6% (1031 out of 1125), respectively, for the 'free' and 'pay per download' mobile apps' categories...about 69% of pay per download apps (777 out of 1125) are based on mixed value capture mechanisms",
			"assigned_codes": [
				"Mobile app market",
				"Freemium model",
				"Hybrid business model"
			],
			"justification": "Predominância de modelos mistos de captura de valor demonstra sofisticação crescente de estratégias de monetização móvel."
		},
		{
			"article_id": "190654598",
			"article_title": "A Study on Cloud-Based Software Marketing Strategies Using Cloud Marketplace",
			"quote": "As of January 2020, it has 65 registered services (KT Cloud)...Total 858 (CEART)...A total of 7213 services are registered (AWS marketplace)",
			"assigned_codes": [
				"Cloud delivery model",
				"Marketplace model",
				"Economies of scale"
			],
			"justification": "Variação significativa no tamanho de marketplaces cloud demonstra diferentes níveis de maturidade e economias de escala."
		},
		{
			"article_id": "190654601",
			"article_title": "Software as a service: Lessons from the video game industry",
			"quote": "Video game revenues in the United States have nearly doubled, from USD 17.5 billion in 2010 to USD 29.1 billion in 2017...68% currently active GaaS players",
			"assigned_codes": [
				"Gaming industry focus",
				"Subscription-based pricing",
				"Growing business model"
			],
			"justification": "Crescimento substancial de receita e alta taxa de jogadores ativos demonstram sucesso do modelo Games-as-a-Service."
		},
		{
			"article_id": "190654605",
			"article_title": "The SaaS Payoff: Measuring the Business Value",
			"quote": "SaaS accounts for the majority of the entire cloud market and it is forecast to reach $117.1 billion in revenues by 2021 with an annual growth rate of 16 percent",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Future growth potential",
				"Cloud computing infrastructure"
			],
			"justification": "Previsões confirmam SaaS como componente dominante do mercado cloud com crescimento sustentado."
		},
		{
			"article_id": "190654605",
			"article_title": "The SaaS Payoff: Measuring the Business Value",
			"quote": "SaaS has enabled us to create a virtualised product which is 80% smaller, roughly 20 times faster...we can automatically provision new servers and create working environments for them within an hour",
			"assigned_codes": [
				"Multi-tenant architecture",
				"On-demand access",
				"Economies of scale"
			],
			"justification": "Benefícios técnicos e operacionais do SaaS demonstram eficiências significativas em infraestrutura e provisionamento."
		},
		{
			"article_id": "190654664",
			"article_title": "Searching for synergy from a combination of heterogeneous business models",
			"quote": "Impact values for market objectives: INT variables on VAR = 7.69 total, VAR variables on INT = 7.15 total...high synergy potential only in the market objective area",
			"assigned_codes": [
				"Hybrid business model",
				"B2B business model",
				"Market expansion"
			],
			"justification": "Análise quantitativa de sinergia entre modelos de negócio heterogêneos revela potenciais em objetivos de mercado."
		},
		{
			"article_id": "190654709",
			"article_title": "Business Models for Emerging Technologies: The Case of Affective Computing",
			"quote": "The global affective computing market was valued at USD 16.17 billion in 2017, and is expected to reach a value of USD 88.69 billion by 2023 at a CAGR of 32.81%",
			"assigned_codes": [
				"Emerging business model",
				"Future growth potential",
				"Technology evolution"
			],
			"justification": "Taxa de crescimento excepcional demonstra potencial de tecnologias emergentes em criar novos modelos de negócio."
		},
		{
			"article_id": "190654717",
			"article_title": "Economics of open source library software",
			"quote": "The results of the study show that university libraries of India could save an estimated Rs 417m by adopting open source ILS",
			"assigned_codes": [
				"Open source business model",
				"Cost-based pricing",
				"Cross-industry applications"
			],
			"justification": "Economia substancial através de software open source demonstra viabilidade do modelo em setores específicos."
		},
		{
			"article_id": "190654720",
			"article_title": "Making a Business Out of the Fog",
			"quote": "New Fog services are expected to undergo a compound annual growth rate of around 119% in the years 2018–2022...is expected to potentially reach a market of more than $18 billion dollars worldwide by 2022",
			"assigned_codes": [
				"Cloud computing infrastructure",
				"Emerging business model",
				"Technology evolution"
			],
			"justification": "Crescimento explosivo projetado de fog computing demonstra emergência de novo modelo de infraestrutura cloud."
		},
		{
			"article_id": "190654834",
			"article_title": "Synergies between App-Based Car-Related Shared Mobility Services",
			"quote": "In P2P services, the platform charges a commission per trip, which in the case of Uber is 20%...BlaBlaCar's commission is around 17%...up to 25%, as in the case of Turo",
			"assigned_codes": [
				"Platform business model",
				"Marketplace model",
				"B2C business model"
			],
			"justification": "Modelos de comissionamento em plataformas de mobilidade demonstram diferentes estratégias de captura de valor."
		},
		{
			"article_id": "190654956",
			"article_title": "Open source ERP business model framework",
			"quote": "OpenBravo...more than 970,000 downloads recorded...Compiere recorded more than 1.2 million downloads of its software and has more than 100 partners in 25 countries",
			"assigned_codes": [
				"Open source business model",
				"Global market presence",
				"Ecosystem management"
			],
			"justification": "Adoção massiva e rede de parceiros global demonstram viabilidade de modelo de negócio open source para ERP."
		},
		{
			"article_id": "190655012",
			"article_title": "Analysis of Freemium Business Model Considering Network Externalities",
			"quote": "in 2012, Alibaba handled 1.1 trillion yuan ($170 billion) in sales...Alibaba's market value was measured as $231 billion...As of August 2014, it had 848 million active QQ accounts",
			"assigned_codes": [
				"Freemium model",
				"Platform business model",
				"Network effects",
				"Global market presence"
			],
			"justification": "Escala massiva de usuários e transações demonstra poder de efeitos de rede em plataformas freemium."
		},
		{
			"article_id": "190655172",
			"article_title": "Investigating e-business models' value retention for start-ups",
			"quote": "We have collected data from 470 start-ups in China...95% of mobile Apps are abandoned by users within one month...China is by far world's largest IoT market with 74 million connections as of 2014",
			"assigned_codes": [
				"Startup company focus",
				"Mobile app market",
				"Global market presence"
			],
			"justification": "Alta taxa de abandono de apps destaca desafios de retenção de valor em modelos de negócio de startups móveis."
		},
		{
			"article_id": "190655181",
			"article_title": "Growth of a platform business model as an entrepreneurial ecosystem",
			"quote": "the supplier's OI level is 0.5 for Apple, while it is 0.9 for Google...customer OI, is 0.5 for the former and 0.9 for the latter",
			"assigned_codes": [
				"Platform business model",
				"Mobile app market",
				"Ecosystem management"
			],
			"justification": "Diferenças em níveis de abertura entre plataformas Apple e Android impactam dinâmica do ecossistema."
		},
		{
			"article_id": "190655186",
			"article_title": "Developing enterprise social software in China: insights from Mingdao",
			"quote": "Sales revenue reached RMB2 million (US$285,700) and more than 90% of advanced account users renewed their account in 2014...about 5% of Mingdao's free accounts were upgraded to advanced accounts",
			"assigned_codes": [
				"Freemium model",
				"B2B business model",
				"Subscription-based pricing",
				"Enterprise market focus"
			],
			"justification": "Taxa de conversão de 5% e renovação de 90% demonstram eficácia do modelo freemium B2B empresarial."
		},
		{
			"article_id": "190655198",
			"article_title": "Difficult Business Models of Digital Business Platforms for Health Data",
			"quote": "The number of users in Satakunta region...grew from about 300 up to 3700...there were 15 EHR and other patient data providing systems providing patient data into the RHIS",
			"assigned_codes": [
				"Platform business model",
				"Healthcare technology",
				"B2B business model"
			],
			"justification": "Crescimento de usuários e integração de múltiplos sistemas demonstra desafios de viabilidade de plataformas de saúde."
		},
		{
			"article_id": "190655206",
			"article_title": "Onboarding customer companies to electronic invoicing platform",
			"quote": "the total number of invoices in Europe is estimated to have already surpassed 35 billion per year...e-invoicing enables cost savings of as high as 57% per invoice",
			"assigned_codes": [
				"Platform business model",
				"B2B business model",
				"Value-based pricing",
				"Digital transformation"
			],
			"justification": "Volume massivo de faturas e economias significativas demonstram proposta de valor de plataformas de faturamento eletrônico."
		},
		{
			"article_id": "190655218",
			"article_title": "How Service Offerings and Operational Maturity Influence the Viability of HIEs",
			"quote": "25-30 percent operational rate (2009-2012)...less than 26 percent financially viable (2012)...106 operational HIEs in 2014 with 50 percent financially viable",
			"assigned_codes": [
				"Healthcare technology",
				"Platform business model",
				"Service-oriented model"
			],
			"justification": "Melhoria de 26% para 50% em viabilidade financeira demonstra maturação do modelo de negócio de HIEs."
		},
		{
			"article_id": "190655219",
			"article_title": "Mobile ticketing services in the Northern Europe",
			"quote": "share of mobile ticketing remains rather low, for example, 3% of all sales at SL, 5% at Skånetrafiken, 7% at Västtrafik...The share of mobile tickets is more than 40% at Ruter, and it is constantly growing",
			"assigned_codes": [
				"Mobile app market",
				"B2C business model",
				"Digital transformation"
			],
			"justification": "Variação significativa em adoção (3-40%) demonstra diferentes estágios de maturidade em ticketing móvel."
		},
		{
			"article_id": "190655247",
			"article_title": "The effect of free sampling strategies on freemium conversion rates",
			"quote": "Premium users typically account for 3–5 % of total users...the odds of converting in Premiumfirst are 6.053 times the odds of converting in Freefirst",
			"assigned_codes": ["Freemium model", "Flexible pricing strategies"],
			"justification": "Diferença significativa em taxas de conversão baseada em estratégia de amostragem demonstra importância do design de freemium."
		},
		{
			"article_id": "190655350",
			"article_title": "Give Away Your Digital Services: Leveraging Big Data to Capture Value",
			"quote": "Facebook, for instance, had more than 1.7 billion monthly active users in September 2016...By the end of 2016, 2.16 billion people will have smartphones...90 percent of iOS apps are offered for free",
			"assigned_codes": [
				"Data-driven monetization",
				"Platform business model",
				"B2C business model",
				"Network effects"
			],
			"justification": "Escala massiva de usuários e predominância de apps gratuitos demonstram modelo de monetização baseado em dados."
		},
		{
			"article_id": "190655362",
			"article_title": "Making Digital Freemium Business Models a Success",
			"quote": "Conversion rate 3.3% (Data set 1), 6.1% (Data set 2), 4.8% (Data set 3)...Top 1% users contribute 84.6% (data set 1), 60.5% (data set 2), 53.6% (data set 3) of total revenue",
			"assigned_codes": ["Freemium model", "Data-driven monetization"],
			"justification": "Concentração extrema de receita em poucos usuários (top 1% gera 53-85%) caracteriza dinâmica típica de freemium."
		},
		{
			"article_id": "190655382",
			"article_title": "Understanding the influence of absorptive capacity and ambidexterity on business model change",
			"quote": "Around 15% of the global cloud-computing market comprises Software as a Service (SaaS)...Cloud-turnover share: 20%...20%...10–20%",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Established vendor transition",
				"Hybrid business model"
			],
			"justification": "Diferentes níveis de participação de cloud no faturamento demonstram estágios variados de transição para SaaS."
		},
		{
			"article_id": "190655389",
			"article_title": "Business models and opportunity creation: How IT entrepreneurs create business models",
			"quote": "data collection for this study incorporated several types of empirical material covering the entire history of the case firm, from 2000 to 2014...Business model evolution stages: 4 major business models over 15 years",
			"assigned_codes": [
				"Emerging business model",
				"Startup company focus",
				"Technology evolution"
			],
			"justification": "Evolução através de 4 modelos de negócio em 15 anos demonstra adaptação contínua sob incerteza tecnológica."
		},
		{
			"article_id": "190655397",
			"article_title": "Revenue models, in-app purchase, and the app performance",
			"quote": "the app market has shown an astonishing growth stepping from less than $10 billion annual revenue in 2011 up to estimated $70 billion by 2017...Apple's App Store and Google Play, which have become by far the most popular stores, retaining together almost 90% of the market",
			"assigned_codes": [
				"Mobile app market",
				"Platform business model",
				"Growing business model"
			],
			"justification": "Crescimento de $10B para $70B em 6 anos e concentração de 90% em duas plataformas demonstra maturação do mercado."
		},
		{
			"article_id": "190655425",
			"article_title": "Adjusting software revenue and pricing strategies in the era of cloud computing",
			"quote": "Percentage of revenue: renting vs. licensing - Firm A: 70/30, Firm B: 100/0, Firm C: 55/45, Firm D: 20/80, Firm E: 100/0",
			"assigned_codes": [
				"Subscription-based pricing",
				"Perpetual licensing",
				"Hybrid business model",
				"Revenue stream transformation"
			],
			"justification": "Distribuição variada entre aluguel e licenciamento demonstra diferentes estratégias de transição de modelo de receita."
		},
		{
			"article_id": "190655440",
			"article_title": "Designing business models for cloud platforms",
			"quote": "revenue share (now 15%, instead of 30% before)...more than 200 BMI ideas...developing nine ideas further",
			"assigned_codes": [
				"Platform business model",
				"Flexible pricing strategies",
				"Ecosystem management"
			],
			"justification": "Redução de revenue share de 30% para 15% demonstra ajuste de precificação para viabilizar ecossistema de plataforma."
		},
		{
			"article_id": "190655451",
			"article_title": "Business Models for Cloud Computing: MSaaS",
			"quote": "In the CloudSME project MSaaS business models were developed iteratively using the input received from all stakeholders (24 companies)...five uses were identified each of which then served as the basis of a business model",
			"assigned_codes": [
				"Cloud delivery model",
				"B2B business model",
				"Cross-industry applications"
			],
			"justification": "Desenvolvimento iterativo com 24 empresas de 5 modelos de negócio MSaaS demonstra diversidade de aplicações cloud B2B."
		},
		{
			"article_id": "190655555",
			"article_title": "Selection of the Proper Revenue and Pricing Model for SaaS",
			"quote": "Based on 32 interviews with software professionals from four case firms...6–10 interviews per firm were conducted, each lasting 45–90 minutes",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Subscription-based pricing",
				"B2B business model"
			],
			"justification": "Estudo qualitativo profundo revela complexidade na seleção de modelos de receita e precificação para SaaS B2B."
		},
		{
			"article_id": "190655614",
			"article_title": "Designing Viable Multi-sided Data Platforms",
			"quote": "The app market is dominated by the freemium model as over 90% of all apps are for free...197 valid responses were received",
			"assigned_codes": [
				"Freemium model",
				"Platform business model",
				"B2C business model"
			],
			"justification": "Predominância de 90% de apps gratuitos confirma freemium como modelo dominante em plataformas móveis B2C."
		},
		{
			"article_id": "190655631",
			"article_title": "Economic and business perspectives on smartphones as multi-sided platforms",
			"quote": "By September 2012 about 700,000 apps were available on Apple's App Store and users had made roughly 35 billion app downloads. But Google Play was catching up — it had 675,000 apps available and 25 billion app downloads",
			"assigned_codes": [
				"Platform business model",
				"Mobile app market",
				"Network effects",
				"Economies of scale"
			],
			"justification": "Volume massivo de apps e downloads demonstra economias de escala e efeitos de rede em plataformas móveis multi-sided."
		},
		{
			"article_id": "190655648",
			"article_title": "Crushing Candy: The Free-to-Play Game in Its Connective Commodity Form",
			"quote": "the company's revenue grew from US$63 million in 2011 to US$1.8 billion in 2013...A mere 3% of its player network of over 300+ million consisted of payers",
			"assigned_codes": [
				"Freemium model",
				"Gaming industry focus",
				"Network effects",
				"Data-driven monetization"
			],
			"justification": "Crescimento explosivo com apenas 3% de pagantes demonstra eficácia do modelo free-to-play em jogos."
		},
		{
			"article_id": "190655698",
			"article_title": "Effects of Freemium Strategy in the Mobile App Market",
			"quote": "Of the 1,567 ranked paid applications, 1,020 (65.1 percent) offered a free version on Google Play...prices ranging from $0.99 to $39.95",
			"assigned_codes": [
				"Freemium model",
				"Mobile app market",
				"Flexible pricing strategies"
			],
			"justification": "Maioria de apps pagos (65%) oferecendo versão gratuita demonstra ubiquidade da estratégia freemium."
		},
		{
			"article_id": "190655702",
			"article_title": "Network Externalities, Incumbent's Competitive Advantage and Software Start-Ups",
			"quote": "The large majority (63.79 %) of the 918 firms answering the ELISS II survey...Above 70 % of them consider the diffusion of incompatible proprietary solutions as the main barrier",
			"assigned_codes": [
				"Open source business model",
				"Startup company focus",
				"Network effects",
				"High switching costs"
			],
			"justification": "Barreiras de incompatibilidade para startups demonstram impacto de efeitos de rede e custos de mudança em software."
		},
		{
			"article_id": "190655721",
			"article_title": "A Pricing Framework for Software-as-a-Service",
			"quote": "According to a study by Gartner, the global SaaS market is expected to reach 12.1 billion USD by 2014, reflecting a compound annual growth rate of 26%...353 SaaS vendors...USA 63.2%",
			"assigned_codes": [
				"SaaS (Software as a Service)",
				"Growing business model",
				"USA-dominant market",
				"Flexible pricing strategies"
			],
			"justification": "Crescimento de 26% CAGR e concentração de 63% nos EUA demonstram dinâmica geográfica do mercado SaaS."
		},
		{
			"article_id": "190655750",
			"article_title": "The Impact of Open Source Software Commercialization on Firm Value",
			"quote": "I computed the cumulative number of OSS product announcements to proxy for a firm's OSS product portfolio...490 firm-year (70 firms × 7 years) observations",
			"assigned_codes": ["Open source business model", "Value-based pricing"],
			"justification": "Análise longitudinal de 70 empresas demonstra impacto da comercialização de open source no valor da firma."
		},
		{
			"article_id": "190655785",
			"article_title": "The relationship between Open Innovation and Strategy",
			"quote": "fifteen firms involved in OI initiatives were selected...forty-five face-to-face semi-structured interviews were held...very large and ambitious open collaboration with 41 partners",
			"assigned_codes": [
				"Platform business model",
				"Ecosystem management",
				"Mobile app market"
			],
			"justification": "Colaboração com 41 parceiros demonstra complexidade de gestão de ecossistema em inovação aberta móvel."
		},
		{
			"article_id": "190655845",
			"article_title": "Towards a better Understanding of PaaS Business Models",
			"quote": "we identified the main design elements of PaaS business models as well as their relationships by investigating 24 PaaS providers",
			"assigned_codes": [
				"Cloud computing infrastructure",
				"Platform business model",
				"B2B business model"
			],
			"justification": "Análise de 24 provedores PaaS revela elementos de design e relacionamentos em modelos de negócio de plataforma cloud."
		}
	]
}
